# 选项设置属性部分  0-6默认勾选


class 选项设置0():
    名称 = '顶级力量灵药'

    def 适用效果(self, 属性):
        属性.进图力量 += 175


class 选项设置1():
    名称 = '顶级智力灵药'

    def 适用效果(self, 属性):
        属性.进图智力 += 175


class 选项设置2():
    名称 = '斗神之吼秘药'

    def 适用效果(self, 属性):
        属性.斗神之吼秘药 = True


class 选项设置3():
    名称 = '赛丽亚的特调酷饮'

    def 适用效果(self, 属性):
        属性.进图属强 += 5


class 选项设置4():
    名称 = '魔界战力释放秘药'

    def 适用效果(self, 属性):
        属性.进图力量 += 150
        属性.进图智力 += 150


class 选项设置5():
    名称 = '宠物次数适用(10%)'

    def 适用效果(self, 属性):
        属性.年宠技能 = True


class 选项设置6():
    名称 = '称号效果触发'

    def 适用效果(self, 属性):
        属性.称号触发 = True


class 选项设置7():
    名称 = '精神刺激灵药'

    def 适用效果(self, 属性):
        属性.技能冷却缩减(1, 100, 0.20)


class 选项设置8():
    名称 = '虚祖皇家能量秘药'

    def 适用效果(self, 属性):
        属性.进图力量 += 100
        属性.进图智力 += 100
        属性.进图属强 += 5


class 选项设置9():
    名称 = '武者的精神秘药'

    def 适用效果(self, 属性):
        属性.加算冷却缩减 += 0.30


class 选项设置10():
    名称 = '黄金羊毛'

    def 适用效果(self, 属性):
        属性.进图力量 += 60
        属性.进图智力 += 60


class 选项设置11():
    名称 = '白兔子(20%全程)'

    def 适用效果(self, 属性):
        属性.白兔子技能 = True


class 选项设置12():
    名称 = '雷米迪亚蛋糕'

    def 适用效果(self, 属性):
        属性.百分比力智 += 0.20


class 选项设置13():
    名称 = '特权网吧BUFF'

    def 适用效果(self, 属性):
        属性.力量 += 100
        属性.智力 += 100
        属性.技能等级加成('所有', 1, 85, 1)
        属性.加算冷却缩减 += 0.10


class 选项设置14():
    名称 = '希洛克系统奶'

    def 适用效果(self, 属性):
        属性.系统奶系数 = 1.35
        属性.系统奶基数 = 7664


class 选项设置15():
    名称 = '黑鸦系统奶'

    def 适用效果(self, 属性):
        属性.系统奶系数 = 2.31
        属性.系统奶基数 = 4581


class 选项设置16():
    名称 = '奶系BUFF:10W/4.5K'

    def 适用效果(self, 属性):
        属性.进图力量 += 100000
        属性.进图智力 += 100000
        属性.进图物理攻击力 += 4500
        属性.进图魔法攻击力 += 4500
        属性.进图独立攻击力 += 4500


class 选项设置17():
    名称 = '屏蔽三觉'

    def 适用效果(self, 属性):
        属性.屏蔽三觉 = True


class 选项设置18():
    名称 = '[冒险]属性强化药水'

    def 适用效果(self, 属性):
        属性.进图属强 += 10


选项设置列表 = ()
for i in range(19):
    exec('选项设置列表 += (选项设置' + str(i) + '(),)')

选项设置序号 = dict()
for i in range(len(选项设置列表)):
    选项设置序号[选项设置列表[i].名称] = i
