# 选项设置属性部分


class 选项设置0():
    名称 = '称号效果触发'

    def 适用效果(self, 属性):
        属性.称号触发 = True


class 选项设置1():
    名称 = '魔王契约BUFF'

    def 适用效果(self, 属性):
        属性.百分比体精 += 0.05


class 选项设置2():
    名称 = '雷米迪亚蛋糕'

    def 适用效果(self, 属性):
        属性.百分比体精 += 0.20


class 选项设置3():
    名称 = '特权网吧BUFF'

    def 适用效果(self, 属性):
        属性.智力 += 100
        属性.体力 += 100
        属性.精神 += 100
        属性.技能等级加成('所有', 1, 85, 1)


选项设置列表 = ()
for i in range(4):
    exec('选项设置列表 += (选项设置' + str(i) + '(),)')

选项设置序号 = dict()
for i in range(len(选项设置列表)):
    选项设置序号[选项设置列表[i].名称] = i
