
角色列表 = []

from Part.极诣剑魂 import *    
class 职业信息():
    名称 = '剑魂'                          
    角色 = '鬼剑士'
    类名 = '极诣剑魂'                 
    作者 = '纸飞机、Kaito'   
    时间 = '2020/6/10'             
    备注 = '修正流系技能，修正拔刀护石神影手伤害'
角色列表.append(职业信息())

from Part.极诣狂战士 import *    
class 职业信息():
    名称 = '狂战'                          
    角色 = '鬼剑士'  
    类名 = '极诣狂战士'               
    作者 = '纸飞机、爱敏'   
    时间 = '2020/6/8'             
    备注 = '无'
角色列表.append(职业信息())

from Part.极诣剑影 import *    
class 职业信息():
    名称 = '剑影'                         
    角色 = '鬼剑士'    
    类名 = '极诣剑影'              
    作者 = '亚索'   
    时间 = '2020/6/15'             
    备注 = '增加技能选项'
角色列表.append(职业信息())

from Part.极诣驭剑士 import *
class 职业信息():
    名称 = '剑宗(仅巨剑)'                         
    角色 = '鬼剑士'    
    类名 = '极诣驭剑士'              
    作者 = '亚索、纸飞机'   
    时间 = '2020/6/10'             
    备注 = '调整了部分技能数据，修正幻剑阵CP'
角色列表.append(职业信息())

from Part.极诣契魔者 import *
class 职业信息():
    名称 = '剑魔'                         
    角色 = '鬼剑士'    
    类名 = '极诣契魔者'              
    作者 = '爱敏、777、纸飞机'   
    时间 = '2020/6/23'             
    备注 = '修正蛇腹剑：缠被动加成'      
角色列表.append(职业信息())

from Part.极诣流浪武士 import *
class 职业信息():
    名称 = '剑豪'                         
    角色 = '鬼剑士'    
    类名 = '极诣流浪武士'              
    作者 = '爱敏、纸飞机'   
    时间 = '2020/6/9'             
    备注 = '修正飞花逐月百分比(23+1 → 20+1)'     
角色列表.append(职业信息())

from Part.风暴骑兵 import *
class 职业信息():
    名称 = '女大枪'                         
    角色 = '神枪手'    
    类名 = '风暴骑兵'              
    作者 = '纸飞机'   
    时间 = '2020/6/19'             
    备注 = '校准技能数据'     
角色列表.append(职业信息())

from Part.机械之灵 import *
class 职业信息():
    名称 = '女机械'                         
    角色 = '神枪手'    
    类名 = '机械之灵'              
    作者 = '荔枝贝壳'   
    时间 = '2020/6/22'             
    备注 = '修正双觉数据'     
角色列表.append(职业信息())

from Part.芙蕾雅 import *
class 职业信息():
    名称 = '女弹药'                         
    角色 = '神枪手'    
    类名 = '芙蕾雅'              
    作者 = '西瓜'   
    时间 = '2020/6/8'             
    备注 = '无'     
角色列表.append(职业信息())

from Part.绯红玫瑰 import *
class 职业信息():
    名称 = '女漫游'                         
    角色 = '神枪手'    
    类名 = '绯红玫瑰'              
    作者 = '纸飞机、一ye遮天'   
    时间 = '2020/6/8'             
    备注 = '新增刺踢，修正锁链截击'    
角色列表.append(职业信息())

from Part.毁灭者 import *
class 职业信息():
    名称 = '男大枪'                         
    角色 = '神枪手'    
    类名 = '毁灭者'              
    作者 = '纸飞机、幕城'   
    时间 = '2020/6/8'             
    备注 = '无'  
角色列表.append(职业信息())

from Part.大将军 import *
class 职业信息():
    名称 = '男弹药'                         
    角色 = '神枪手'    
    类名 = '大将军'              
    作者 = '小一'   
    时间 = '2020/6/8'             
    备注 = '无' 
角色列表.append(职业信息())

from Part.掠天之翼 import *
class 职业信息():
    名称 = '男漫游'                         
    角色 = '神枪手'    
    类名 = '掠天之翼'              
    作者 = 'Garson'   
    时间 = '2020/6/9'             
    备注 = '修正鹰枪计算方式' 
角色列表.append(职业信息())

from Part.机械元首 import *
class 职业信息():
    名称 = '男机械'                         
    角色 = '神枪手'    
    类名 = '机械元首'              
    作者 = '韩械'   
    时间 = '2020/6/13'             
    备注 = '修正斗志之歌成长' 
角色列表.append(职业信息())

from Part.极诣枪炮师男 import *
class 职业信息():
    名称 = '男大枪(三觉)'                         
    角色 = '神枪手'    
    类名 = '极诣枪炮师男'              
    作者 = '纸飞机、幕城'   
    时间 = '2020/6/8'             
    备注 = '无'  
角色列表.append(职业信息())

from Part.极诣弹药专家男 import *
class 职业信息():
    名称 = '男弹药(三觉)'                         
    角色 = '神枪手'    
    类名 = '极诣弹药专家男'              
    作者 = '小一'   
    时间 = '2020/6/8'             
    备注 = '无'  
角色列表.append(职业信息())

from Part.毒神绝 import *
class 职业信息():
    名称 = '女街霸'                         
    角色 = '格斗家'    
    类名 = '毒神绝'              
    作者 = '纸飞机、雅男'   
    时间 = '2020/6/21'             
    备注 = '修正部分技能数据' 
角色列表.append(职业信息())

from Part.念帝 import *
class 职业信息():
    名称 = '女气功'                         
    角色 = '格斗家'    
    类名 = '念帝'              
    作者 = '疯'   
    时间 = '2020/6/8'             
    备注 = '无' 
角色列表.append(职业信息())

from Part.归元街霸女 import *
class 职业信息():
    名称 = '女街霸(三觉)'                         
    角色 = '格斗家'    
    类名 = '归元街霸女'              
    作者 = '纸飞机、雅男'   
    时间 = '2020/6/21'             
    备注 = '修正部分技能数据' 
角色列表.append(职业信息())

from Part.归元气功师女 import *
class 职业信息():
    名称 = '女气功(三觉)'                         
    角色 = '格斗家'    
    类名 = '归元气功师女'              
    作者 = '疯'   
    时间 = '2020/6/8'             
    备注 = '无'
角色列表.append(职业信息())

from Part.归元气功师男 import *
class 职业信息():
    名称 = '男气功'                         
    角色 = '格斗家'    
    类名 = '归元气功师男'              
    作者 = '球'   
    时间 = '2020/6/26'             
    备注 = '修正技能数据'  
角色列表.append(职业信息())

from Part.刹那永恒 import *
class 职业信息():
    名称 = '冰结'                         
    角色 = '魔法师'    
    类名 = '刹那永恒'              
    作者 = '平静'   
    时间 = '2020/6/8'             
    备注 = '无'
角色列表.append(职业信息())

from Part.元素圣灵 import *
class 职业信息():
    名称 = '元素'                         
    角色 = '魔法师'    
    类名 = '元素圣灵'              
    作者 = '碳末&平静'   
    时间 = '2020/6/8'             
    备注 = '无'
角色列表.append(职业信息())

from Part.湮灭之瞳 import *
class 职业信息():
    名称 = '魔皇'                         
    角色 = '魔法师'    
    类名 = '湮灭之瞳'              
    作者 = '碳末'   
    时间 = '2020/6/8'             
    备注 = '无'
角色列表.append(职业信息())

from Part.风神 import *
class 职业信息():
    名称 = '风法'                         
    角色 = '魔法师'    
    类名 = '风神'              
    作者 = '龙卷风'   
    时间 = '2020/6/8'             
    备注 = '无'
角色列表.append(职业信息())

from Part.战斗神思者 import *
class 职业信息():
    名称 = '审判'                         
    角色 = '圣职者'    
    类名 = '战斗神思者'              
    作者 = 'Paxis'   
    时间 = '2020/6/14'             
    备注 = '校正部分小技能数据'
角色列表.append(职业信息())

from Part.弑心镇魂者 import *
class 职业信息():
    名称 = '特工'                         
    角色 = '枪剑士'    
    类名 = '弑心镇魂者'              
    作者 = '碳末'   
    时间 = '2020/6/12'             
    备注 = '修改了技能释放次数计算'
角色列表.append(职业信息())

from Part.屠戮之魂 import *
class 职业信息():
    名称 = '光枪'                         
    角色 = '魔枪士'    
    类名 = '屠戮之魂'              
    作者 = '纸飞机、爱敏'   
    时间 = '2020/6/8'             
    备注 = '无'
角色列表.append(职业信息())

from Part.极诣漫游枪手男 import *
class 职业信息():
    名称 = '男漫游(三觉)'                         
    角色 = '神枪手'    
    类名 = '极诣漫游枪手男'              
    作者 = '共产主义战士'   
    时间 = '2020/6/9'             
    备注 = '修正鹰枪计算方式'
角色列表.append(职业信息())

from Part.极诣暗殿骑士 import *
class 职业信息():
    名称 = '暗帝'
    角色 = '鬼剑士'
    类名 = '极诣暗殿骑士'
    作者 = '亚索'
    时间 = '2020/6/9'
    备注 = '无'
角色列表.append(职业信息())

from Part.混沌魔灵 import *
class 职业信息():
    名称 = '魔灵'
    角色 = '守护者'
    类名 = '混沌魔灵'
    作者 = '千万别玩混沌魔灵'
    时间 = '2020/6/12'
    备注 = '微调部分技能数据'
角色列表.append(职业信息())

from Part.BUFF神思者 import *
class 职业信息():
    名称 = '奶爸'
    角色 = '圣职者'
    类名 = 'BUFF神思者'
    作者 = '纸飞机、天府星、时光'
    时间 = '2020/6/13'
    备注 = '修正大祭司的神启礼服属性'
角色列表.append(职业信息())

from Part.奶妈 import *
class 职业信息():
    名称 = '奶妈'
    角色 = '圣职者'
    类名 = '奶妈'
    作者 = '纸飞机、天府星、时光'
    时间 = '2020/6/13'
    备注 = '修正大祭司的神启礼服属性'
角色列表.append(职业信息())

from Part.龙神 import *
class 职业信息():
    名称 = '龙神'
    角色 = '守护者'
    类名 = '龙神'
    作者 = '浅笑'
    时间 = '2020/6/13'
    备注 = '无'
角色列表.append(职业信息())

from Part.破晓女神 import *
class 职业信息():
    名称 = '帕拉丁'
    角色 = '守护者'
    类名 = '破晓女神'
    作者 = '疯'
    时间 = '2020/6/13'
    备注 = '无'
角色列表.append(职业信息())

from Part.大地女神 import *
class 职业信息():
    名称 = '精灵骑士'
    角色 = '守护者'
    类名 = '大地女神'
    作者 = '疯'
    时间 = '2020/6/13'
    备注 = '无'
角色列表.append(职业信息())

from Part.极诣机械师男 import *
class 职业信息():
    名称 = '男机械(三觉)'
    角色 = '神枪手'
    类名 = '极诣机械师男'
    作者 = '韩械'
    时间 = '2020/6/13'
    备注 = '实验'
角色列表.append(职业信息())

from Part.奶萝 import *
class 职业信息():
    名称 = '奶萝'
    角色 = '魔法师'
    类名 = '奶萝'
    作者 = '纸飞机、天府星、时光'
    时间 = '2020/6/13'
    备注 = '无'
角色列表.append(职业信息())

from Part.永生者 import *
class 职业信息():
    名称 = '复仇'
    角色 = '圣职者'
    类名 = '永生者'
    作者 = '亚索'
    时间 = '2020/6/13'
    备注 = '无'
角色列表.append(职业信息())

from Part.归元柔道家男 import *
class 职业信息():
    名称 = '男柔道'
    角色 = '格斗家'
    类名 = '归元柔道家男'
    作者 = '海豹'
    时间 = '2020/6/19'
    备注 = '修正部分数据'
角色列表.append(职业信息())

from Part.忍者 import *
class 职业信息():
    名称 = '忍者'
    角色 = '暗夜使者'
    类名 = '忍者'
    作者 = '平静、千万别玩混沌魔灵'
    时间 = '2020/6/17'
    备注 = '六道复制技能需要打勾'
角色列表.append(职业信息())

from Part.正义仲裁者 import *
class 职业信息():
    名称 = '蓝拳'
    角色 = '圣职者'
    类名 = '正义仲裁者'
    作者 = '亚索'
    时间 = '2020/6/17'
    备注 = '无'
角色列表.append(职业信息())

from Part.真龙星君 import *
class 职业信息():
    名称 = '驱魔'
    角色 = '圣职者'
    类名 = '真龙星君'
    作者 = 'Paxis'
    时间 = '2020/6/17'
    备注 = '无'
角色列表.append(职业信息())

from Part.归元散打男 import *
class 职业信息():
    名称 = '男散打'
    角色 = '格斗家'
    类名 = '归元散打男'
    作者 = '机枪哥'
    时间 = '2020/6/22'
    备注 = '修正进图面板取整&旋风碎心踢有BUG导致hit丢失'
角色列表.append(职业信息())

from Part.极诣鬼泣 import *
class 职业信息():
    名称 = '鬼泣'
    角色 = '鬼剑士'
    类名 = '极诣鬼泣'
    作者 = '真奥'
    时间 = '2020/6/19'
    备注 = '无'
角色列表.append(职业信息())

from Part.极诣阿修罗 import *
class 职业信息():
    名称 = '修罗'
    角色 = '鬼剑士'
    类名 = '极诣阿修罗'
    作者 = '墨羽狼、纸飞机'
    时间 = '2020/6/20'
    备注 = '无'
角色列表.append(职业信息())

from Part.救世主 import *
class 职业信息():
    名称 = '救世主'
    角色 = '圣职者'
    类名 = '救世主'
    作者 = '千景'
    时间 = '2020/6/21'
    备注 = '无'
角色列表.append(职业信息())

from Part.影舞者 import *
class 职业信息():
    名称 = '影舞者'
    角色 = '暗夜使者'
    类名 = '影舞者'
    作者 = '千万别玩混沌魔灵'
    时间 = '2020/6/21'
    备注 = ''
角色列表.append(职业信息())

from Part.神龙天女 import *
class 职业信息():
    名称 = '神龙天女'
    角色 = '圣职者'
    类名 = '神龙天女'
    作者 = '贰肆'
    时间 = '2020/6/21'
    备注 = ''
角色列表.append(职业信息())

from Part.铁血统帅 import *
class 职业信息():
    名称 = '暗刃'
    角色 = '枪剑士'
    类名 = '铁血统帅'
    作者 = '熬夜砍树'
    时间 = '2020/6/22'
    备注 = '发现了游戏的若干bug'
角色列表.append(职业信息())

from Part.魔道学者 import *
class 职业信息():
    名称 = '魔道'
    角色 = '魔法师'
    类名 = '魔道学者'
    作者 = '极脂の魔道'
    时间 = '2020/6/22'
    备注 = ''
角色列表.append(职业信息())

角色类型 = []
类型角色 = []
for i in 角色列表:
    if i.角色 not in 角色类型:
        角色类型.append(i.角色)

from Part.巅峰狂徒 import *
class 职业信息():
    名称 = '战线佣兵'
    角色 = '枪剑士'
    类名 = '巅峰狂徒'
    作者 = '熬夜砍树'
    时间 = '2020/6/25'
    备注 = '数据有待修正'
角色列表.append(职业信息())


for i in 角色类型:
    temp = []
    for j in 角色列表:
        if j.角色 == i:
            temp.append(j.名称)
    类型角色.append(temp)