from Part.风暴骑兵 import *
from Part.毁灭者 import *
from Part.极诣枪炮师男 import *
from Part.机械之灵 import *
from Part.芙蕾雅 import *
from Part.大将军 import *
from Part.极诣弹药专家男 import *
from Part.屠戮之魂 import *
from Part.极诣契魔者 import *
from Part.极诣狂战士 import *
from Part.极诣流浪武士 import *
from Part.毒神绝 import *
from Part.刹那永恒 import *
from Part.元素圣灵 import *
from Part.极诣剑影 import *
from Part.掠天之翼 import *
from Part.战斗神思者 import *
from Part.弑心镇魂者 import *
from Part.极诣驭剑士 import *
from Part.机械元首 import *
from Part.湮灭之瞳 import *
from Part.念皇 import *
from Part.归元街霸女 import *
from Part.风神 import *
from Part.念帝 import *
from Part.极诣剑魂 import *
from Part.归元气功师女 import *
from Part.归元气功师男 import *
from Part.绯红玫瑰 import *
from Part.极诣漫游枪手男 import *
from Part.极诣暗殿骑士 import *
from Part.混沌魔灵 import *

# 新增一个角色  from Part. import *   并修改对应的职业信息 类名是关键

#名称   主界面显示的名称
#角色   鬼剑士 神枪手 格斗家 魔法师 圣职者 暗夜使者 守护者 魔枪士 枪剑士 黑暗武士 缔造者
#类名   class角色窗口的名称
#作者   制作人员名单
#时间   最后修改的日期
#备注   更新信息说明

class 职业信息0():
    名称 = '剑魂'                          
    角色 = '鬼剑士'
    类名 = '极诣剑魂'                 
    作者 = '纸飞机、Kaito'   
    时间 = '2020/6/10'             
    备注 = '修正流系技能，修正拔刀护石神影手伤害'

class 职业信息1():
    名称 = '狂战'                          
    角色 = '鬼剑士'  
    类名 = '极诣狂战士'               
    作者 = '纸飞机、爱敏'   
    时间 = '2020/6/8'             
    备注 = '无'

class 职业信息2():
    名称 = '剑影'                         
    角色 = '鬼剑士'    
    类名 = '极诣剑影'              
    作者 = '亚索'   
    时间 = '2020/6/8'             
    备注 = '无'

class 职业信息3():
    名称 = '剑宗(仅巨剑)'                         
    角色 = '鬼剑士'    
    类名 = '极诣驭剑士'              
    作者 = '亚索、纸飞机'   
    时间 = '2020/6/10'             
    备注 = '调整了部分技能数据'

class 职业信息4():
    名称 = '剑魔'                         
    角色 = '鬼剑士'    
    类名 = '极诣契魔者'              
    作者 = '爱敏、777、纸飞机'   
    时间 = '2020/6/8'             
    备注 = '无'      

class 职业信息5():
    名称 = '剑豪'                         
    角色 = '鬼剑士'    
    类名 = '极诣流浪武士'              
    作者 = '爱敏、纸飞机'   
    时间 = '2020/6/9'             
    备注 = '修正飞花逐月百分比(23+1 → 20+1)'     

class 职业信息6():
    名称 = '女大枪'                         
    角色 = '神枪手'    
    类名 = '风暴骑兵'              
    作者 = '纸飞机'   
    时间 = '2020/6/8'             
    备注 = '无'     

class 职业信息7():
    名称 = '女机械'                         
    角色 = '神枪手'    
    类名 = '机械之灵'              
    作者 = '荔枝贝壳'   
    时间 = '2020/6/8'             
    备注 = '无'     

class 职业信息8():
    名称 = '女弹药'                         
    角色 = '神枪手'    
    类名 = '芙蕾雅'              
    作者 = '西瓜'   
    时间 = '2020/6/8'             
    备注 = '无'     

class 职业信息9():
    名称 = '女漫游'                         
    角色 = '神枪手'    
    类名 = '绯红玫瑰'              
    作者 = '纸飞机、一ye遮天'   
    时间 = '2020/6/8'             
    备注 = '新增刺踢，修正锁链截击'    

class 职业信息10():
    名称 = '男大枪'                         
    角色 = '神枪手'    
    类名 = '毁灭者'              
    作者 = '纸飞机、幕城'   
    时间 = '2020/6/8'             
    备注 = '无'  

class 职业信息11():
    名称 = '男弹药'                         
    角色 = '神枪手'    
    类名 = '大将军'              
    作者 = '小一'   
    时间 = '2020/6/8'             
    备注 = '无' 

class 职业信息12():
    名称 = '男漫游'                         
    角色 = '神枪手'    
    类名 = '掠天之翼'              
    作者 = 'Garson'   
    时间 = '2020/6/9'             
    备注 = '修正鹰枪计算方式' 

class 职业信息13():
    名称 = '男机械'                         
    角色 = '神枪手'    
    类名 = '机械元首'              
    作者 = '韩械'   
    时间 = '2020/6/8'             
    备注 = '无' 

class 职业信息14():
    名称 = '男大枪(三觉)'                         
    角色 = '神枪手'    
    类名 = '极诣枪炮师男'              
    作者 = '纸飞机、幕城'   
    时间 = '2020/6/8'             
    备注 = '无'  

class 职业信息15():
    名称 = '男弹药(三觉)'                         
    角色 = '神枪手'    
    类名 = '极诣弹药专家男'              
    作者 = '小一'   
    时间 = '2020/6/8'             
    备注 = '无'  

class 职业信息16():
    名称 = '女街霸'                         
    角色 = '格斗家'    
    类名 = '毒神绝'              
    作者 = '纸飞机、雅男'   
    时间 = '2020/6/8'             
    备注 = '增加毒雷个数选项'  

class 职业信息17():
    名称 = '男气功'                         
    角色 = '格斗家'    
    类名 = '念皇'              
    作者 = '球'   
    时间 = '2020/6/8'             
    备注 = '无'  

class 职业信息18():
    名称 = '女气功'                         
    角色 = '格斗家'    
    类名 = '念帝'              
    作者 = '疯'   
    时间 = '2020/6/8'             
    备注 = '无' 

class 职业信息19():
    名称 = '女街霸(三觉)'                         
    角色 = '格斗家'    
    类名 = '归元街霸女'              
    作者 = '纸飞机、雅男'   
    时间 = '2020/6/8'             
    备注 = '无' 

class 职业信息20():
    名称 = '男气功(三觉)'                         
    角色 = '格斗家'    
    类名 = '归元气功师男'              
    作者 = '球'   
    时间 = '2020/6/8'             
    备注 = '修正冲云念气场伤害'  

class 职业信息21():
    名称 = '女气功(三觉)'                         
    角色 = '格斗家'    
    类名 = '归元气功师女'              
    作者 = '疯'   
    时间 = '2020/6/8'             
    备注 = '无'

class 职业信息22():
    名称 = '冰结'                         
    角色 = '魔法师'    
    类名 = '刹那永恒'              
    作者 = '平静'   
    时间 = '2020/6/8'             
    备注 = '无'

class 职业信息23():
    名称 = '元素'                         
    角色 = '魔法师'    
    类名 = '元素圣灵'              
    作者 = '碳末&平静'   
    时间 = '2020/6/8'             
    备注 = '无'

class 职业信息24():
    名称 = '魔皇'                         
    角色 = '魔法师'    
    类名 = '湮灭之瞳'              
    作者 = '碳末'   
    时间 = '2020/6/8'             
    备注 = '无'

class 职业信息25():
    名称 = '风法'                         
    角色 = '魔法师'    
    类名 = '风神'              
    作者 = '龙卷风'   
    时间 = '2020/6/8'             
    备注 = '无'

class 职业信息26():
    名称 = '审判'                         
    角色 = '圣职者'    
    类名 = '战斗神思者'              
    作者 = 'Paxis'   
    时间 = '2020/6/9'             
    备注 = '校正技能数据'

class 职业信息27():
    名称 = '特工'                         
    角色 = '枪剑士'    
    类名 = '弑心镇魂者'              
    作者 = '碳末'   
    时间 = '2020/6/8'             
    备注 = '无'

class 职业信息28():
    名称 = '光枪'                         
    角色 = '魔枪士'    
    类名 = '屠戮之魂'              
    作者 = '纸飞机、爱敏'   
    时间 = '2020/6/8'             
    备注 = '无'

class 职业信息29():
    名称 = '男漫游(三觉)'                         
    角色 = '神枪手'    
    类名 = '极诣漫游枪手男'              
    作者 = '共产主义战士'   
    时间 = '2020/6/9'             
    备注 = '修正鹰枪计算方式'

class 职业信息30():
    名称 = '暗帝'
    角色 = '鬼剑士'
    类名 = '极诣暗殿骑士'
    作者 = '亚索'
    时间 = '2020/6/9'
    备注 = '无'

class 职业信息31():
    名称 = '魔灵'
    角色 = '守护者'
    类名 = '混沌魔灵'
    作者 = '千万别玩混沌魔灵'
    时间 = '2020/6/9'
    备注 = '无'

角色列表 = []
i = 0
while i >= 0:
    try:
        exec('角色列表.append(职业信息'+str(i)+'())')
        i += 1
    except:
        i = -1

角色类型 = []
类型角色 = []
for i in 角色列表:
    if i.角色 not in 角色类型:
        角色类型.append(i.角色)

for i in 角色类型:
    temp = []
    for j in 角色列表:
        if j.角色 == i:
            temp.append(j.名称)
    类型角色.append(temp)