
角色列表 = []

from Part.极诣·剑魂 import *    
class 职业信息():
    显示名称 = '极诣·剑魂'
    类名 = '极诣·剑魂'  
    类名2 = '无'
    序号 = 1               
    作者 = '纸飞机、Kaito'   
    时间 = '2020/6/10'             
    备注 = '修正流系技能，修正拔刀护石神影手伤害'
角色列表.append(职业信息())

from Part.极诣·狂战士 import *    
class 职业信息(): 
    显示名称 = '极诣·狂战士'
    类名 = '极诣·狂战士'    
    类名2 = '无'
    序号 = 3           
    作者 = '纸飞机、爱敏'   
    时间 = '2020/6/28'             
    备注 = '修正血剑技能数据'
角色列表.append(职业信息())

from Part.极诣·剑影 import *    
class 职业信息(): 
    显示名称 = '极诣·剑影'  
    类名 = '极诣·剑影'   
    类名2 = '无'
    序号 = 5           
    作者 = '亚索'   
    时间 = '2020/7/6'
    备注 = '优化一觉数据，更新默认连招'
角色列表.append(职业信息())

from Part.极诣·驭剑士 import *
class 职业信息():
    显示名称 = '极诣·驭剑士'
    类名 = '极诣·驭剑士'   
    类名2 = '无'
    序号 = 6             
    作者 = '亚索、纸飞机、平静、雪露'   
    时间 = '2020/7/7'             
    备注 = '添加太刀短剑钝器计算'
角色列表.append(职业信息())

from Part.极诣·契魔者 import *
class 职业信息():  
    显示名称 = '极诣·契魔者'
    类名 = '极诣·契魔者'    
    类名2 = '无'
    序号 = 8          
    作者 = '爱敏、777、纸飞机'   
    时间 = '2020/6/23'             
    备注 = '修正蛇腹剑：缠被动加成'      
角色列表.append(职业信息())

from Part.极诣·流浪武士 import *
class 职业信息(): 
    显示名称 = '极诣·流浪武士' 
    类名 = '极诣·流浪武士'  
    类名2 = '无'
    序号 = 9              
    作者 = '爱敏、纸飞机'   
    时间 = '2020/6/9'             
    备注 = '修正飞花逐月百分比(23+1 → 20+1)'     
角色列表.append(职业信息())

from Part.风暴骑兵 import *
class 职业信息():  
    显示名称 = '风暴骑兵'
    类名 = '风暴骑兵'   
    类名2 = '无'
    序号 = 27            
    作者 = '纸飞机'   
    时间 = '2020/6/19'             
    备注 = '校准技能数据'     
角色列表.append(职业信息())

from Part.机械之灵 import *
class 职业信息():    
    显示名称 = '机械之灵'
    类名 = '机械之灵'  
    类名2 = '无'
    序号 = 28              
    作者 = '荔枝贝壳'   
    时间 = '2020/6/22'             
    备注 = '修正双觉数据'     
角色列表.append(职业信息())

from Part.芙蕾雅 import *
class 职业信息():   
    显示名称 = '芙蕾雅'
    类名 = '芙蕾雅'  
    类名2 = '无'
    序号 = 29              
    作者 = '西瓜'   
    时间 = '2020/6/27'             
    备注 = '修正自选次数时子弹伤害'     
角色列表.append(职业信息())

from Part.绯红玫瑰 import *
class 职业信息():   
    显示名称 = '绯红玫瑰'
    类名 = '绯红玫瑰' 
    类名2 = '无'
    序号 = 26               
    作者 = '纸飞机、一ye遮天'   
    时间 = '2020/6/8'             
    备注 = '新增刺踢，修正锁链截击'    
角色列表.append(职业信息())

from Part.重霄·枪炮师·男 import *
class 职业信息():   
    显示名称 = '重霄·枪炮师'
    类名 = '重霄·枪炮师·男'  
    类名2 = '无'
    序号 = 22              
    作者 = '纸飞机、幕城'   
    时间 = '2020/6/8'             
    备注 = '无'  
角色列表.append(职业信息())

from Part.重霄·弹药专家·男 import *
class 职业信息():   
    显示名称 = '重霄·弹药专家'
    类名 = '重霄·弹药专家·男'  
    类名2 = '无'
    序号 = 24              
    作者 = '小一'   
    时间 = '2020/6/8'             
    备注 = '无' 
角色列表.append(职业信息())

from Part.重霄·漫游枪手·男 import *
class 职业信息():   
    显示名称 = '重霄·漫游枪手' 
    类名 = '重霄·漫游枪手·男'   
    类名2 = '无'              
    序号 = 21             
    作者 = 'Garson&共产主义战士'   
    时间 = '2020/6/9'             
    备注 = '修正鹰枪计算方式' 
角色列表.append(职业信息())

from Part.重霄·机械师·男 import *
class 职业信息():   
    显示名称 = '重霄·机械师'
    类名 = '重霄·机械师·男' 
    类名2 = '无'
    序号 = 23               
    作者 = '韩械'   
    时间 = '2020/6/13'             
    备注 = '修正斗志之歌成长' 
角色列表.append(职业信息())

from Part.归元·街霸·女 import *
class 职业信息():  
    显示名称 = '归元·街霸'
    类名 = '归元·街霸·女'  
    类名2 = '无'
    序号 = 18              
    作者 = '纸飞机、雅男'   
    时间 = '2020/6/21'             
    备注 = '修正部分技能数据' 
角色列表.append(职业信息())

from Part.归元·街霸·男 import *
class 职业信息():  
    显示名称 = '归元·街霸'
    类名 = '归元·街霸·男'
    类名2 = '无'
    序号 = 13              
    作者 = 'Paxis'   
    时间 = '2020/7/12'             
    备注 = '' 
角色列表.append(职业信息())

from Part.归元·气功师·女 import *
class 职业信息():   
    显示名称 = '归元·气功师'
    类名 = '归元·气功师·女' 
    类名2 = '无'
    序号 = 16               
    作者 = '疯'   
    时间 = '2020/6/8'             
    备注 = '无' 
角色列表.append(职业信息())

from Part.归元·散打·女 import *
class 职业信息():
    显示名称 = '归元·散打'
    类名 = '归元·散打·女'
    类名2 = '无'
    序号 = 17  
    作者 = 'Leisa'
    时间 = '2020/6/29'
    备注 = '校准技能数据'
角色列表.append(职业信息())

from Part.归元·气功师·男 import *
class 职业信息():  
    显示名称 = '归元·气功师'
    类名 = '归元·气功师·男'   
    类名2 = '无'
    序号 = 11            
    作者 = '球'   
    时间 = '2020/6/26'             
    备注 = '修正技能数据'  
角色列表.append(职业信息())

from Part.刹那永恒 import *
class 职业信息():  
    显示名称 = '刹那永恒'
    类名 = '刹那永恒'  
    类名2 = '无'
    序号 = 32             
    作者 = '平静'   
    时间 = '2020/6/27'             
    备注 = '校准技能数据'
角色列表.append(职业信息())

from Part.元素圣灵 import *
from Part.真·元素师 import *
class 职业信息():  
    显示名称 = '元素圣灵'
    类名 = '元素圣灵'  
    类名2 = '真·元素师'
    序号 = 36            
    作者 = '碳末&平静'   
    时间 = '2020/6/8'             
    备注 = '无'
角色列表.append(职业信息())

from Part.湮灭之瞳 import *
class 职业信息():   
    显示名称 = '湮灭之瞳'
    类名 = '湮灭之瞳'  
    类名2 = '无'
    序号 = 31            
    作者 = '碳末'   
    时间 = '2020/6/8'             
    备注 = '无'
角色列表.append(职业信息())

from Part.风神 import *
class 职业信息():   
    显示名称 = '风神'
    类名 = '风神'  
    类名2 = '无'
    序号 = 34             
    作者 = '龙卷风'   
    时间 = '2020/6/8'             
    备注 = '无'
角色列表.append(职业信息())

from Part.战斗·神启·圣骑士 import *
from Part.BUFF·神启·圣骑士 import *
class 职业信息():
    显示名称 = '神启·圣骑士'
    类名 = 'BUFF·神启·圣骑士'  
    类名2 = '战斗·神启·圣骑士'  
    序号 = 41             
    作者 = '纸飞机、天府星、时光/Paxis'   
    时间 = '2020/6/14'             
    备注 = '校正部分小技能数据'
角色列表.append(职业信息())

from Part.弑心镇魂者 import *
class 职业信息():  
    显示名称 = '弑心镇魂者'
    类名 = '弑心镇魂者'   
    类名2 = '无'
    序号 = 67           
    作者 = '碳末'   
    时间 = '2020/6/12'             
    备注 = '修改了技能释放次数计算'
角色列表.append(职业信息())

from Part.屠戮之魂 import *
class 职业信息():   
    显示名称 = '屠戮之魂'
    类名 = '屠戮之魂'
    类名2 = '无'
    序号 = 63               
    作者 = '纸飞机、爱敏'   
    时间 = '2020/6/8'             
    备注 = '无'
角色列表.append(职业信息())

from Part.极诣·暗殿骑士 import *
class 职业信息():
    显示名称 = '极诣·暗殿骑士'
    类名 = '极诣·暗殿骑士'
    类名2 = '无'
    序号 = 7   
    作者 = '亚索'
    时间 = '2020/6/9'
    备注 = '无'
角色列表.append(职业信息())

from Part.黑曜神 import *
class 职业信息():
    显示名称 = '黑曜神'
    类名 = '黑曜神'
    类名2 = '无'
    序号 = 57   
    作者 = '千万别玩混沌魔灵'
    时间 = '2020/6/12'
    备注 = '微调部分技能数据'
角色列表.append(职业信息())

from Part.炽天使 import *
from Part.神启·圣骑士 import *
class 职业信息():
    显示名称 = '炽天使'
    类名 = '炽天使'
    类名2 = '神启·圣骑士'
    序号 = 46   
    作者 = '纸飞机、天府星、时光'
    时间 = '2020/6/13'
    备注 = '修正大祭司的神启礼服属性'
角色列表.append(职业信息())

from Part.龙神 import *
class 职业信息():
    显示名称 = '龙神'
    类名 = '龙神'
    类名2 = '无'
    序号 = 59   
    作者 = '浅笑'
    时间 = '2020/6/13'
    备注 = '无'
角色列表.append(职业信息())

from Part.破晓女神 import *
class 职业信息():
    显示名称 = '破晓女神'
    类名 = '破晓女神'
    类名2 = '无'
    序号 = 58   
    作者 = '疯'
    时间 = '2020/6/13'
    备注 = '无'
角色列表.append(职业信息())

from Part.大地女神 import *
class 职业信息():
    显示名称 = '大地女神'
    类名 = '大地女神'
    类名2 = '无'
    序号 = 56   
    作者 = '疯'
    时间 = '2020/6/13'
    备注 = '无'
角色列表.append(职业信息())

from Part.冥月女神 import *
from Part.真·小魔女 import *
class 职业信息():
    显示名称 = '冥月女神'
    类名 = '冥月女神'
    类名2 = '真·小魔女'
    序号 = 40  
    作者 = '纸飞机、天府星、时光'
    时间 = '2020/6/29'
    备注 = '基础+17被动-17，优化显示'
角色列表.append(职业信息())

from Part.神启·复仇者 import *
class 职业信息():
    显示名称 = '神启·复仇者'
    类名 = '神启·复仇者'
    类名2 = '无'
    序号 = 44  
    作者 = '亚索'
    时间 = '2020/7/1'
    备注 = '添加三觉版本'
角色列表.append(职业信息())

from Part.归元·柔道家·男 import *
class 职业信息():
    显示名称 = '归元·柔道家'
    类名 = '归元·柔道家·男'
    类名2 = '无'
    序号 = 14  
    作者 = '海豹'
    时间 = '2020/7/6'
    备注 = '修正武莲华，地狱风火轮，裂石破天数据'
角色列表.append(职业信息())

from Part.不知火 import *
class 职业信息():
    显示名称 = '不知火'
    类名 = '不知火'
    类名2 = '无'
    序号 = 53  
    作者 = '平静、千万别玩混沌魔灵'
    时间 = '2020/6/17'
    备注 = '六道复制技能需要打勾'
角色列表.append(职业信息())

from Part.神启·蓝拳圣使 import *
class 职业信息():
    显示名称 = '神启·蓝拳圣使'
    类名 = '神启·蓝拳圣使'
    类名2 = '无'
    序号 = 42  
    作者 = '亚索'
    时间 = '2020/7/1'
    备注 = '添加三觉版本'
角色列表.append(职业信息())

from Part.神启·驱魔师 import *
class 职业信息():
    显示名称 = '神启·驱魔师'
    类名 = '神启·驱魔师'
    类名2 = '无'
    序号 = 43  
    作者 = 'Paxis'
    时间 = '2020/6/17'
    备注 = '无'
角色列表.append(职业信息())

from Part.归元·散打·男 import *
class 职业信息():
    显示名称 = '归元·散打'
    类名 = '归元·散打·男'
    类名2 = '无'
    序号 = 12  
    作者 = '机枪哥'
    时间 = '2020/6/22'
    备注 = '修正进图面板取整&旋风碎心踢有BUG导致hit丢失'
角色列表.append(职业信息())

from Part.极诣·鬼泣 import *
class 职业信息():
    显示名称 = '极诣·鬼泣'
    类名 = '极诣·鬼泣'
    类名2 = '无'
    序号 = 2  
    作者 = '真奥'
    时间 = '2020/6/19'
    备注 = '无'
角色列表.append(职业信息())

from Part.极诣·阿修罗 import *
class 职业信息():
    显示名称 = '极诣·阿修罗'
    类名 = '极诣·阿修罗'
    类名2 = '无'
    序号 = 4
    作者 = '墨羽狼、纸飞机'
    时间 = '2020/6/20'
    备注 = '无'
角色列表.append(职业信息())

from Part.救世主 import *
from Part.神启·诱魔者 import *
class 职业信息():
    显示名称 = '救世主'
    类名 = '救世主'
    类名2 = '神启·诱魔者'
    序号 = 49  
    作者 = '千景'
    时间 = '2020/6/21'
    备注 = '无'
角色列表.append(职业信息())

from Part.幽冥 import *
class 职业信息():
    显示名称 = '幽冥'
    类名 = '幽冥'
    类名2 = '无'
    序号 = 54  
    作者 = '千万别玩混沌魔灵'
    时间 = '2020/6/21'
    备注 = ''
角色列表.append(职业信息())

from Part.神龙天女 import *
from Part.神启·巫女 import *
class 职业信息():
    显示名称 = '神龙天女'
    类名 = '神龙天女'
    类名2 = '神启·巫女'
    序号 = 48  
    作者 = '贰肆/浅笑'
    时间 = '2020/6/21'
    备注 = ''
角色列表.append(职业信息())

from Part.铁血统帅 import *
class 职业信息():
    显示名称 = '铁血统帅'
    类名 = '铁血统帅'
    类名2 = '无'
    序号 = 66  
    作者 = '熬夜砍树'
    时间 = '2020/6/22'
    备注 = '发现了游戏的若干bug'
角色列表.append(职业信息())

from Part.古灵精怪 import *
from Part.真·魔道学者 import *
class 职业信息():
    显示名称 = '古灵精怪'
    类名 = '古灵精怪'
    类名2 = '真·魔道学者'
    序号 = 39  
    作者 = '极脂の魔道'
    时间 = '2020/6/29'
    备注 = '校准技能数据'
角色列表.append(职业信息())

from Part.巅峰狂徒 import *
class 职业信息():
    显示名称 = '巅峰狂徒'
    类名 = '巅峰狂徒'
    类名2 = '无'
    序号 = 68 
    作者 = '熬夜砍树'
    时间 = '2020/6/25'
    备注 = '数据有待修正'
角色列表.append(职业信息())

from Part.伊斯塔战灵 import *
from Part.真·战斗法师 import *
class 职业信息():
    显示名称 = '伊斯塔战灵'
    类名 = '伊斯塔战灵'
    类名2 = '真·战斗法师'
    序号 = 38 
    作者 = '荔枝贝壳'
    时间 = '2020/7/1'
    备注 = ''
角色列表.append(职业信息())

from Part.未来开拓者 import *
class 职业信息():
    显示名称 = '未来开拓者'
    类名 = '未来开拓者'
    类名2 = '无'
    序号 = 69
    作者 = '熬夜砍树'
    时间 = '2020/7/1'
    备注 = '数据有待修正'
角色列表.append(职业信息())

from Part.混沌行者 import *
class 职业信息():
    显示名称 = '混沌行者'
    类名 = '混沌行者'
    类名2 = '无'
    序号 = 35
    作者 = '洗具，感谢decosta'
    时间 = '2020/7/3'
    备注 = ''
角色列表.append(职业信息())

from Part.亡魂主宰 import *
class 职业信息():
    显示名称 = '亡魂主宰'
    类名 = '亡魂主宰'
    类名2 = '无'
    序号 = 52
    作者 = '千万别玩混沌魔灵'
    时间 = '2020/7/4'
    备注 = ''
角色列表.append(职业信息())

from Part.圣武枪魂 import *
class 职业信息():
    显示名称 = '圣武枪魂'
    类名 = '圣武枪魂'
    类名2 = '无'
    序号 = 62
    作者 = '纸飞机、爱敏'
    时间 = '2020/7/4'
    备注 = '待测试'
角色列表.append(职业信息())

from Part.幽影夜神 import *
class 职业信息():
    显示名称 = '幽影夜神'
    类名 = '幽影夜神'
    类名2 = '无'
    序号 = 64
    作者 = '纸飞机、爱敏'
    时间 = '2020/7/4'
    备注 = '待测试'
角色列表.append(职业信息())

from Part.黑暗武士 import *
class 职业信息():
    显示名称 = '黑暗武士'
    类名 = '黑暗武士'
    类名2 = '无'
    序号 = 72
    作者 = '亚索'
    时间 = '2020/7/4'
    备注 = '实验性功能'
角色列表.append(职业信息())

from Part.缔造者 import *
class 职业信息():
    显示名称 = '缔造者'
    类名 = '缔造者'
    类名2 = '无'
    序号 = 71
    作者 = '时雨、纸飞机'
    时间 = '2020/7/4'
    备注 = '待测试'
角色列表.append(职业信息())

from Part.月蚀 import *
from Part.真·召唤师 import *
class 职业信息():
    显示名称 = '月蚀'
    类名 = '月蚀'
    类名2 = '真·召唤师'
    序号 = 37
    作者 = '荔枝贝壳'
    时间 = '2020/7/4'
    备注 = ''
角色列表.append(职业信息())

from Part.不灭战神 import *
class 职业信息():
    显示名称 = '不灭战神'
    类名 = '不灭战神'
    类名2 = '无'
    序号 = 61
    作者 = '球'
    时间 = '2020/7/4'
    备注 = '待测试'
角色列表.append(职业信息())

from Part.炎狱裁决者 import *
from Part.神启·异端审判者 import *
class 职业信息():
    显示名称 = '炎狱裁决者'
    类名 = '炎狱裁决者'
    类名2 = '神启·异端审判者'
    序号 = 47
    作者 = '熬夜砍树、乐于驴'
    时间 = '2020/7/6'
    备注 = '数据有待修正'
角色列表.append(职业信息())

from Part.归元·柔道家·女 import *
class 职业信息():
    显示名称 = '归元·柔道家'
    类名 = '归元·柔道家·女'
    类名2 = '无'
    序号 = 19
    作者 = '绝唱唱'
    时间 = '2020/7/9'
    备注 = '待测试'
角色列表.append(职业信息())

from Part.月影星劫 import *
class 职业信息():
    显示名称 = '月影星劫'
    类名 = '月影星劫'
    类名2 = '无'
    序号 = 51
    作者 = '卡通、轩轩、纸飞机'
    时间 = '2020/7/11'
    备注 = ''
角色列表.append(职业信息())

from Part.血狱君主 import *
class 职业信息():
    显示名称 = '血狱君主'
    类名 = '血狱君主'
    类名2 = '无'
    序号 = 33
    作者 = '莫方、阿武（高锰酸钾）'
    时间 = '2020/7/11'
    备注 = ''
角色列表.append(职业信息())

#不存在的空位
for i in [10,15,20,25,30,45,50,55,60,65,70,73,74,75]:
    class 职业信息():
        显示名称 = ''
        类名 = '空'
        类名2 = '无'
        序号 = i
        作者 = ''
        时间 = ''
        备注 = ''
    角色列表.append(职业信息())

完成职业 = []
角色序号 = {}
count = 0
for i in 角色列表:
    完成职业.append(i.序号)
    角色序号[i.序号] = count
    count += 1
