from PublicReference.base import *

class 伊斯塔战灵主动技能(主动技能):
    def 等效CD(self, 武器类型):
        if 武器类型 == '矛':
            return round(self.CD / self.恢复 * 1.05, 1)
        if 武器类型 == '棍棒':
            return round(self.CD / self.恢复 * 0.95, 1)

class 伊斯塔战灵技能0(被动技能):
    名称 = '尼巫的战斗术'
    所在等级=15
    等级上限=11
    基础等级=1
    def 加成倍率(self, 武器类型):
        if self.等级==0:
            return 1.0
        else:
            return round(1.18+0.02*self.等级,3)

class 伊斯塔战灵技能1(被动技能):
    名称 = '炫纹'
    所在等级=15
    等级上限=60
    基础等级=46  
    def 加成倍率(self, 武器类型):
        if self.等级==0:
            return 1.0
        else:
            return round(1.20+0.00*self.等级,3)
    
class 伊斯塔战灵技能2(被动技能):
    名称='矛精通'
    所在等级=20
    等级上限=30
    基础等级=20  
    def 加成倍率(self, 武器类型):
        if self.等级==0 or 武器类型 != '矛':
            return 1.0  
        if self.等级<=20:
            return round(1.00+0.01*self.等级,3) 
        if self.等级>20:
            return round(0.80+0.02*self.等级,3)

    def 物理攻击力倍率(self, 武器类型):
        return self.加成倍率(武器类型)

    def 魔法攻击力倍率(self, 武器类型):
        return self.加成倍率(武器类型)

class 伊斯塔战灵技能3(被动技能):
    名称='棍棒精通'
    所在等级=20
    等级上限=30
    基础等级=20  
    def 加成倍率(self, 武器类型):
        if self.等级==0 or 武器类型 != '棍棒':
            return 1.0  
        if self.等级<=20:
            return round(1.00+0.01*self.等级,3) 
        if self.等级>20:
            return round(0.80+0.02*self.等级,3)

    def 物理攻击力倍率(self, 武器类型):
        return self.加成倍率(武器类型)

    def 魔法攻击力倍率(self, 武器类型):
        return self.加成倍率(武器类型)
    
class 伊斯塔战灵技能4(伊斯塔战灵主动技能):
    名称 = '炫纹发射'
    备注 = '(个数,TP为强化炫纹)'
    所在等级=15
    等级上限=60
    基础等级=46
    基础=326.00
    成长=37.00
    CD=0.25
    TP成长=0.10
    TP上限 = 1
    
class 伊斯塔战灵技能5(伊斯塔战灵主动技能):
    名称='碎霸'
    所在等级=30
    等级上限=60
    基础等级=38
    基础=3637.4186
    成长=419.5813
    CD=8
    基础释放次数=0
    TP成长=0.10
    TP上限 = 5
    额外倍率 = 0
    触发概率 = 0
    def 等效百分比(self, 武器类型):
        return (1 + self.额外倍率 * self.触发概率) * super().等效百分比(武器类型)
    
    
    
class 伊斯塔战灵技能6(伊斯塔战灵主动技能):
    名称='流星闪影击'
    所在等级=35
    等级上限=60
    基础等级=36  
    基础=7762.4285
    成长=876.5714
    CD=20
    TP成长=0.10
    TP上限 = 5
   
class 伊斯塔战灵技能7(伊斯塔战灵主动技能):
    名称='炫纹强压'
    所在等级=35
    等级上限=60
    基础等级=36  
    基础=8777
    成长=991
    CD=25
    TP成长=0.10
    TP上限 = 5
    是否有护石 = 1
    演出时间 = 1.4
    def 装备护石(self):
        self.倍率*=1.23
        self.CD *= 0.92

class 伊斯塔战灵技能8(伊斯塔战灵主动技能):
    名称='强袭流星打'
    所在等级=40
    等级上限=60
    基础等级=33  
    基础=8884.8461
    成长=1025.1538
    CD=25
    TP成长=0.10
    TP上限 = 5
    是否有护石 = 1
    def 装备护石(self):
        self.倍率*=1.18
        
class 伊斯塔战灵技能9(伊斯塔战灵主动技能):
    名称='煌龙偃月'
    所在等级=45
    等级上限=60
    基础等级=31  
    基础 = 3542.2972
    成长 = 408.7027
    攻击次数 = 1.0
    基础2 = 1181.7837
    成长2 = 136.2162
    攻击次数2 = 7.0
    基础3 = 5056.6216
    成长3 = 584.3783
    攻击次数3 = 1.0
    CD=45
    TP成长=0.10
    TP上限 = 5
    是否有护石 = 1
    演出时间 = 3
    def 装备护石(self):
        self.倍率*=1.24
        
class 伊斯塔战灵技能10(伊斯塔战灵主动技能):
    名称='煌龙乱舞'
    所在等级=45
    等级上限=60
    基础等级=31  
    基础 = 1205.7027
    成长 = 136.2972
    攻击次数 = 5.0
    基础2 = 9052.8918
    成长2 = 1022.1081
    攻击次数2 = 1.0
    CD=45
    TP成长=0.10
    TP上限 = 5
    是否有护石 = 1
    演出时间 = 3
    def 装备护石(self):
        self.倍率*=1.255

class 伊斯塔战灵技能11(被动技能):
    名称='斗神意志'
    所在等级=48
    等级上限=40
    基础等级=20
    def 加成倍率(self, 武器类型):
        if self.等级==0:
            return 1.0
        else:
            return round(1.05+0.02*self.等级,3)

class 伊斯塔战灵技能12(伊斯塔战灵主动技能):
    名称='星纹陨爆'
    所在等级=50
    等级上限=40
    基础等级=12  
    基础=40144.7058
    成长=12119.2941
    CD=145.0
    演出时间 = 2

class 伊斯塔战灵技能13(伊斯塔战灵主动技能):
    名称 = '变身贝亚娜'
    备注 = '(一轮)'
    所在等级=50
    等级上限=1
    基础等级=1  
    基础 = 294.9333
    成长 = 90.0667
    攻击次数 = 4.0
    基础2 = 735.6
    成长2 = 225.4
    攻击次数2 = 1.0
    CD=1

class 伊斯塔战灵技能14(伊斯塔战灵主动技能):
    名称='变身贝亚娜苍天击'
    所在等级=50
    等级上限=1
    基础等级=1  
    基础=1107.4
    成长=338.6
    CD=1   

class 伊斯塔战灵技能15(伊斯塔战灵主动技能):
    名称='变身贝亚娜天地碎霸'
    所在等级=50
    等级上限=1
    基础等级=1 
    基础 = 509.5333
    成长 = 187.4667
    攻击次数 = 1.0
    基础2 = 2245.2667
    成长2 = 806.7333
    攻击次数2 = 1.0
    CD=7

class 伊斯塔战灵技能16(伊斯塔战灵主动技能):
    名称='闪击碎霸'
    所在等级=60
    等级上限=40
    基础等级=23  
    基础=14049.625
    成长=1586.375
    CD=30
    TP成长=0.10
    TP上限 = 5
    是否有护石 = 1
    演出时间 = 0.9
    def 装备护石(self):
        self.倍率*=1.15
        self.CD *=0.90

class 伊斯塔战灵技能17(伊斯塔战灵主动技能):
    名称='流星雷连击'
    所在等级=70
    等级上限=40
    基础等级=18  
    基础=23187.8889
    成长=2616.1111
    CD=50
    TP成长=0.10
    TP上限 = 5
    是否有护石 = 1
    def 装备护石(self):
        self.倍率*=1.10
       

class 伊斯塔战灵技能18(被动技能):
    名称='战灵潜能'
    所在等级=75
    等级上限=40
    基础等级=11
    def 加成倍率(self, 武器类型):
        if self.等级==0:
            return 1.0
        else:
            return round(1.22+0.02*self.等级,3)

class 伊斯塔战灵技能19(伊斯塔战灵主动技能):
    名称='炫纹簇'
    所在等级=75
    等级上限=40
    基础等级=16
    基础 = 4935.8125
    成长 = 557.1875
    攻击次数 = 7.0
    CD=45
    演出时间 = 1.3
            
class 伊斯塔战灵技能20(伊斯塔战灵主动技能):
    名称='使徒之舞'
    所在等级=80
    等级上限=40
    基础等级=13  
    基础 = 1449.333
    成长 = 163.6923
    攻击次数 = 3.0
    基础2 = 2900.769
    成长2 = 327.2307
    攻击次数2 = 1.0
    基础3 = 29006.3076
    成长3 = 3272.6923
    攻击次数3 = 1.0
    CD=40

class 伊斯塔战灵技能21(伊斯塔战灵主动技能):
    名称='使徒化身'
    所在等级=85
    等级上限=40
    基础等级=5  
    基础 = 39871.1428
    成长 = 12035.8571
    攻击次数 = 1.0
    基础2 = 26580.1428
    成长2 = 8023.8571
    攻击次数2 = 1.0
    CD=180
    
class 伊斯塔战灵技能22(被动技能):
    名称 = '卓越之力'
    所在等级 = 95
    等级上限 = 40
    基础等级 = 4

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.18 + 0.02 * self.等级, 5)

class 伊斯塔战灵技能23(被动技能):
    名称 = '超卓之心'
    所在等级 = 95
    等级上限 = 11
    基础等级 = 1

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.045 + 0.005 * self.等级, 5)

class 伊斯塔战灵技能24(被动技能):
    名称 = '觉醒之抉择'
    所在等级 = 100
    等级上限 = 40
    基础等级 = 2
    关联技能 = ['无']

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.10 + 0.05 * self.等级, 5)

class 伊斯塔战灵技能25(伊斯塔战灵主动技能):
    名称='基本攻击'
    备注 = '(一轮,TP为基础精通)'
    所在等级=1
    等级上限=1
    基础等级=1  
    基础 = 225.2*2.662
    基础2 = 1.16 * 225.2*2.662
    基础3 = 1.8 * 225.2*2.662
    CD=1
    TP成长=0.10
    TP上限 = 3

class 伊斯塔战灵技能26(被动技能):
    名称 = '基础精通'
    倍率 = 1.0
    所在等级 = 1
    等级上限 = 200
    基础等级 = 100
    关联技能 = ['基本攻击']
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(self.倍率 * (0.463 + 0.089 * self.等级), 5)

伊斯塔战灵技能列表 = []
i = 0
while i >= 0:
    try:
        exec('伊斯塔战灵技能列表.append(伊斯塔战灵技能'+str(i)+'())')
        i += 1
    except:
        i = -1

伊斯塔战灵技能序号 = dict()
for i in range(len(伊斯塔战灵技能列表)):
    伊斯塔战灵技能序号[伊斯塔战灵技能列表[i].名称] = i

伊斯塔战灵一觉序号 = 12
伊斯塔战灵二觉序号 = 0
伊斯塔战灵三觉序号 = 0
for i in 伊斯塔战灵技能列表:
    if i.所在等级 == 85:
        伊斯塔战灵二觉序号 = 伊斯塔战灵技能序号[i.名称]
    if i.所在等级 == 100:
        伊斯塔战灵三觉序号 = 伊斯塔战灵技能序号[i.名称]

伊斯塔战灵护石选项 = ['无']
for i in 伊斯塔战灵技能列表:
    if i.是否有伤害 == 1 and i.是否有护石 == 1:
        伊斯塔战灵护石选项.append(i.名称)

伊斯塔战灵符文选项 = ['无']
for i in 伊斯塔战灵技能列表:
    if i.所在等级 >= 20 and i.所在等级 <= 80 and i.所在等级 != 50 and i.是否有伤害 == 1:
        伊斯塔战灵符文选项.append(i.名称)

class 伊斯塔战灵角色属性(角色属性):

    实际名称 = '伊斯塔战灵'
    角色 = '魔法师(女)'
    职业 = '战斗法师'

    武器选项 = ['矛', '棍棒']
    
    伤害类型选择 = ['物理百分比', '魔法百分比']
    
    伤害类型 = '物理百分比'
    防具类型 = '皮甲'
    防具精通属性 = ['力量', '智力']

    主BUFF = 1.790

    远古记忆 = 0
    
        
  
    def __init__(self):
        基础属性输入(self)
        self.技能栏= deepcopy(伊斯塔战灵技能列表)
        self.技能序号= deepcopy(伊斯塔战灵技能序号)

    def 被动倍率计算(self):
        if self.武器类型 == '矛':
            self.技能栏[self.技能序号['棍棒精通']].关联技能 = ['无']
        elif self.武器类型 == '棍棒':
            self.技能栏[self.技能序号['矛精通']].关联技能 = ['无']
        for i in [13, 14, 15]:
            self.技能栏[i].等级 = self.技能栏[12].等级
        super().被动倍率计算()

    def 站街力量(self):
        return int(max(self.力量,self.智力))

    def 站街智力(self):
        return self.站街力量()

    def 面板力量(self):
        return max(super().面板力量(), super().面板智力())
      
    def 面板智力(self):
        return self.面板力量()
    
    def 装备基础(self):
        self.防具基础()
  
        for i in [9,10]:
            temp = 装备列表[装备序号[self.装备栏[i]]]
            if temp.所属套装 != '智慧产物':
                x = 左右计算(temp.等级,temp.品质,self.强化等级[i])
                self.力量 += x
                self.智力 += x

        for i in range(0,12):
            temp = 装备列表[装备序号[self.装备栏[i]]]
            if self.是否增幅[i] and temp.所属套装 != '智慧产物':
                x = 增幅计算(temp.等级,temp.品质,self.强化等级[i])
                if '物理' in self.伤害类型 or '力量' in self.伤害类型:
                    self.力量 += x
                else:
                    self.智力 += x
        
        temp = 装备列表[装备序号[self.装备栏[11]]]
        if temp.所属套装 != '智慧产物':
            self.物理攻击力 += 武器计算(temp.等级,temp.品质,self.强化等级[11],self.武器类型,'魔法')
            self.魔法攻击力 += 武器计算(temp.等级,temp.品质,self.强化等级[11],self.武器类型,'魔法')
            self.独立攻击力 += 锻造计算(temp.等级,temp.品质,self.武器锻造等级)
        
        temp = 装备列表[装备序号[self.装备栏[8]]]
        if temp.所属套装 != '智慧产物':
            x = 耳环计算(temp.等级,temp.品质,self.强化等级[8])
            self.物理攻击力 += x
            self.魔法攻击力 += x
            self.独立攻击力 += x

        for i in [5,6,7,8,9,10]:
            temp = 装备列表[装备序号[self.装备栏[i]]]
            self.力量 += temp.力量
            self.智力 += temp.智力
            self.物理攻击力 += temp.物理攻击力
            self.魔法攻击力 += temp.魔法攻击力
            self.独立攻击力 += temp.独立攻击力

        temp = 装备列表[装备序号[self.装备栏[11]]]
        self.力量 += temp.力量
        self.智力 += temp.智力
        self.物理攻击力 += temp.物理攻击力
        self.魔法攻击力 += temp.物理攻击力
        self.独立攻击力 += temp.独立攻击力

class 伊斯塔战灵(角色窗口):
    def 窗口属性输入(self):
        self.初始属性 = 伊斯塔战灵角色属性()
        self.角色属性A = 伊斯塔战灵角色属性()
        self.角色属性B = 伊斯塔战灵角色属性()
        self.一觉序号 = 伊斯塔战灵一觉序号
        self.二觉序号 = 伊斯塔战灵二觉序号
        self.三觉序号 = 伊斯塔战灵三觉序号
        self.护石选项 = deepcopy(伊斯塔战灵护石选项)
        self.符文选项 = deepcopy(伊斯塔战灵符文选项)

    def 界面(self):
        super().界面()
        self.碎霸概率=MyQComboBox(self.main_frame2)
        self.碎霸概率.resize(130,20)
        self.碎霸概率.move(320,450)
        for i in range(11):
            self.碎霸概率.addItem('歼灵灭魂矛：' + str(i * 10) + '%')
        self.碎霸概率.setCurrentIndex(1)

    def 输入属性(self, 属性, x = 0):
        super().输入属性(属性, x)
        属性.技能栏[属性.技能序号['碎霸']].触发概率 = round(self.碎霸概率.currentIndex() / 10, 2)
        if 属性.护石第一栏 == "闪击碎霸" or 属性.护石第二栏 == "闪击碎霸" or 属性.护石第三栏 == "闪击碎霸":
            属性.技能栏[属性.技能序号['碎霸']].基础释放次数 += 1