from PublicReference.base import *

class 圣武枪魂技能0(被动技能):	
    名称 = '长枪精通'	
    所在等级 = 15	
    等级上限 = 30	
    基础等级 = 20
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        elif self.等级 <= 20:
            return round(1 + 0.01 * self.等级, 5)
        else:
            return round(0.8 + 0.02 * self.等级, 5)

    def 物理攻击力倍率(self, 武器类型):
        return self.加成倍率(武器类型)	

class 圣武枪魂技能1(主动技能):	
    名称 = '双重刺击'	
    所在等级 = 20	
    等级上限 = 60	
    基础等级 = 43	
    基础 = 3694.57142857143	
    成长 = 417.428571428571	
    CD = 6.4	
    TP成长 = 0.1	
    TP上限 = 5

class 圣武枪魂技能2(主动技能):	
    名称 = '行云：风'	
    所在等级 = 15	
    等级上限 = 60	
    基础等级 = 46	
    基础 = 2094.93333333333	
    成长 = 236.066666666667	
    CD = 4.6	
    TP成长 = 0.1	
    TP上限 = 5

class 圣武枪魂技能3(主动技能):	
    名称 = '行云：疾'	
    所在等级 = 20	
    等级上限 = 60	
    基础等级 = 43	
    基础 = 2634.38095238095	
    成长 = 297.619047619048	
    CD = 5.5	
    TP成长 = 0.1	
    TP上限 = 5

class 圣武枪魂技能4(主动技能):	
    名称 = '行云：落'	
    所在等级 = 25	
    等级上限 = 60	
    基础等级 = 41	
    基础 = 3784.675
    成长 = 427.325
    CD = 7.3	
    TP成长 = 0.1	
    TP上限 = 5

class 圣武枪魂技能5(被动技能):	
    名称 = '行云：沐'	
    所在等级 = 25	
    等级上限 = 20	
    基础等级 = 10	
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        elif self.等级 <= 10:
            return round(1.05 + 0.01 * self.等级, 5)
        else:
            return round(0.95 + 0.02 * self.等级, 5)

class 圣武枪魂技能6(主动技能):	
    名称 = '旋风枪'	
    所在等级 = 25	
    等级上限 = 60	
    基础等级 = 41	
    基础 = 4467.65	
    成长 = 504.35	
    CD = 8.2	
    TP成长 = 0.1	
    TP上限 = 5

class 圣武枪魂技能7(主动技能):	
    名称 = '无畏波动枪'	
    所在等级 = 30	
    等级上限 = 60	
    基础等级 = 38	
    基础 = 5259.13513513513	
    成长 = 593.864864864865	
    CD = 8.2	
    TP成长 = 0.1	
    TP上限 = 5

class 圣武枪魂技能8(主动技能):	
    名称 = '升龙破空枪'	
    所在等级 = 35	
    等级上限 = 60	
    基础等级 = 36	
    基础 = 8384.54285714286	
    成长 = 1091.45714285714	
    CD = 16	
    TP成长 = 0.1	
    TP上限 = 5
    是否有护石 = 1
    def 装备护石(self):
        self.倍率 *= 1.10
        self.CD *= 0.88

class 圣武枪魂技能9(主动技能):	
    名称 = '狂龙怒啸'	
    所在等级 = 40	
    等级上限 = 60	
    基础等级 = 33	
    基础 = 8556.5625	
    成长 = 968.4375
    CD = 18.3	
    TP成长 = 0.1	
    TP上限 = 5
    是否有护石 = 1
    def 装备护石(self):
        self.倍率 *= 1.1
        self.CD *= 0.76

class 圣武枪魂技能10(主动技能):	
    名称 = '夺命雷霆枪'	
    所在等级 = 45	
    等级上限 = 60	
    基础等级 = 31	
    基础 = 21869.8666666667	
    成长 = 2472.13333333333	
    CD = 42.9	
    TP成长 = 0.1	
    TP上限 = 5
    是否有护石 = 1
    def 装备护石(self):
        self.倍率 *= 1.24767

class 圣武枪魂技能11(被动技能):	
    名称 = '行云：启'	
    所在等级 = 48	
    等级上限 = 40	
    基础等级 = 20	
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.06 + 0.015 * self.等级, 5)

class 圣武枪魂技能12(主动技能):	
    名称 = '流云幻灭'	
    所在等级 = 50	
    等级上限 = 40	
    基础等级 = 12	
    基础 = 43306.1
    成长 = 13091
    CD = 152.3

class 圣武枪魂技能13(主动技能):	
    名称 = '风火燎原'	
    所在等级 = 60	
    等级上限 = 40	
    基础等级 = 23	
    基础 = 21959.0909090909	
    成长 = 2480.90909090909	
    CD = 29.2	
    TP成长 = 0.1	
    TP上限 = 5
    是否有护石 = 1
    def 装备护石(self):
        self.倍率 *= 1.275

class 圣武枪魂技能14(主动技能):	
    名称 = '三一斩月'	
    所在等级 = 70	
    等级上限 = 40	
    基础等级 = 18	
    基础 = 28510.88235	
    成长 = 3220.117647
    CD = 47.5	
    TP成长 = 0.1	
    TP上限 = 5
    是否有护石 = 1
    def 装备护石(self):
        self.倍率 *= 1.23

class 圣武枪魂技能15(主动技能):	
    名称 = '无双突刺'	
    所在等级 = 75	
    等级上限 = 40	
    基础等级 = 16	
    基础 = 46982.8	
    成长 = 5305.2	
    CD = 30.1

class 圣武枪魂技能16(被动技能):	
    名称 = '行云：冥'	
    所在等级 = 75	
    等级上限 = 40	
    基础等级 = 11
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.16 + 0.02 * self.等级, 5)	

class 圣武枪魂技能17(主动技能):	
    名称 = '流光无影闪'	
    所在等级 = 80	
    等级上限 = 40	
    基础等级 = 13	
    基础 = 52609.8333333333	
    成长 = 5940.16666666667	
    CD = 40.2

class 圣武枪魂技能18(主动技能):	
    名称 = '极影无形杀'	
    所在等级 = 85	
    等级上限 = 40	
    基础等级 = 5	
    基础 = 107737	
    成长 = 32553	
    CD = 189

class 圣武枪魂技能19(被动技能):
    名称 = '卓越之力'
    所在等级 = 95
    等级上限 = 40
    基础等级 = 4

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.18 + 0.02 * self.等级, 5)

class 圣武枪魂技能20(被动技能):
    名称 = '超卓之心'
    所在等级 = 95
    等级上限 = 11
    基础等级 = 1

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.045 + 0.005 * self.等级, 5)

class 圣武枪魂技能21(被动技能):
    名称 = '觉醒之抉择'
    所在等级 = 100
    等级上限 = 40
    基础等级 = 2
    关联技能 = ['无']

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.10 + 0.05 * self.等级, 5)

圣武枪魂技能列表 = []
i = 0
while i >= 0:
    try:
        exec('圣武枪魂技能列表.append(圣武枪魂技能' + str(i) + '())')
        i += 1
    except:
        i = -1

圣武枪魂技能序号 = dict()
for i in range(len(圣武枪魂技能列表)):
    圣武枪魂技能序号[圣武枪魂技能列表[i].名称] = i

圣武枪魂一觉序号 = 0
圣武枪魂二觉序号 = 0
圣武枪魂三觉序号 = 0
for i in 圣武枪魂技能列表:
    if i.所在等级 == 50:
        圣武枪魂一觉序号 = 圣武枪魂技能序号[i.名称]
    if i.所在等级 == 85:
        圣武枪魂二觉序号 = 圣武枪魂技能序号[i.名称]
    if i.所在等级 == 100:
        圣武枪魂三觉序号 = 圣武枪魂技能序号[i.名称]

圣武枪魂护石选项 = ['无']
for i in 圣武枪魂技能列表:
    if i.是否有伤害 == 1 and i.是否有护石 == 1:
        圣武枪魂护石选项.append(i.名称)

圣武枪魂符文选项 = ['无']
for i in 圣武枪魂技能列表:
    if i.所在等级 >= 20 and i.所在等级 <= 80 and i.所在等级 != 50 and i.是否有伤害 == 1:
        圣武枪魂符文选项.append(i.名称)


class 圣武枪魂角色属性(角色属性):
    实际名称 = '圣武枪魂'
    角色 = '魔枪士'
    职业 = '决战者'

    武器选项 = ['长枪']

    伤害类型选择 = ['物理百分比']

    伤害类型 = '物理百分比'
    防具类型 = '轻甲'
    防具精通属性 = ['力量']

    主BUFF = 2.0

    def __init__(self):
        基础属性输入(self)
        self.技能栏 = deepcopy(圣武枪魂技能列表)
        self.技能序号 = deepcopy(圣武枪魂技能序号)

    def 被动倍率计算(self):
        super().被动倍率计算()

        x = self.技能栏[11].加成倍率(self.武器类型)
        self.技能栏[2].被动倍率 *= (0.025 + x) / x
        self.技能栏[3].被动倍率 *= (0.020 + x) / x
        self.技能栏[4].被动倍率 *= (0.015 + x) / x

        y = self.技能栏[16].加成倍率(self.武器类型)
        for i in [1, 2, 3, 4]:
            self.技能栏[i].被动倍率 *= (0.01 + y) / y
        
class 圣武枪魂(角色窗口):
    def 窗口属性输入(self):
        self.初始属性 = 圣武枪魂角色属性()
        self.角色属性A = 圣武枪魂角色属性()
        self.角色属性B = 圣武枪魂角色属性()
        self.一觉序号 = 圣武枪魂一觉序号
        self.二觉序号 = 圣武枪魂二觉序号
        self.三觉序号 = 圣武枪魂三觉序号
        self.护石选项 = deepcopy(圣武枪魂护石选项)
        self.符文选项 = deepcopy(圣武枪魂符文选项)

