from PublicReference.base import *


class 幽影夜神技能0(被动技能):	
    名称 = '暗蚀'	
    所在等级 = 15	
    等级上限 = 20	
    基础等级 = 10	
    关联技能 = ['无']
    def 属强加成(self):
        if self.等级 == 0:
            return 0
        else:
            return round(self.等级 * 4 + 30)

class 幽影夜神技能1(主动技能):	
    名称 = '侵蚀之矛'	
    所在等级 = 15	
    等级上限 = 60	
    基础等级 = 46	
    基础 = 1607.71111111111	
    成长 = 181.644444444444	
    CD = 5	
    TP成长 = 0.1	
    TP上限 = 5

class 幽影夜神技能2(主动技能):	
    名称 = '双重投射'	
    所在等级 = 15	
    等级上限 = 60	
    基础等级 = 46	
    基础 = 1633.33333333333	
    成长 = 184.666666666667
    被动倍率 = 1.2	
    CD = 6	
    TP成长 = 0.1	
    TP上限 = 5

class 幽影夜神技能3(被动技能):	
    名称 = '暗矛精通'	
    所在等级 = 20	
    等级上限 = 30	
    基础等级 = 20
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        elif self.等级 <= 20:
            return round(1 + 0.01 * self.等级, 5)
        else:
            return round(0.8 + 0.02 * self.等级, 5)

    def 魔法攻击力倍率(self, 武器类型):
        return self.加成倍率(武器类型)	

class 幽影夜神技能4(主动技能):	
    名称 = '暗矛投射'	
    所在等级 = 20	
    等级上限 = 60	
    基础等级 = 	43
    基础 = 2059.2380952381	
    成长 = 232.380952380952
    被动倍率 = 1.2	
    CD = 7	
    TP成长 = 0.1	
    TP上限 = 5

class 幽影夜神技能5(主动技能):	
    名称 = '黑暗枪雨'	
    所在等级 = 25	
    等级上限 = 60	
    基础等级 = 41	
    基础 = 4060.68292682927	
    成长 = 459.317073170732	
    CD = 12	
    TP成长 = 0.1	
    TP上限 = 5

class 幽影夜神技能6(主动技能):	
    名称 = '暗矛贯穿'	
    所在等级 = 25	
    等级上限 = 60	
    基础等级 = 41	
    基础 = 2380.175	
    成长 = 268.825
    被动倍率 = 1.2	
    CD = 8	
    TP成长 = 0.1	
    TP上限 = 5

class 幽影夜神技能7(被动技能):	
    名称 = '暗枪突破'	
    所在等级 = 30	
    等级上限 = 11	
    基础等级 = 1
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.09 + 0.01 * self.等级, 5)

class 幽影夜神技能8(主动技能):	
    名称 = '黑暗葬礼'	
    所在等级 = 30	
    等级上限 = 60	
    基础等级 = 38	
    基础 = 3477.21621621622	
    成长 = 392.783783783784
    被动倍率 = 1.116465014	
    CD = 10	
    TP成长 = 0.1	
    TP上限 = 5

class 幽影夜神技能9(主动技能):	
    名称 = '绝望枪'	
    所在等级 = 30	
    等级上限 = 60	
    基础等级 = 38	
    基础 = 3089.43243243243	
    成长 = 348.567567567568
    被动倍率 = 1.2	
    CD = 8	
    TP成长 = 0.1	
    TP上限 = 5

class 幽影夜神技能10(主动技能):	
    名称 = '暗蚀螺旋枪'	
    所在等级 = 35	
    等级上限 = 60	
    基础等级 = 36	
    基础 = 5703.11428571429	
    成长 = 645.885714285714	
    CD = 18	
    TP成长 = 0.1	
    TP上限 = 5
    是否有护石 = 1
    def 装备护石(self):
        self.倍率 *= 1.25

class 幽影夜神技能11(主动技能):	
    名称 = '连锁侵蚀'	
    所在等级 = 35	
    等级上限 = 60	
    基础等级 = 36	
    基础 = 4925.65714285714	
    成长 = 556.342857142857	
    CD = 20	
    TP成长 = 0.1	
    TP上限 = 5

class 幽影夜神技能12(主动技能):	
    名称 = '坠蚀之雨'	
    所在等级 = 40	
    等级上限 = 60	
    基础等级 = 33	
    基础 = 6881.875	
    成长 = 778.125	
    CD = 22	
    TP成长 = 0.1	
    TP上限 = 5
    是否有护石 = 1
    def 装备护石(self):
        self.倍率 *= 1.28


class 幽影夜神技能13(主动技能):	
    名称 = '暗蚀爆雷杀'	
    所在等级 = 45	
    等级上限 = 60	
    基础等级 = 31	
    基础 = 12367.6	
    成长 = 1396.4
    被动倍率 = 1.2	
    CD = 40	
    TP成长 = 0.1	
    TP上限 = 5
    是否有护石 = 1
    def 装备护石(self):
        self.倍率 *= 1.24
        self.CD *= 0.9

class 幽影夜神技能14(被动技能):	
    名称 = '黑暗支配者'	
    所在等级 = 48	
    等级上限 = 40	
    基础等级 = 20
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.105 + 0.015 * self.等级, 5)	

class 幽影夜神技能15(主动技能):	
    名称 = '无尽侵蚀：缚魂'	
    所在等级 = 50	
    等级上限 = 40	
    基础等级 = 12	
    基础 = 32105 	
    成长 = 9745
    被动倍率 = 1.1
    CD = 145

class 幽影夜神技能16(主动技能):	
    名称 = '暗影蚀魂'	
    所在等级 = 60	
    等级上限 = 40	
    基础等级 = 23	
    基础 = 13168.1363636364	
    成长 = 1486.86363636364	
    CD = 30	
    TP成长 = 0.1	
    TP上限 = 5
    是否有护石 = 1
    def 装备护石(self):
        self.倍率 *= 1.27

class 幽影夜神技能17(主动技能):	
    名称 = '黑蚀酷刑'	
    所在等级 = 70	
    等级上限 = 40	
    基础等级 = 18	
    基础 = 20123.2941176471	
    成长 = 2272.70588235294
    被动倍率 = 1.2	
    CD = 45	
    TP成长 = 0.1	
    TP上限 = 5
    是否有护石 = 1
    def 装备护石(self):
        self.倍率 *= 1.186843623
        self.CD *= 0.9

class 幽影夜神技能18(被动技能):	
    名称 = '黑暗本源'	
    所在等级 = 75	
    等级上限 = 40	
    基础等级 = 11	
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.22 + 0.02 * self.等级, 5)	

class 幽影夜神技能19(主动技能):	
    名称 = '冥夜裂空'	
    所在等级 = 75	
    等级上限 = 40	
    基础等级 = 16	
    基础 = 32649.3333333333	
    成长 = 3690.66666666667	
    被动倍率 = 1.2
    CD = 40

class 幽影夜神技能20(主动技能):	
    名称 = '冥蚀脉冲'	
    所在等级 = 80	
    等级上限 = 40	
    基础等级 = 13	
    基础 = 37386.1666666667
    成长 = 4222.83333333333
    被动倍率 = 1.2	
    CD = 45

class 幽影夜神技能21(主动技能):	
    名称 = '幽影暗蚀：寂灭'	
    所在等级 = 85	
    等级上限 = 40	
    基础等级 = 5	
    基础 = 65823.8674698795	
    成长 = 19946.6265060241	
    被动倍率 = 1.186269717
    CD = 180

class 幽影夜神技能22(被动技能):
    名称 = '卓越之力'
    所在等级 = 95
    等级上限 = 40
    基础等级 = 4

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.18 + 0.02 * self.等级, 5)

class 幽影夜神技能23(被动技能):
    名称 = '超卓之心'
    所在等级 = 95
    等级上限 = 11
    基础等级 = 1

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.045 + 0.005 * self.等级, 5)

class 幽影夜神技能24(被动技能):
    名称 = '觉醒之抉择'
    所在等级 = 100
    等级上限 = 40
    基础等级 = 2
    关联技能 = ['无']

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.10 + 0.05 * self.等级, 5)

幽影夜神技能列表 = []
i = 0
while i >= 0:
    try:
        exec('幽影夜神技能列表.append(幽影夜神技能' + str(i) + '())')
        i += 1
    except:
        i = -1

幽影夜神技能序号 = dict()
for i in range(len(幽影夜神技能列表)):
    幽影夜神技能序号[幽影夜神技能列表[i].名称] = i

幽影夜神一觉序号 = 0
幽影夜神二觉序号 = 0
幽影夜神三觉序号 = 0
for i in 幽影夜神技能列表:
    if i.所在等级 == 50:
        幽影夜神一觉序号 = 幽影夜神技能序号[i.名称]
    if i.所在等级 == 85:
        幽影夜神二觉序号 = 幽影夜神技能序号[i.名称]
    if i.所在等级 == 100:
        幽影夜神三觉序号 = 幽影夜神技能序号[i.名称]

幽影夜神护石选项 = ['无']
for i in 幽影夜神技能列表:
    if i.是否有伤害 == 1 and i.是否有护石 == 1:
        幽影夜神护石选项.append(i.名称)

幽影夜神符文选项 = ['无']
for i in 幽影夜神技能列表:
    if i.所在等级 >= 20 and i.所在等级 <= 80 and i.所在等级 != 50 and i.是否有伤害 == 1:
        幽影夜神符文选项.append(i.名称)


class 幽影夜神角色属性(角色属性):
    实际名称 = '幽影夜神'
    角色 = '魔枪士'
    职业 = '暗枪士'

    武器选项 = ['暗矛']

    伤害类型选择 = ['魔法百分比']

    伤害类型 = '魔法百分比'
    防具类型 = '皮甲'
    防具精通属性 = ['智力']

    主BUFF = 1.93

    远古记忆 = 0

    def __init__(self):
        基础属性输入(self)
        self.技能栏 = deepcopy(幽影夜神技能列表)
        self.技能序号 = deepcopy(幽影夜神技能序号)

    def 被动倍率计算(self):
        self.暗属性强化 += self.技能栏[0].属强加成()
        super().被动倍率计算()

class 幽影夜神(角色窗口):
    def 窗口属性输入(self):
        self.初始属性 = 幽影夜神角色属性()
        self.角色属性A = 幽影夜神角色属性()
        self.角色属性B = 幽影夜神角色属性()
        self.一觉序号 = 幽影夜神一觉序号
        self.二觉序号 = 幽影夜神二觉序号
        self.三觉序号 = 幽影夜神三觉序号
        self.护石选项 = deepcopy(幽影夜神护石选项)
        self.符文选项 = deepcopy(幽影夜神符文选项)