from PublicReference.base import *


class 影舞者技能0(主动技能):
    名称 = '天诛'
    所在等级 = 10
    等级上限 = 60
    基础等级 = 48
    基础 = 2430.866667
    成长 = 334.1333333
    CD = 6.3
    TP成长 = 0.08
    TP上限 = 7


class 影舞者技能1(主动技能):
    名称 = '割喉'
    所在等级 = 15
    等级上限 = 60
    基础等级 = 46
    基础 = 2023.311111
    成长 = 228.6888889
    CD = 5.4
    TP成长 = 0.1
    TP上限 = 7


class 影舞者技能2(被动技能):
    名称 = '暗杀教义'
    所在等级 = 15
    等级上限 = 20
    基础等级 = 1

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.185 + 0.015 * self.等级, 5)

class 影舞者技能3(主动技能):
    名称 = '夺魄'
    所在等级 = 20
    等级上限 = 60
    基础等级 = 43
    基础 = 1315.380952
    成长 = 2148.6190476
    CD = 2.7
    TP成长 = 0.1
    TP上限 = 7

class 影舞者技能4(被动技能):
    名称 = '暗杀之匕首精通'
    所在等级 = 20
    等级上限 = 30
    基础等级 = 20

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            if self.等级 <= 20:
                return round(1.0 + 0.015 * self.等级, 5)
            else:
                return round(1.3 + 0.025 * (self.等级 - 20), 5)


    def 物理攻击力倍率(self, 武器类型):
        return self.加成倍率(武器类型)

class 影舞者技能5(主动技能):
    名称 = '穿心'
    所在等级 = 25
    等级上限 = 60
    基础等级 = 41
    基础 = 3349.4
    成长 = 378.6
    CD = 7.2
    TP成长 = 0.10
    TP上限 = 7


class 影舞者技能6(主动技能):
    名称 = '追命'
    所在等级 = 30
    等级上限 = 60
    基础等级 = 38
    基础 = 2739.397297
    成长 = 508.2527027
    CD = 9.0
    TP成长 = 0.10
    TP上限 = 7


class 影舞者技能7(主动技能):
    名称 = '潜影刺击'
    所在等级 = 35
    等级上限 = 60
    基础等级 = 36
    基础 = 6052.2
    成长 = 683.8
    CD = 13.5
    TP成长 = 0.10
    TP上限 = 7


class 影舞者技能8(主动技能):
    名称 = '刃舞（打满）'
    所在等级 = 35
    等级上限 = 60
    基础等级 = 36
    基础 = 7477.971429
    成长 = 849.0285714
    CD = 13.5
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1

    def 装备护石(self):
        self.倍率 *= 1.286893239

class 影舞者技能9(主动技能):
    名称 = '刃舞（2hit+终结）'
    所在等级 = 35
    等级上限 = 60
    基础等级 = 36
    基础 = 4074.542857
    成长 = 460.4571429
    CD = 13.5
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1

    def 装备护石(self):
        self.倍率 *= 1.058531422

class 影舞者技能10(主动技能):
    名称 = '影戮'
    所在等级 = 40
    等级上限 = 60
    基础等级 = 33
    基础 = 11149
    成长 = 1259
    CD = 22.5
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1

    def 装备护石(self):
        self.倍率 *= 1.275230496

class 影舞者技能11(主动技能):
    名称 = '瞬杀'
    所在等级 = 45
    等级上限 = 601
    基础等级 = 31
    基础 = 18086.6
    成长 = 2042.4
    CD = 40.5
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1

    def 装备护石(self):
        self.倍率 *= 1.2

class 影舞者技能12(被动技能):
    名称 = '暗杀之心'
    所在等级 = 48
    等级上限 = 40
    基础等级 = 20

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            if self.等级 <= 20:
                return round(1.03 + 0.02 * self.等级, 5)
            else:
                return round(1.43 + 0.021 * (self.等级 - 20), 5)

class 影舞者技能13(主动技能):
    名称 = '影斩·乱舞'
    所在等级 = 50
    等级上限 = 40
    基础等级 = 12
    基础 = 35190.8
    成长 = 10618.6
    CD = 130.5


class 影舞者技能14(主动技能):
    名称 = '绝命飞刀'
    所在等级 = 60
    等级上限 = 40
    基础等级 = 23
    基础 = 13692.45455
    成长 = 1545.545455
    CD = 27.0
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1

    def 装备护石(self):
        self.倍率 *= 1.270762567

class 影舞者技能15(主动技能):
    名称 = '死亡连舞（不可抓取）'
    所在等级 = 70
    等级上限 = 40
    基础等级 = 16
    基础 = 27754
    成长 = 3134
    基础2 = 2342.8
    成长2 = 264.2
    攻击次数2 = 3
    CD = 36.0


class 影舞者技能16(主动技能):
    名称 = '八荒影杀'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 18
    基础 = 26875.58824
    成长 = 3037.411765
    CD = 45.0
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1

    def 装备护石(self):
        self.倍率 *= 1.23

class 影舞者技能17(被动技能):
    名称 = '潜行暗杀'
    所在等级 = 75
    等级上限 = 20
    基础等级 = 11

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.18 + 0.02 * self.等级, 5)

class 影舞者技能18(主动技能):
    名称 = '剜心'
    所在等级 = 80
    等级上限 = 40
    基础等级 = 13
    基础 = 60989.83333
    成长 = 6886.166667
    CD = 40.5

class 影舞者技能19(主动技能):
    名称 = '二觉链子'
    所在等级 = 85
    等级上限 = 40
    基础等级 = 5
    基础 = 12003
    成长 = 1355
    CD = 1


class 影舞者技能20(主动技能):
    名称 = '幽冥链狱：索命（不可抓取）'
    所在等级 = 85
    等级上限 = 40
    基础等级 = 5
    基础 = 72705.66667
    成长 = 21496.66667
    CD = 162


class 影舞者技能21(被动技能):
    名称 = '卓越之力'
    所在等级 = 95
    等级上限 = 40
    基础等级 = 4

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.18 + 0.02 * self.等级, 5)

class 影舞者技能22(被动技能):
    名称 = '超卓之心'
    所在等级 = 95
    等级上限 = 11
    基础等级 = 1

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.045 + 0.005 * self.等级, 5)

class 影舞者技能23(被动技能):
    名称 = '觉醒之抉择'
    所在等级 = 100
    等级上限 = 40
    基础等级 = 2
    关联技能 = ['无']

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.10 + 0.05 * self.等级, 5)


影舞者技能列表 = []
i = 0
while i >= 0:
    try:
        exec('影舞者技能列表.append(影舞者技能' + str(i) + '())')
        i += 1
    except:
        i = -1

影舞者技能序号 = dict()
for i in range(len(影舞者技能列表)):
    影舞者技能序号[影舞者技能列表[i].名称] = i

影舞者一觉序号 = 0
影舞者二觉序号 = 0
影舞者三觉序号 = 0
for i in 影舞者技能列表:
    if i.所在等级 == 50:
        影舞者一觉序号 = 影舞者技能序号[i.名称]
    if i.所在等级 == 85:
        影舞者二觉序号 = 影舞者技能序号[i.名称]
    if i.所在等级 == 100:
        影舞者三觉序号 = 影舞者技能序号[i.名称]

影舞者护石选项 = ['无']
for i in 影舞者技能列表:
    if i.是否有伤害 == 1 and i.是否有护石 == 1:
        影舞者护石选项.append(i.名称)

影舞者符文选项 = ['无']
for i in 影舞者技能列表:
    if i.所在等级 >= 20 and i.所在等级 <= 80 and i.所在等级 != 50 and i.是否有伤害 == 1:
        影舞者符文选项.append(i.名称)


class 影舞者角色属性(角色属性):
    职业名称 = '影舞者'

    武器选项 = ['匕首']

    # '物理百分比','魔法百分比','物理固伤','魔法固伤'
    伤害类型选择 = ['物理百分比']

    # 默认
    伤害类型 = '物理百分比'
    防具类型 = '皮甲'
    防具精通属性 = ['力量']

    主BUFF = 2.03

    # 基础属性(含唤醒)
    基础力量 = 969.0
    基础智力 = 840.0

    # 适用系统奶加成
    力量 = 基础力量
    智力 = 基础智力

    # 人物基础 + 唤醒
    物理攻击力 = 65.0
    魔法攻击力 = 65.0
    独立攻击力 = 1045.0
    火属性强化 = 13
    冰属性强化 = 13
    光属性强化 = 13
    暗属性强化 = 13

    一觉Buff开关 = 0

    def __init__(self):
        self.技能栏 = deepcopy(影舞者技能列表)
        self.技能序号 = deepcopy(影舞者技能序号)


    def 被动倍率计算(self):
        if self.一觉Buff开关 == 1:
            self.技能栏[self.技能序号['暗杀之匕首精通']].等级 += 3
        for i in self.技能栏:
            if i.关联技能 != ['无']:
                if i.关联技能 == ['所有']:
                    if i.名称 != '暗杀之匕首精通':
                       for j in self.技能栏:
                           if j.是否有伤害 == 1:
                              j.被动倍率 *= i.加成倍率(self.武器类型)
                    elif i.名称 == '暗杀之匕首精通':
                        for j in self.技能栏:
                            if j.是否有伤害 == 1 and j.名称 !='影斩·乱舞':
                                j.被动倍率 *= i.加成倍率(self.武器类型)
                            elif j.名称 =='影斩·乱舞':
                                if self.一觉Buff开关 == 1:
                                   i.等级 -= 3
                                   j.被动倍率 *= i.加成倍率(self.武器类型)
                                   i.等级 += 3
                                else:
                                    j.被动倍率 *= i.加成倍率(self.武器类型)
                else :
                    for k in i.关联技能:
                        self.技能栏[self.技能序号[k]].被动倍率 *= i.加成倍率(self.武器类型)

        基准倍率 = 1.5 * (0.9 + self.主BUFF/10) * (1 - 443243 / (443243 + 20000))

        if self.伤害类型 == '物理百分比':
            面板 = (self.面板力量()/250+1) * round((self.物理攻击力 + self.进图物理攻击力) * (1 + self.百分比三攻), 5)
        if self.伤害类型 == '魔法百分比':
            面板 = (self.面板智力()/250+1) * round((self.魔法攻击力 + self.进图魔法攻击力) * (1 + self.百分比三攻), 5)
        if self.伤害类型 == '物理固伤':
            面板 = (self.面板力量()/250+1) * round((self.独立攻击力 + self.进图独立攻击力) * (1 + self.百分比三攻), 5)
        if self.伤害类型 == '魔法固伤':
            面板 = (self.面板智力()/250+1) * round((self.独立攻击力 + self.进图独立攻击力) * (1 + self.百分比三攻), 5)

        self.火属性强化 += int((self.火属性强化 - 22) * self.百分比属强)
        self.冰属性强化 += int((self.冰属性强化 - 22) * self.百分比属强)
        self.光属性强化 += int((self.光属性强化 - 22) * self.百分比属强)
        self.暗属性强化 += int((self.暗属性强化 - 22) * self.百分比属强)
        属性倍率=1.05+0.0045*max(self.火属性强化,self.冰属性强化,self.光属性强化,self.暗属性强化)
        增伤倍率=1+self.伤害增加
        增伤倍率*=1+self.暴击伤害
        增伤倍率*=1+self.最终伤害
        增伤倍率*=self.技能攻击力
        增伤倍率*=1+self.持续伤害*(1-0.1*self.持续伤害计算比例)
        增伤倍率*=1+self.附加伤害+self.属性附加*属性倍率
        self.伤害指数=面板*属性倍率*增伤倍率*基准倍率/100


class 影舞者(角色窗口):
    def 窗口属性输入(self):
        self.初始属性 = 影舞者角色属性()
        self.角色属性A = 影舞者角色属性()
        self.角色属性B = 影舞者角色属性()
        self.一觉序号 = 影舞者一觉序号
        self.二觉序号 = 影舞者二觉序号
        self.三觉序号 = 影舞者三觉序号
        self.护石选项 = deepcopy(影舞者护石选项)
        self.符文选项 = deepcopy(影舞者符文选项)

    def 界面(self):
        super().界面()
        self.一觉Buff开关=QCheckBox('一觉Buff',self.main_frame2)
        self.一觉Buff开关.resize(100,20)
        self.一觉Buff开关.move(325,420)
        self.一觉Buff开关.setStyleSheet(复选框样式)
        self.一觉Buff开关.setChecked(True)

    def 输入属性(self, 属性, x = 0):
        super().输入属性(属性)
        if self.一觉Buff开关.isChecked():
            属性.一觉Buff开关= 1
