from PublicReference.base import *

class 掠天之翼技能0(主动技能):
    名称 = '致命射击'
    所在等级 = 15
    等级上限 = 60
    基础等级 = 46
    基础 = 950.6
    成长 = 107.4
    CD = 6.9
    TP成长 = 0.1
    TP上限 = 7

class 掠天之翼技能1(被动技能):
    名称 = '左轮奥义'
    所在等级 = 15
    等级上限 = 20
    基础等级 = 10
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        if self.等级 <= 10:
            return round(1.1 + 0.01 * self.等级, 5)
        else:
            return round(1.0 + 0.02 * self.等级, 5)

    def 物理攻击力倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        if self.等级 <= 10:
            return round(1.1 + 0.01 * self.等级, 5)
        else:
            return round(1.0 + 0.02 * self.等级, 5)

class 掠天之翼技能2(被动技能):
    名称 = '花式枪术'
    所在等级 = 20
    等级上限 = 20
    基础等级 = 10
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        if self.等级 <= 10:
            return round(1.0 + 0.01 * self.等级, 5)
        else:
            return round(0.9 + 0.02 * self.等级, 5)

class 掠天之翼技能3(主动技能):
    名称 = '三连发'
    所在等级 = 30
    等级上限 = 60
    基础等级 = 38
    基础 = 457.27
    成长 = 51.73
    基础2 = 916.54
    成长2 = 103.46
    攻击次数2 = 1
    基础3 = 2291.35
    成长3 = 258.65
    攻击次数3 = 1
    CD = 8.0
    TP成长 = 0.1
    TP上限 = 7

class 掠天之翼技能4(主动技能):
    名称 = '致命回射'
    所在等级 = 30
    等级上限 = 1
    基础等级 = 1
    CD = 8.3

class 掠天之翼技能5(主动技能):
    名称 = '乱射'
    所在等级 = 35
    等级上限 = 60
    基础等级 = 36
    基础 = 441.11
    成长 = 49.89
    攻击次数 = 20
    CD = 19.8
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1

    def 装备护石(self):
         self.基础 *= 1.14
         self.成长 *= 1.14
         self.攻击次数 = 22

class 掠天之翼技能6(主动技能):
    名称 = '移动射击'
    所在等级 = 35
    等级上限 = 60
    基础等级 = 36
    基础 = 386.31
    成长 = 43.69
    攻击次数 = 30
    CD = 24.3
    TP成长 = 0.10
    TP上限 = 7

class 掠天之翼技能7(主动技能):
    名称 = '多重射击'
    所在等级 = 40
    等级上限 = 60
    基础等级 = 33
    基础 = 1998.31
    成长 = 225.69
    攻击次数 = 5
    CD = 19.8
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1

    def 装备护石(self):
         self.基础 *= 6.1
         self.成长 *= 6.1
         self.攻击次数 = 1

class 掠天之翼技能8(主动技能):
    名称 = '双鹰回旋'
    所在等级 = 45
    等级上限 = 60
    基础等级 = 31
    基础 = 460.86
    成长 = 52.14
    基础2 = 477.10
    成长2 = 53.90
    基础3 = 501.36
    成长3 = 56.64
    基础攻击次数 = 16
    基础攻击次数2 = 18
    基础攻击次数3 = 22
    攻击间隔 = 1.0
    攻击次数 = 基础攻击次数 / 攻击间隔 
    攻击次数2 = 基础攻击次数2 / 攻击间隔 
    攻击次数3 = 基础攻击次数3 / 攻击间隔 
    CD = 43.2
    TP成长 = 0.05
    TP基础 = 5
    TP上限 = 7
    是否有护石 = 1

    def 等效百分比(self, 武器类型):
        x = 1 - 0.05 * self.TP等级
        self.攻击次数 = int(self.基础攻击次数/self.攻击间隔/x)
        self.攻击次数2 = int(self.基础攻击次数2/self.攻击间隔/x)
        self.攻击次数3 = int(self.基础攻击次数3/self.攻击间隔/x)
        if self.等级 == 0:
            return 0
        else:
            return int((self.攻击次数 * (self.基础 + self.成长 * self.等级) + self.攻击次数2 * (self.基础2 + self.成长2 * self.等级) + self.攻击次数3 * (
                        self.基础3 + self.成长3 * self.等级)) * (1 + self.TP成长 * self.TP等级) * self.倍率)

    def 装备护石(self):
         self.基础2 *= 1.08
         self.成长2 *= 1.08
         self.基础攻击次数 = 0
         self.攻击间隔 *= 0.7

class 掠天之翼技能9(被动技能):
    名称 = '死亡印记'
    所在等级 = 48
    等级上限 = 40
    基础等级 = 20

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.025 + 0.02 * self.等级, 5)

class 掠天之翼技能10(主动技能):
    名称 = '疯狂屠戮'
    所在等级 = 50
    等级上限 = 40
    基础等级 = 12
    基础 = 496
    成长 = 152
    基础2 = 407
    成长2 = 129
    基础3 = 744
    成长3 = 218
    攻击次数2 = 70
    攻击次数3 = 25
    CD = 145

class 掠天之翼技能11(主动技能):
    名称 = '死亡突袭'
    所在等级 = 60
    等级上限 = 40
    基础等级 = 23
    基础 = 5824.41
    成长 = 657.59
    攻击次数 = 3
    CD = 30.0
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1

    def 装备护石(self):
        self.倍率 *= 1.22
        self.CD *= 0.9

class 掠天之翼技能12(主动技能):
    名称 = '压制射击'
    所在等级 = 70
    等级上限 = 40
    基础等级 = 18
    基础 = 1327.24
    成长 = 149.76
    基础2 = 2949.06
    成长2 = 332.94
    攻击次数 = 20
    攻击次数2 = 1
    CD = 50.0
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1

    def 装备护石(self):
        self.攻击次数 = 24
        self.基础2 *= 1.52
        self.成长2 *= 1.52

class 掠天之翼技能13(被动技能):
    名称 = '射击掌握'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 11
    关联技能2 = ['致命射击']
 
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.22 + 0.02 * self.等级, 5)

    def 加成倍率2(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.305 + 0.045 * self.等级, 5)

class 掠天之翼技能14(主动技能):
    名称 = '疾风骤雨'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 16
    基础 = 2059.4
    成长 = 232.6
    攻击次数 = 24
    CD = 40.0

class 掠天之翼技能15(主动技能):
    名称 = '抹杀'
    所在等级 = 80
    等级上限 = 40
    基础等级 = 13
    基础 = 6631.42
    成长 = 748.58
    攻击次数 = 7
    CD = 45.0

class 掠天之翼技能16(主动技能):
    名称 = '第七翼动'
    所在等级 = 85
    等级上限 = 40
    基础等级 = 5
    基础 = 5027
    成长 = 1517
    基础2 = 27992
    成长2 = 8455
    攻击次数 = 12
    攻击次数2 = 1
    CD = 180

class 掠天之翼技能17(被动技能):
    名称 = '卓越之力'
    所在等级 = 95
    等级上限 = 40
    基础等级 = 4

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.18 + 0.02 * self.等级, 5)

class 掠天之翼技能18(被动技能):
    名称 = '超卓之心'
    所在等级 = 95
    等级上限 = 11
    基础等级 = 1

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.045 + 0.005 * self.等级, 5)

class 掠天之翼技能19(被动技能):
    名称 = '觉醒之抉择'
    所在等级 = 100
    等级上限 = 40
    基础等级 = 2
    关联技能 = ['无']

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.10 + 0.05 * self.等级, 5)

掠天之翼技能列表 = []
i = 0
while i >= 0:
    try:
        exec('掠天之翼技能列表.append(掠天之翼技能'+str(i)+'())')
        i += 1
    except:
        i = -1

掠天之翼技能序号 = dict()
for i in range(len(掠天之翼技能列表)):
    掠天之翼技能序号[掠天之翼技能列表[i].名称] = i

掠天之翼一觉序号 = 0
掠天之翼二觉序号 = 0
掠天之翼三觉序号 = 0
for i in 掠天之翼技能列表:
    if i.所在等级 == 50:
        掠天之翼一觉序号 = 掠天之翼技能序号[i.名称]
    if i.所在等级 == 85:
        掠天之翼二觉序号 = 掠天之翼技能序号[i.名称]
    if i.所在等级 == 100:
        掠天之翼三觉序号 = 掠天之翼技能序号[i.名称]

掠天之翼护石选项 = ['无']
for i in 掠天之翼技能列表:
    if i.是否有伤害 == 1 and i.是否有护石 == 1:
        掠天之翼护石选项.append(i.名称)

掠天之翼符文选项 = ['无']
for i in 掠天之翼技能列表:
    if i.所在等级 >= 20 and i.所在等级 <= 80 and i.所在等级 != 50 and i.是否有伤害 == 1:
        掠天之翼符文选项.append(i.名称)

class 掠天之翼角色属性(角色属性):

    职业名称 = '掠天之翼'

    武器选项 = ['左轮枪']
    
    #'物理百分比','魔法百分比','物理固伤','魔法固伤'
    伤害类型选择 = ['物理百分比']
    
    #默认
    伤害类型 = '物理百分比'
    防具类型 = '皮甲'
    防具精通属性 = ['力量']

    主BUFF = 2.25
   
    #基础属性(含唤醒)
    基础力量 = 961.0
    基础智力 = 790.0
    
    #适用系统奶加成
    力量 = 基础力量
    智力 = 基础智力

    #人物基础 + 唤醒
    物理攻击力 = 65.0
    魔法攻击力 = 65.0
    独立攻击力 = 1045.0
    火属性强化 = 13
    冰属性强化 = 13
    光属性强化 = 13
    暗属性强化 = 13
  
    def __init__(self):
        self.技能栏= copy.deepcopy(掠天之翼技能列表)
        self.技能序号= copy.deepcopy(掠天之翼技能序号)

    def 被动倍率计算(self):
        super().被动倍率计算()
        self.技能栏[self.技能序号['致命回射']].基础 = self.技能栏[self.技能序号['致命射击']].等效百分比(self.武器类型)*1.5
        self.技能栏[self.技能序号['致命回射']].被动倍率 = self.技能栏[self.技能序号['致命射击']].被动倍率

class 掠天之翼(角色窗口):
    def 窗口属性输入(self):
        self.初始属性 = 掠天之翼角色属性()
        self.角色属性A = 掠天之翼角色属性()
        self.角色属性B = 掠天之翼角色属性()
        self.一觉序号 = 掠天之翼一觉序号
        self.二觉序号 = 掠天之翼二觉序号
        self.三觉序号 = 掠天之翼三觉序号
        self.护石选项 = copy.deepcopy(掠天之翼护石选项)
        self.符文选项 = copy.deepcopy(掠天之翼符文选项)
