from PublicReference.base import *

class 救世主技能0(主动技能):
    名称 = '罪业加身'
    所在等级 = 10
    等级上限 = 60
    基础等级 = 48
    基础 = 1809.5532
    成长 = 204.4468
    CD = 6.0
    TP成长 = 0.08
    TP上限 = 7

class 救世主技能1(主动技能):
    名称 = '双重切割'
    所在等级 = 15
    等级上限 = 60
    基础等级 = 46
    基础 = 956.9778
    成长 = 108.0222
    基础2 = 1434.9778
    成长2 = 162.0222
    CD = 6.0
    TP成长 = 0.1
    TP上限 = 7

class 救世主技能2(被动技能):
    名称 = '负罪者镰刀精通'
    所在等级 = 20
    等级上限 = 30
    基础等级 = 20
    def 加成倍率(self, 武器类型):
        if self.等级 <= 20:
            return round(1.05 + 0.01 * self.等级, 5)
        else:
            return round(0.85 + 0.02 * self.等级, 5)
    def 魔法攻击力倍率(self, 武器类型):
        if self.等级 <= 20:
            return round(1.05 + 0.01 * self.等级, 5)
        else:
            return round(0.85 + 0.02 * self.等级, 5)

class 救世主技能3(被动技能):
    名称 = '罪业诱惑'
    所在等级 = 20
    等级上限 = 20
    基础等级 = 10
    def 加成倍率(self, 武器类型):
        if self.等级 <= 10:
            return round(1.00 + 0.01 * self.等级, 5)
        else:
            return round(0.90 + 0.02 * self.等级, 5)

class 救世主技能4(主动技能):
    名称 = '断头台'
    所在等级 = 20
    等级上限 = 60
    基础等级 = 43
    基础 = 3757.6429
    成长 = 424.3571
    CD =8.0
    TP成长 = 0.10
    TP上限 = 7

class 救世主技能5(主动技能):
    名称 = '欲望之手'
    所在等级 = 20
    等级上限 = 60
    基础等级 = 43
    基础 = 3784.6429
    成长 = 427.3571
    CD = 8.0
    TP成长 = 0.10
    TP上限 = 7

class 救世主技能6(主动技能):
    名称 = '傲慢之堕'
    所在等级 = 25
    等级上限 = 60
    基础等级 = 27
    基础 = 3996.7308
    成长 = 758.2692
    CD = 10.0
    TP成长 = 0.10
    TP上限 = 7

class 救世主技能7(主动技能):
    名称 = '屠戮回旋斩'
    所在等级 = 30
    等级上限 = 60
    基础等级 = 38
    基础 = 5951.1622
    成长 = 671.8378
    CD = 12.0
    TP成长 = 0.10
    TP上限 = 7

class 救世主技能8(主动技能):
    名称 = '怠惰之息'
    所在等级 = 30
    等级上限 = 60
    基础等级 = 38
    基础 = 6395
    成长 = 722
    CD = 15.0
    TP成长 = 0.10
    TP上限 = 7

class 救世主技能9(主动技能):
    名称 = '诱魔之手'
    所在等级 = 35
    等级上限 = 60
    基础等级 = 36
    基础 = 7952.8286
    成长 = 898.1714
    CD = 15.0
    TP成长 = 0.10
    TP上限 = 7

class 救世主技能10(主动技能):
    名称 = '贪婪之刺'
    所在等级 = 35
    等级上限 = 60
    基础等级 = 36
    基础 = 7019.2286
    成长 = 792.7714
    CD = 20.0
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1
    def 装备护石(self):
        self.倍率 *= 1.207556
        self.CD *= 0.85

class 救世主技能11(主动技能):
    名称 = '杀戮战镰'
    所在等级 = 40
    等级上限 = 60
    基础等级 = 33
    基础 = 10358.1563
    成长 = 1170.8438
    CD = 20.0
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1
    def 装备护石(self):
        self.倍率 *= 1.224

class 救世主技能12(主动技能):
    名称 = '愤怒之袭'
    所在等级 = 45
    等级上限 = 60
    基础等级 = 31
    基础 = 17864.1
    成长 = 2016.9
    CD = 45.0
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1
    def 装备护石(self):
        self.倍率 *= 1.23

class 救世主技能13(主动技能):
    名称 = '净化之花'
    所在等级 = 50
    等级上限 = 40
    基础等级 = 12
    基础 = 43085.1818
    成长 = 13008.8181
    CD = 140

class 救世主技能14(被动技能):
    名称 = '罪业宣告'
    所在等级 = 48
    等级上限 = 40
    基础等级 = 20
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.04+0.02 * self.等级, 5)

class 救世主技能15(主动技能):
    名称 = '嫉妒之吻'
    所在等级 = 60
    等级上限 = 40
    基础等级 = 23
    基础 = 17256.5909
    成长 = 1948.4091
    CD = 30
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1
    def 装备护石(self):
        self.倍率 *= 1.19

class 救世主技能16(主动技能):
    名称 = '暴食之噬'
    所在等级 = 70
    等级上限 = 40
    基础等级 = 18
    基础 = 5821.6471
    成长 = 658.3529
    攻击次数 = 1
    基础2 = 23307.7647
    成长2 = 2632.2353
    攻击次数2 = 1
    CD = 50
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1
    def 装备护石(self):
        self.基础 *= 1.5
        self.成长 *= 1.5
        self.基础2 *= 1.08
        self.成长2 *= 1.08

class 救世主技能17(主动技能):
    名称 = '灵魂烙印：原罪冲击'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 16
    基础 = 41822.3333
    成长 = 4722.6667
    CD = 40

class 救世主技能18(主动技能):
    名称 = '原罪结晶'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 11
    基础 = 3188.1
    成长 = 640.9
    CD = 2

class 救世主技能19(被动技能):
    名称 = '智慧起源'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 11
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.23 + 0.02 * self.等级, 5)

class 救世主技能20(主动技能):
    名称 = '肋骨重塑：原罪战矛'
    所在等级 = 80
    等级上限 = 40
    基础等级 = 13
    基础 = 56828.4708
    成长 = 6416.0992
    CD = 45.0

class 救世主技能21(主动技能):
    名称 = '失乐园'
    所在等级 = 85
    等级上限 = 40
    基础等级 = 5
    基础 = 103353.25
    成长 = 31201.75
    CD = 180.0

class 救世主技能22(被动技能):
    名称 = '卓越之力'
    所在等级 = 95
    等级上限 = 40
    基础等级 = 4
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.18 + 0.02 * self.等级, 5)

class 救世主技能23(被动技能):
     名称 = '超卓之心'
     所在等级 = 95
     等级上限 = 11
     基础等级 = 1
     def 加成倍率(self, 武器类型):
         if self.等级 == 0:
             return 1.0
         else:
             return round(1.045 + 0.005 * self.等级, 5)

class 救世主技能24(被动技能):
    名称 = '觉醒之抉择'
    所在等级 = 100
    等级上限 = 40
    基础等级 = 2
    关联技能 = ['无']
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.10 + 0.05 * self.等级, 5)


救世主技能列表 = []
i = 0
while i >= 0:
    try:
        exec('救世主技能列表.append(救世主技能'+str(i)+'())')
        i += 1
    except:
        i = -1

救世主技能序号 = dict()
for i in range(len(救世主技能列表)):
    救世主技能序号[救世主技能列表[i].名称] = i

救世主一觉序号 = 0
救世主二觉序号 = 0
救世主三觉序号 = 0
for i in 救世主技能列表:
    if i.所在等级 == 50:
        救世主一觉序号 = 救世主技能序号[i.名称]
    if i.所在等级 == 85:
        救世主二觉序号 = 救世主技能序号[i.名称]
    if i.所在等级 == 100:
        救世主三觉序号 = 救世主技能序号[i.名称]

救世主护石选项 = ['无']
for i in 救世主技能列表:
    if i.是否有伤害 == 1 and i.是否有护石 == 1:
        救世主护石选项.append(i.名称)

救世主符文选项 = ['无']
for i in 救世主技能列表:
    if i.所在等级 >= 20 and i.所在等级 <= 80 and i.所在等级 != 50 and i.是否有伤害 == 1:
        救世主符文选项.append(i.名称)

class 救世主角色属性(角色属性):

    职业名称 = '救世主'

    武器选项 = ['镰刀']
    
    #'物理百分比','魔法百分比','物理固伤','魔法固伤'
    伤害类型选择 = ['魔法百分比']
    
    #默认
    伤害类型 = '魔法百分比'
    防具类型 = '重甲'
    防具精通属性 = ['智力']

    主BUFF = 2.01
   
    #基础属性(含唤醒)
    基础力量 = 793.0
    基础智力 = 952.0
    
    #适用系统奶加成
    力量 = 基础力量
    智力 = 基础智力

    #人物基础 + 唤醒
    物理攻击力 = 65.0
    魔法攻击力 = 65.0
    独立攻击力 = 1045.0
    火属性强化 = 13
    冰属性强化 = 13
    光属性强化 = 13
    暗属性强化 = 13
    远古记忆 = 0

    def __init__(self):
        self.技能栏= deepcopy(救世主技能列表)
        self.技能序号= deepcopy(救世主技能序号)


    def 被动倍率计算(self):
        super().被动倍率计算()



class 救世主(角色窗口):
    def 窗口属性输入(self):
        self.初始属性 = 救世主角色属性()
        self.角色属性A = 救世主角色属性()
        self.角色属性B = 救世主角色属性()
        self.一觉序号 = 救世主一觉序号
        self.二觉序号 = 救世主二觉序号
        self.三觉序号 = 救世主三觉序号
        self.护石选项 = deepcopy(救世主护石选项)
        self.符文选项 = deepcopy(救世主符文选项)