from math import *
from PublicReference.base import *

# 2020.6.29 

# 武器源力剑
class 未来开拓者主动技能(主动技能):
    def 等效CD(self, 武器类型):
        if 武器类型 == '源力剑':
            return round(self.CD / self.恢复 * 1.05, 1)
            
# 源力剑精通
class 未来开拓者技能0(被动技能):
    名称 = '源力剑精通'
    所在等级 = 20
    等级上限 = 30
    基础等级 = 20
    谍影专用倍率 = 1
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        if self.等级 <= 20:
            return round(1 + (0.05 + 0.01 * self.等级) * self.谍影专用倍率, 5)
        else:
            return round(1 + (0.25 + 0.02 * ( self.等级 - 20 )) * self.谍影专用倍率, 5)

    def 魔法攻击力倍率(self, 武器类型):
        return self.加成倍率(武器类型)


# 细胞弱化
class 未来开拓者技能1(被动技能):
    名称 = '细胞弱化'
    所在等级 = 25
    等级上限 = 11
    基础等级 = 1
    
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.23 + 0.02 * self.等级, 5)


# 源能增幅一觉被动
class 未来开拓者技能2(被动技能):
    名称 = '源能增幅'
    所在等级 = 48
    等级上限 = 40
    基础等级 = 20

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.025 + 0.02 * self.等级, 5)


# 二觉被动
class 未来开拓者技能3(被动技能):
    名称 = '源力汇聚'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 11

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.22 + 0.02 * self.等级, 5)


# 卓越之力
class 未来开拓者技能4(被动技能):
    名称 = '卓越之力'
    所在等级 = 95
    等级上限 = 40
    基础等级 = 4

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.18 + 0.02 * self.等级, 5)


# 超卓之心
class 未来开拓者技能5(被动技能):
    名称 = '超卓之心'
    所在等级 = 95
    等级上限 = 11
    基础等级 = 1

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.045 + 0.005 * self.等级, 5)


# 觉醒之抉择
class 未来开拓者技能6(被动技能):
    名称 = '觉醒之抉择'
    所在等级 = 100
    等级上限 = 40
    基础等级 = 2
    关联技能 = ['无']

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.10 + 0.05 * self.等级, 5)
            
# 源光斩
class 未来开拓者技能7(未来开拓者主动技能):
    名称 = '源光斩'
    所在等级 = 10
    等级上限 = 60
    基础等级 = 48
    攻击段数 = 2
    基础 = 1443.00 - 146.85
    成长 = 146.85
    CD = 5
    TP成长 = 0.08
    TP上限 = 5


# 旋转源能波
class 未来开拓者技能8(未来开拓者主动技能):
    名称 = '旋转源能波'
    所在等级 = 15
    等级上限 = 60
    基础等级 = 46
    攻击段数 = 2
    基础 = 1896.00 - 193.16
    成长 = 193.16
    CD = 5
    TP成长 = 0.10
    TP上限 = 7

# 源能护盾，未提炼
class 未来开拓者技能9(未来开拓者主动技能):
    名称 = '源能护盾'
    所在等级 = 15
    等级上限 = 60
    基础等级 = 46
    攻击段数 = 2
    基础 = 2996.00 - 310.67
    成长 = 310.67
    CD = 8
    TP成长 = 0.08
    TP上限 = 5


# 镭射源能枪
class 未来开拓者技能10(未来开拓者主动技能):
    名称 = '镭射源能枪'
    所在等级 = 20
    等级上限 = 60
    基础等级 = 43
    攻击段数 = 2
    基础 = 3116.00 - 316.33
    成长 = 316.33
    CD = 10
    TP成长 = 0.10
    TP上限 = 7


# 源能波刃
class 未来开拓者技能11(未来开拓者主动技能):
    名称 = '源能波刃'
    所在等级 = 25
    等级上限 = 60
    基础等级 = 41
    攻击段数 = 11
    基础 = 3138.00 - 318.48
    成长 = 318.48
    CD = 8
    TP成长 = 0.10
    TP上限 = 7

#能量飞鱼弹
class 未来开拓者技能12(未来开拓者主动技能):
    名称 = '能量飞鱼弹'
    所在等级 = 25
    等级上限 = 60
    基础等级 = 41
    攻击段数 = 1
    基础 = 3254.00 - 330.23
    成长 = 330.23
    CD = 7.5
    TP成长 = 0.10
    TP上限 = 7
    
# 脉冲斩
class 未来开拓者技能13(未来开拓者主动技能):
    名称 = '脉冲斩'
    所在等级 = 30
    等级上限 = 60
    基础等级 = 38
    攻击段数 = 8
    基础 = 4080.00 - 413.84
    成长 = 413.84
    CD = 10
    TP成长 = 0.10
    TP上限 = 7


# 电磁领域
class 未来开拓者技能14(未来开拓者主动技能):
    名称 = '电磁领域'
    所在等级 = 35
    等级上限 = 60
    基础等级 = 36
    攻击段数 = 3
    基础 = 6673.00 - 677.71
    成长 = 677.71
    CD = 20
    TP成长 = 0.10
    TP上限 = 7


# 引力源光弹
class 未来开拓者技能15(未来开拓者主动技能):
    名称 = '引力源光弹'
    所在等级 = 35
    等级上限 = 60
    基础等级 = 36
    
    基础 = 593 - 60
    成长 = 60
    攻击次数 = 8
    
    基础2 = 1673 - 170
    成长2 = 170
    攻击次数2 = 1
   
    CD = 15
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1
    技能施放时间 = 1
    是否装备护石 = 0
    def 装备护石(self):
        self.攻击次数2 = 1.28 
        self.是否装备护石 = 1


# 光裂斩，护石取最大蓄气
class 未来开拓者技能16(未来开拓者主动技能):
    名称 = '光裂斩'
    所在等级 = 40
    等级上限 = 60
    基础等级 = 33
    攻击段数 = 1
    CD = 25
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1

    基础 = 5612 - 569
    成长 = 569
    攻击次数 = 1
    
    基础2 = 747 - 76
    成长2 = 76
    攻击次数2 = 5
   

    def 装备护石(self):
        self.攻击次数 = 1.98 * 1.06
        self.攻击次数2 = 0

# 光导裂地斩
class 未来开拓者技能17(未来开拓者主动技能):
    名称 = '光导裂地斩'
    所在等级 = 45
    等级上限 = 60
    基础等级 = 31
    攻击段数 = 6
    基础 = 6247 - 633.5
    成长 = 633.5
    攻击次数 = 1
    
    基础2 = 9512 - 965
    成长2 = 965
    攻击次数2 = 1
   
    CD = 45
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1

    def 装备护石(self):
        self.攻击次数 *= 1.17
        self.攻击次数2 *= 1.2


# 一觉，非提炼
class 未来开拓者技能18(未来开拓者主动技能):
    名称 = '超能场域'
    所在等级 = 50
    等级上限 = 40
    基础等级 = 12
    攻击段数 = 13
    基础 = 2012 - 12 * 131.4
    成长 = 131.4
    攻击次数 = 13
    
    基础2 = 112716 - 7361 * 12
    成长2 = 7361
    攻击次数2 = 1
   
    CD = 145


# 能量禁锢，两次爆炸
class 未来开拓者技能19(未来开拓者主动技能):
    名称 = '能量禁锢'
    所在等级 = 60
    等级上限 = 40
    基础等级 = 23

    CD = 25
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1


    基础 = 792 - 81
    成长 = 81
    攻击次数 = 10

    基础2 = 3397 - 344.5
    成长2 = 344.5
    攻击次数2 = 1


    def 装备护石(self):
        self.攻击次数 = 14 * 0.8
        self.攻击次数2 = 1.66
        
        
# 离散能量波

class 未来开拓者技能20(未来开拓者主动技能):
    名称 = '离散能量波'
    所在等级 = 70
    等级上限 = 40
    基础等级 = 18
    
    基础 = 1658 - 168.5
    成长 = 168.5
    攻击次数 = 10
    
    基础2 = 7109 - 721.5
    成长2 = 721.5
    攻击次数2 = 1 

    CD = 50
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1

    def 装备护石(self):
        self.CD *= 0.9
        self.攻击次数 = 15 * 0.75
        self.攻击次数2 *= 1.4
 
# 绝望圆舞
class 未来开拓者技能21(未来开拓者主动技能):
    名称 = '绝望圆舞'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 16
    攻击段数 = 8
    基础 = 38894.00 - 3946.60
    成长 = 3946.60
    CD = 40

# CEAB-2超能爆发，满蓄
class 未来开拓者技能22(未来开拓者主动技能):
    名称 = 'CEAB-2超能爆发'
    所在等级 = 80
    等级上限 = 40
    基础等级 = 13
    攻击段数 = 1
    基础 = 44464.00 - 4510.92
    成长 = 4510.92
    CD = 45

# 二觉，1.5秒后c
class 未来开拓者技能23(未来开拓者主动技能):
    名称 = '终焉：超世界崩坏'
    所在等级 = 85
    等级上限 = 40
    基础等级 = 5
    攻击段数 = 17
    
    基础 = 1800 - 216.33333 * 5
    成长 = 216.33333
    攻击次数 = 6
    
    基础2 = 168632 - 20286.5 *5
    成长2 = 20286.5
    攻击次数2 = 1 

    CD = 180


未来开拓者技能列表 = []
i = 0
while i >= 0:
    try:
        exec('未来开拓者技能列表.append(未来开拓者技能' + str(i) + '())')
        i += 1
    except:
        i = -1

未来开拓者技能序号 = dict()
for i in range(len(未来开拓者技能列表)):
    未来开拓者技能序号[未来开拓者技能列表[i].名称] = i

未来开拓者一觉序号 = 0
未来开拓者二觉序号 = 0
未来开拓者三觉序号 = 0
for i in 未来开拓者技能列表:
    if i.所在等级 == 50:
        未来开拓者一觉序号 = 未来开拓者技能序号[i.名称]
    if i.所在等级 == 85:
        未来开拓者二觉序号 = 未来开拓者技能序号[i.名称]
    if i.所在等级 == 100:
        未来开拓者三觉序号 = 未来开拓者技能序号[i.名称]

未来开拓者护石选项 = ['无']
for i in 未来开拓者技能列表:
    if i.是否有伤害 == 1 and i.是否有护石 == 1:
        未来开拓者护石选项.append(i.名称)

未来开拓者符文选项 = ['无']
for i in 未来开拓者技能列表:
    if i.所在等级 >= 20 and i.所在等级 <= 80 and i.所在等级 != 50 and i.是否有伤害 == 1:
        未来开拓者符文选项.append(i.名称)


class 未来开拓者角色属性(角色属性):
    职业名称 = '未来开拓者'

    武器选项 = ['源力剑']

    # '物理百分比','魔法百分比','物理固伤','魔法固伤'
    伤害类型选择 = ['魔法百分比']

    # 默认
    伤害类型 = '魔法百分比'
    防具类型 = '布甲'
    防具精通属性 = ['智力']

    主BUFF = 2.0
    
    # 基础属性(含唤醒)
    基础力量 = 793
    基础智力 = 958

    # 适用系统奶加成
    力量 = 基础力量
    智力 = 基础智力

    # 人物基础 + 唤醒
    物理攻击力 = 65.0
    魔法攻击力 = 65.0
    独立攻击力 = 1045
    火属性强化 = 13
    冰属性强化 = 13
    光属性强化 = 13
    暗属性强化 = 13
    远古记忆 = 0
    

    def __init__(self):
        self.技能栏 = deepcopy(未来开拓者技能列表)
        self.技能序号 = deepcopy(未来开拓者技能序号)

    def 被动倍率计算(self):
        super().被动倍率计算()
        
    def 伤害计算(self, x = 0):
        
        self.所有属性强化(self.进图属强)
        # Will添加
        self.CD倍率计算()
        self.加算冷却计算()

        self.被动倍率计算()
        self.伤害指数计算()

        技能释放次数=[]
        技能单次伤害=[]
        技能总伤害=[]
    
        #技能单次伤害计算
        for i in self.技能栏:
            if i.是否有伤害==1:
                技能单次伤害.append(i.等效百分比(self.武器类型)*self.伤害指数*i.被动倍率)
            else:
                技能单次伤害.append(0)
      
        #技能释放次数计算
        for i in self.技能栏:
            if i.是否有伤害==1:
                if self.次数输入[self.技能序号[i.名称]] =='/CD':
                    技能释放次数.append(int((self.时间输入 - i.演出时间)/i.等效CD(self.武器类型) + 1 +i.基础释放次数))
                elif self.次数输入[self.技能序号[i.名称]] != '0':
                    技能释放次数.append(int(self.次数输入[self.技能序号[i.名称]]))
                else:
                    技能释放次数.append(0)
            else:
                技能释放次数.append(0)
    
        #单技能伤害合计
    
        for i in self.技能栏:
            if i.是否有伤害==1 and 技能释放次数[self.技能序号[i.名称]] != 0:
                技能总伤害.append(技能单次伤害[self.技能序号[i.名称]]*技能释放次数[self.技能序号[i.名称]]*(1+self.白兔子技能*0.20+self.年宠技能*0.10*self.宠物次数[self.技能序号[i.名称]]/技能释放次数[self.技能序号[i.名称]]+self.斗神之吼秘药*0.12))
            else:
                技能总伤害.append(0)
    
        总伤害=0
        
        
        #引力源光弹护石
        if self.技能栏[self.技能序号['引力源光弹']].是否装备护石 == 1:
            技能总伤害[self.技能序号['CEAB-2超能爆发']] += ( 技能总伤害[self.技能序号['引力源光弹']] * 0.3 )
        
        
        for i in self.技能栏:
            总伤害+=技能总伤害[self.技能序号[i.名称]]
        
        if x==0:
            return 总伤害
    
        if x==1:
            详细数据=[]
            for i in range(0,len(self.技能栏)):
                详细数据.append(技能释放次数[i])
                详细数据.append(技能总伤害[i])
                if 技能释放次数[i]!=0:
                    详细数据.append(技能总伤害[i]/技能释放次数[i])
                else:
                    详细数据.append(0)
                if 总伤害!=0:
                    详细数据.append(技能总伤害[i]/总伤害*100)
                else:
                    详细数据.append(0)
            return 详细数据


class 未来开拓者(角色窗口):
    def 窗口属性输入(self):
        self.初始属性 = 未来开拓者角色属性()
        self.角色属性A = 未来开拓者角色属性()
        self.角色属性B = 未来开拓者角色属性()
        self.一觉序号 = 未来开拓者一觉序号
        self.二觉序号 = 未来开拓者二觉序号
        self.三觉序号 = 未来开拓者三觉序号
        self.护石选项 = deepcopy(未来开拓者护石选项)
        self.符文选项 = deepcopy(未来开拓者符文选项)

