from PublicReference.base import *

class 极诣漫游枪手男技能0(主动技能):
    名称 = '致命射击'
    所在等级 = 15
    等级上限 = 60
    基础等级 = 46
    基础 = 950.6*1.1
    成长 = 107.4*1.1
    攻击次数 = 1
    CD = 6.9
    TP成长 = 0.1
    TP上限 = 7

class 极诣漫游枪手男技能1(被动技能):
    名称 = '左轮奥义'
    所在等级 = 15
    等级上限 = 20
    基础等级 = 10
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        if self.等级 <= 10:
            return round(1.1 + 0.01 * self.等级, 5)
        else:
            return round(1.2 + 0.02 * (self.等级 - 10), 5)

    def 物理攻击力倍率(self, 武器类型):
        return self.加成倍率(武器类型)


class 极诣漫游枪手男技能2(被动技能):
    名称 = '花式枪术'
    所在等级 = 20
    等级上限 = 20
    基础等级 = 10
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            if self.等级 <= 10:
                return round(1 + 0.01 * self.等级, 5)
            else:
                return round(1.1 + 0.02 * (self.等级 - 10), 5)


class 极诣漫游枪手男技能3(主动技能):
    名称 = '三连发'
    所在等级 = 30
    等级上限 = 60
    基础等级 = 38
    基础 = 457.27/1.126*1.17
    成长 = 51.73/1.126*1.17
    基础2 = 916.54/1.126*1.17
    成长2 = 103.46/1.126*1.17
    攻击次数2 = 2
    基础3 = 2291.35/1.126*1.17
    成长3 = 258.65/1.126*1.17
    攻击次数3 = 1
    CD = 8.0
    TP成长 = 0.1
    TP上限 = 7

class 极诣漫游枪手男技能4(主动技能):
    名称 = '致命回射'
    所在等级 = 30
    等级上限 = 1
    基础等级 = 1
    CD = 8.7

class 极诣漫游枪手男技能5(主动技能):
    名称 = '乱射'
    所在等级 = 35
    等级上限 = 60
    基础等级 = 36
    基础 = 441.11
    成长 = 49.89
    攻击次数 = 20
    CD = 17.6
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1

    def 装备护石(self):
         self.基础 *= 1.14
         self.成长 *= 1.14
         self.攻击次数 = 22

class 极诣漫游枪手男技能6(主动技能):
    名称 = '移动射击'
    所在等级 = 35
    等级上限 = 60
    基础等级 = 36
    基础 = 386.31/1.083*1.133
    成长 = 43.69/1.083*1.133
    攻击次数 = 30
    CD = 24.3
    TP成长 = 0.10
    TP上限 = 7

class 极诣漫游枪手男技能7(主动技能):
    名称 = '多重射击'
    所在等级 = 40
    等级上限 = 60
    基础等级 = 33
    基础 = 1998.31
    成长 = 225.69
    攻击次数 = 5
    CD = 19.8
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1

    def 装备护石(self):
         self.基础 *= 6.1
         self.成长 *= 6.1
         self.攻击次数 = 1

class 极诣漫游枪手男技能8(主动技能):
    名称 = '双鹰回旋'
    所在等级 = 45
    等级上限 = 60
    基础等级 = 31
    基础 = 498.633
    成长 = 56.367
    基础2 = 515.7
    成长2 = 58.3
    基础3 = 541.733
    成长3 = 61.267
    #攻击次数 = 18
    #攻击次数2 = 24
    #攻击次数3 = 30
    攻击速度 = 0.0944
    攻击速度2 = 0.0895
    攻击速度3 = 0.075
    基础时间 = 1.322
    基础时间2 = 1.612
    基础时间3 = 1.65
    基础攻击次数 = int(基础时间 / 攻击速度)
    基础攻击次数2 = int(基础时间2 / 攻击速度2)
    基础攻击次数3 = int(基础时间3 / 攻击速度3)
    基础回旋时间 = 0.6
    基础回旋时间2 = 0.7
    基础回旋时间3 = 0.8
    TP成长 = 0.05
    TP基础 = 5
    TP上限 = 7
    是否有护石 = 1
    CD = 43.2

    def 等效百分比(self, 武器类型):
        self.额外回旋时间 = 0.1 * self.TP等级 * self.基础回旋时间
        self.额外回旋时间2 = 0.1 * self.TP等级 * self.基础回旋时间2
        self.额外回旋时间3 = 0.1 * self.TP等级 * self.基础回旋时间3
        self.时间 = self.基础时间 + self.额外回旋时间
        self.时间2 = self.基础时间2 + self.额外回旋时间2
        self.时间3 = self.基础时间3 + self.额外回旋时间3
        self.攻击次数 = self.时间 / self.攻击速度
        self.攻击次数2 = self.时间2 / self.攻击速度2
        self.攻击次数3 = self.时间3 / self.攻击速度3

        if self.等级 == 0:
            return 0
        else:
            return int((self.攻击次数 * (self.基础 + self.成长 * self.等级) +
                        self.攻击次数2 * (self.基础2 + self.成长2 * self.等级) +
                        self.攻击次数3 * (self.基础3 + self.成长3 * self.等级)) * (1 + self.TP成长 * self.TP等级) * self.倍率)

    def 装备护石(self):
        self.基础2 *= 1.08
        self.成长2 *= 1.08
        self.基础时间 = 0
        #self.攻击次数 = 0
        self.攻击速度2 *= 0.7
        self.攻击速度3 *= 0.7

class 极诣漫游枪手男技能9(被动技能):
    名称 = '死亡印记'
    所在等级 = 48
    等级上限 = 40
    基础等级 = 20

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.025 + 0.02 * self.等级, 5)

class 极诣漫游枪手男技能10(主动技能):
    名称 = '疯狂屠戮'
    所在等级 = 50
    等级上限 = 40
    基础等级 = 12
    基础 = 496/1.126*1.154
    成长 = 152/1.126*1.154
    基础2 = 407/1.126*1.121
    成长2 = 129/1.126*1.121
    基础3 = 744/1.126*1.154
    成长3 = 218/1.126*1.154
    攻击次数 = 3
    攻击次数2 = 70
    攻击次数3 = 25
    CD = 145

class 极诣漫游枪手男技能11(主动技能):
    名称 = '死亡突袭'
    所在等级 = 60
    等级上限 = 40
    基础等级 = 23
    基础 = 5824.41/1.126*1.17
    成长 = 657.59/1.126*1.17
    攻击次数 = 3
    CD = 30.0
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1

    def 装备护石(self):
        self.倍率 *= 1.22
        self.CD *= 0.9

class 极诣漫游枪手男技能12(主动技能):
    名称 = '压制射击'
    所在等级 = 70
    等级上限 = 40
    基础等级 = 18
    基础 = 1327.24/1.126*1.17
    成长 = 149.76/1.126*1.17
    基础2 = 2949.06/1.126*1.17
    成长2 = 332.94/1.126*1.17
    攻击次数 = 20
    攻击次数2 = 1
    CD = 50.0
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1

    def 装备护石(self):
        self.攻击次数 = 24
        self.基础2 *= 1.52
        self.成长2 *= 1.52

class 极诣漫游枪手男技能13(被动技能):
    名称 = '射击掌握'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 11
    关联技能2 = ['致命射击']
 
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.22 + 0.02 * self.等级, 5)

    def 加成倍率2(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round((1.305 + 0.045 * self.等级)/(1.22 + 0.02 * self.等级), 5)

class 极诣漫游枪手男技能14(主动技能):
    名称 = '疾风骤雨'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 16
    基础 = 2059.4/1.126*1.136
    成长 = 232.6/1.126*1.136
    攻击次数 = 24
    CD = 40.0

class 极诣漫游枪手男技能15(主动技能):
    名称 = '抹杀'
    所在等级 = 80
    等级上限 = 40
    基础等级 = 13
    基础 = 6631.42/1.126*1.135
    成长 = 748.58/1.126*1.135
    攻击次数 = 7
    CD = 45.0

class 极诣漫游枪手男技能16(主动技能):
    名称 = '第七翼动'
    所在等级 = 85
    等级上限 = 40
    基础等级 = 5
    基础 = 5027/1.126*1.146
    成长 = 1517/1.126*1.146
    基础2 = 27992/1.126*1.146
    成长2 = 8455/1.126*1.146
    攻击次数 = 13
    攻击次数2 = 1
    CD = 180

class 极诣漫游枪手男技能17(被动技能):
    名称 = '卓尔不群'
    所在等级 = 95
    等级上限 = 40
    基础等级 = 4

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.18 + 0.02 * self.等级, 5)

class 极诣漫游枪手男技能18(主动技能):
    名称 = '极速扳机'
    所在等级 = 95
    等级上限 = 40
    基础等级 = 6
    基础=9326
    成长=1053
    基础2=37307
    成长2=4212
    攻击次数=6
    攻击次数2=1
    CD=60

class 极诣漫游枪手男技能19(主动技能):
     名称 = '死灭危机'
     所在等级 = 100
     等级上限 = 40
     基础等级 = 2
     基础=271532
     成长=81964
     CD=290
     
     def 加成倍率(self,武器类型):
         return 1.0
     


极诣漫游枪手男技能列表 = []
i = 0
while i >= 0:
    try:
        exec('极诣漫游枪手男技能列表.append(极诣漫游枪手男技能'+str(i)+'())')
        i += 1
    except:
        i = -1

极诣漫游枪手男技能序号 = dict()
for i in range(len(极诣漫游枪手男技能列表)):
    极诣漫游枪手男技能序号[极诣漫游枪手男技能列表[i].名称] = i

极诣漫游枪手男一觉序号 = 0
极诣漫游枪手男二觉序号 = 0
极诣漫游枪手男三觉序号 = 0
for i in 极诣漫游枪手男技能列表:
    if i.所在等级 == 50:
        极诣漫游枪手男一觉序号 = 极诣漫游枪手男技能序号[i.名称]
    if i.所在等级 == 85:
        极诣漫游枪手男二觉序号 = 极诣漫游枪手男技能序号[i.名称]
    if i.所在等级 == 100:
        极诣漫游枪手男三觉序号 = 极诣漫游枪手男技能序号[i.名称]

极诣漫游枪手男护石选项 = ['无']
for i in 极诣漫游枪手男技能列表:
    if i.是否有伤害 == 1 and i.是否有护石 == 1:
        极诣漫游枪手男护石选项.append(i.名称)

极诣漫游枪手男符文选项 = ['无']
for i in 极诣漫游枪手男技能列表:
    if i.所在等级 >= 20 and i.所在等级 <= 80 and i.所在等级 != 50 and i.是否有伤害 == 1:
        极诣漫游枪手男符文选项.append(i.名称)

class 极诣漫游枪手男角色属性(角色属性):

    职业名称 = '极诣漫游枪手男'

    武器选项 = ['左轮枪']
    
    #'物理百分比','魔法百分比','物理固伤','魔法固伤'
    伤害类型选择 = ['物理百分比']
    
    #默认
    伤害类型 = '物理百分比'
    防具类型 = '皮甲'
    防具精通属性 = ['力量']

    主BUFF = 2.25
   
    #基础属性(含唤醒)
    基础力量 = 961.0
    基础智力 = 790.0
    
    #适用系统奶加成
    力量 = 基础力量
    智力 = 基础智力

    #人物基础 + 唤醒
    物理攻击力 = 65.0
    魔法攻击力 = 65.0
    独立攻击力 = 1045.0
    火属性强化 = 13
    冰属性强化 = 13
    光属性强化 = 13
    暗属性强化 = 13
  
    def __init__(self):
        self.技能栏= copy.deepcopy(极诣漫游枪手男技能列表)
        self.技能序号= copy.deepcopy(极诣漫游枪手男技能序号)

    def 被动倍率计算(self):
        super().被动倍率计算()
        self.技能栏[self.技能序号['致命回射']].基础 = self.技能栏[self.技能序号['致命射击']].等效百分比(self.武器类型)*1.5
        self.技能栏[self.技能序号['致命回射']].被动倍率 = self.技能栏[self.技能序号['致命射击']].被动倍率

class 极诣漫游枪手男(角色窗口):
    def 窗口属性输入(self):
        self.初始属性 = 极诣漫游枪手男角色属性()
        self.角色属性A = 极诣漫游枪手男角色属性()
        self.角色属性B = 极诣漫游枪手男角色属性()
        self.一觉序号 = 极诣漫游枪手男一觉序号
        self.二觉序号 = 极诣漫游枪手男二觉序号
        self.三觉序号 = 极诣漫游枪手男三觉序号
        self.护石选项 = copy.deepcopy(极诣漫游枪手男护石选项)
        self.符文选项 = copy.deepcopy(极诣漫游枪手男符文选项)
