from PublicReference.base import *

class 混沌行者技能0(被动技能):
    名称 = '次元扭曲装置'
    所在等级 = 20
    等级上限 = 20
    基础等级 = 10

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        elif self.等级 <= 10:
            return round(1.05 + 0.01 * self.等级, 5)
        else:
            return round(1.15 + 0.02 * (self.等级-10), 5)

class 混沌行者技能1(被动技能):
    名称 = '乖离虚无'
    所在等级 = 15
    等级上限 = 20
    基础等级 = 10
    关联技能 = ['次元虚影', '次元跃迁', '次元离子束', '次元坠落', '次元万花镜', '次元粒子风暴', '次元时空磁场', '次元粒子波', '次元思维聚爆(瞬爆)', '次元奇点', '禁断之盛宴'] #次元系技能
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1. + 0.015 * self.等级, 5)

class 混沌行者技能2(被动技能):
    名称 = '虚空之力'
    所在等级 = 48
    等级上限 = 40
    基础等级 = 20

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.025 + 0.02 * self.等级, 5)

class 混沌行者技能3(被动技能):
    名称 = '混沌源能石'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 11

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.17 + 0.02 * self.等级, 5)

class 混沌行者技能4(被动技能):
    名称 = '卓越之力'
    所在等级 = 95
    等级上限 = 40
    基础等级 = 4

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.18 + 0.02 * self.等级, 5)

class 混沌行者技能5(被动技能):
    名称 = '超卓之心'
    所在等级 = 95
    等级上限 = 11
    基础等级 = 1

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.045 + 0.005 * self.等级, 5)

class 混沌行者技能6(被动技能):
    名称 = '觉醒之抉择'
    所在等级 = 100
    等级上限 = 40
    基础等级 = 2
    关联技能 = ['无']

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.10 + 0.05 * self.等级, 5)

class 混沌行者技能7(主动技能):
    名称 = '次元跃迁'
    所在等级 = 20
    等级上限 = 30
    基础等级 = 1
    基础 = 4154.954
    成长 = 788.050
    CD = 15.0

class 混沌行者技能8(主动技能):
    名称 = '次元虚影'
    所在等级 = 20
    等级上限 = 60
    基础等级 = 1
    基础 = 2371.133
    成长 = 267.834
    TP成长 = 0.10
    TP上限 = 5
    CD = 5.0

class 混沌行者技能9(主动技能):
    名称 = '乖离禁忌的奈雅丽(近战普攻)'
    所在等级 = 20
    等级上限 = 60
    基础等级 = 5
    基础 = 729.662
    成长 = 82.356
    CD = 60.
    TP成长 = 0.10
    TP上限 = 5
    关联技能 = ["所有"]
    def 独立攻击力倍率进图(self, 武器类型):
        return 1.10
    def 加成倍率(self, 武器类型):
        return 1.10

class 混沌行者技能10(主动技能):
    名称 = '次元离子束'
    所在等级 = 25
    等级上限 = 60
    基础等级 = 41
    # 不强化
    基础 = 3169.986
    成长 = 357.901
    攻击次数 = 1 # 实际是六次，倍率已经乘6了
    # 强化
    基础2 = 4105.465
    成长2 = 463.549
    攻击次数2 = 1
    TP成长 = 0.10
    TP上限 = 5
    CD = 7.

class 混沌行者技能11(主动技能):
    名称 = '次元坠落'
    所在等级 = 15
    等级上限 = 60
    基础等级 = 1
    # 基础伤害
    基础 = 1549.886
    成长 = 175.090
    攻击次数 = 1
    # 30%概率触发箱子，额外伤害
    基础2 = 1509.534
    成长2 = 170.466
    攻击次数2 = 1
    TP成长 = 0.08
    TP上限 = 5
    CD = 4.

class 混沌行者技能12(主动技能):
    名称 = '次元万花镜'
    所在等级 = 30
    等级上限 = 60
    基础等级 = 38
    # 不强化
    基础 = 1616.371
    成长 = 182.596
    攻击次数 = 4
    # 强化
    基础2 = 1297.444
    成长2 = 146.593
    攻击次数2 = 4
    TP成长 = 0.10
    TP上限 = 5
    CD = 12.

class 混沌行者技能13(主动技能):
    名称 = '乖离魅魔之舞'
    所在等级 = 30
    等级上限 = 60
    基础等级 = 38
    # 不强化
    基础 = 5470.737
    成长 = 617.995
    攻击次数 = 1 # 实际次数已经在倍率中算过了
    CD = 10.
    TP成长 = 0.10
    TP上限 = 5

class 混沌行者技能14(主动技能):
    名称 = '次元粒子风暴'
    所在等级 = 35
    等级上限 = 60
    基础等级 = 36
    # 不强化
    基础 = 2314.648
    成长 = 261.315
    攻击次数 = 3
    # 强化
    基础2 = 8863.268
    成长2 = 1000.770
    攻击次数2 = 1
    CD = 16.
    是否有护石 = 1
    TP成长 = 0.10
    TP上限 = 5
    def 装备护石(self):
        self.倍率 *= 1.22

class 混沌行者技能15(主动技能):
    名称 = '次元时空磁场'
    所在等级 = 35
    等级上限 = 60
    基础等级 = 36
    基础 = 3092.684
    成长 = 349.684
    攻击次数 = 2
    TP成长 = 0.10
    TP上限 = 5
    CD = 15.

class 混沌行者技能16(主动技能):
    名称 = '乖离异界蜂群'
    所在等级 = 40
    等级上限 = 60
    基础等级 = 33
    基础 = 13606.954
    成长 = 1539.337
    攻击次数 = 1
    CD = 25.
    是否有护石 = 1
    TP成长 = 0.10
    TP上限 = 5
    def 装备护石(self):
        self.倍率 *= 1.141
        self.倍率 *= 1.06

class 混沌行者技能17(主动技能):
    名称 = '次元粒子波'
    所在等级 = 45
    等级上限 = 60
    基础等级 = 31
    # 一类裂隙
    基础 = 868.110
    成长 = 97.900
    攻击次数 = 10
    # 二类裂隙
    基础2 = 622.557
    成长2 = 70.401
    攻击次数2 = 10
    CD = 40.
    是否有护石 = 1
    TP成长 = 0.10
    TP上限 = 5
    def 装备护石(self):
        self.倍率 *= 1.11
        self.倍率 *= 1.10

class 混沌行者技能18(主动技能):
    名称 = '乖离扭曲之恐惧'
    所在等级 = 50
    等级上限 = 40
    基础等级 = 12
    # 出现
    基础 = 4458.014
    成长 = 1345.666
    攻击次数 = 1
    # 触须
    基础2 = 968.875
    成长2 = 292.508
    攻击次数2 = 22
    # 结束爆发
    基础3 = 17829.336 *1.1
    成长3 = 5382.970 *1.1
    攻击次数3 = 1  #
    CD = 145.

class 混沌行者技能19(主动技能):
    名称 = '禁断之盛宴'
    所在等级 = 85
    等级上限 = 40
    基础等级 = 5
    # 不强化
    基础 = 91799.572 # 10次迷雾伤害和13次炮击伤害
    成长 = 27720.086
    攻击次数 = 1
    # 强化后公共伤害部分
    基础2 = 114463.319
    成长2 = 34554.191  # 18次强化炮击+1次终结伤害
    攻击次数2 = 1
    # 强化后可取消的部分
    基础3 = 2142.825
    成长3 = 646.026
    攻击次数3 = 10  # 10次普通炮击
    CD = 180.

class 混沌行者技能20(主动技能):
    名称 = '次元思维聚爆(瞬爆)'
    所在等级 = 60
    等级上限 = 40
    基础等级 = 23
    # 持续伤害
    基础 = 451.063
    成长 = 50.909
    攻击次数 = 1
    # 爆发伤害
    基础2 = 14580.815
    成长2 = 1646.227
    攻击次数2 = 1
    CD = 30.
    是否有护石 = 1
    TP成长 = 0.10
    TP上限 = 5
    def 装备护石(self):
        self.基础2 *= 1.25
        self.成长2 *= 1.25

class 混沌行者技能21(主动技能):
    名称 = '次元奇点'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 16
    基础 = 6403.912
    成长 = 723.130
    攻击次数 = 4
    # 强化
    基础2 = 4268.920
    成长2 = 482.066
    攻击次数2 = 4
    CD = 40.

class 混沌行者技能22(主动技能):
    名称 = '乖离禁锢'
    所在等级 = 70
    等级上限 = 40
    基础等级 = 18
    基础 = 26846.910
    成长 = 3031.118
    攻击次数 = 1
    CD = 50.
    是否有护石 = 1
    TP成长 = 0.10
    TP上限 = 5
    def 装备护石(self):
        self.倍率 *= 1.07

class 混沌行者技能23(主动技能):
    名称 = '乖离沉沦'
    所在等级 = 80
    等级上限 = 40
    基础等级 = 13
    基础 = 32790.618
    成长 = 3702.340
    攻击次数 = 1
    基础2 = 1090.657
    成长2 = 123.333
    攻击次数2 = 24
    CD = 45.

混沌行者技能列表 = []
i = 0
while i >= 0:
    try:
        exec('混沌行者技能列表.append(混沌行者技能' + str(i) + '())')
        i += 1
    except:
        i = -1

混沌行者技能序号 = dict()
for i in range(len(混沌行者技能列表)):
    混沌行者技能序号[混沌行者技能列表[i].名称] = i

混沌行者一觉序号 = 0
混沌行者二觉序号 = 0
混沌行者三觉序号 = 0
for i in 混沌行者技能列表:
    if i.所在等级 == 50:
        混沌行者一觉序号 = 混沌行者技能序号[i.名称]
    if i.所在等级 == 85:
        混沌行者二觉序号 = 混沌行者技能序号[i.名称]
    if i.所在等级 == 100:
        混沌行者三觉序号 = 混沌行者技能序号[i.名称]

混沌行者护石选项 = ['无']
for i in 混沌行者技能列表:
    if i.是否有伤害 == 1 and i.是否有护石 == 1:
        混沌行者护石选项.append(i.名称)

混沌行者符文选项 = ['无']
for i in 混沌行者技能列表:
    if i.所在等级 >= 20 and i.所在等级 <= 80 and i.所在等级 != 50 and i.是否有伤害 == 1:
        混沌行者符文选项.append(i.名称)


class 混沌行者角色属性(角色属性):
    职业名称 = '混沌行者'

    武器选项 = ['扫把', '矛', '魔杖', '法杖','棍棒']

    # '物理百分比','魔法百分比','物理固伤','魔法固伤'
    伤害类型选择 = ['魔法固伤']

    # 默认
    伤害类型 = '魔法固伤'
    防具类型 = '布甲'
    防具精通属性 = ['智力']

    主BUFF = 1.850

    # 基础属性(含唤醒)
    基础力量 = 774.0
    基础智力 = 976.0

    # 适用系统奶加成
    力量 = 基础力量
    智力 = 基础智力

    # 人物基础 + 唤醒
    物理攻击力 = 65
    魔法攻击力 = 65
    独立攻击力 = 1045.0
    火属性强化 = 13
    冰属性强化 = 13
    光属性强化 = 13
    暗属性强化 = 13
    远古记忆 = 0

    坠落形态 = 0
    离子束形态 = 0
    万花镜形态 = 0
    粒子风暴形态 = 0
    粒子波形态 = 0
    奇点形态 = 0

    二觉形态 = 0

    def __init__(self):
        self.技能栏 = deepcopy(混沌行者技能列表)
        self.技能序号 = deepcopy(混沌行者技能序号)

    def 被动倍率计算(self):
        super().被动倍率计算()

        if self.离子束形态 == 0:
            self.技能栏[self.技能序号['次元离子束']].攻击次数 = 1
            self.技能栏[self.技能序号['次元离子束']].攻击次数2 = 0
        if self.离子束形态 == 1:
            self.技能栏[self.技能序号['次元离子束']].攻击次数 = 0
            self.技能栏[self.技能序号['次元离子束']].攻击次数2 = 1

        if self.坠落形态 == 0:
            self.技能栏[self.技能序号['次元坠落']].攻击次数 = 1
            self.技能栏[self.技能序号['次元坠落']].攻击次数2 = 0
        if self.坠落形态 == 1:
            self.技能栏[self.技能序号['次元坠落']].攻击次数 = 1
            self.技能栏[self.技能序号['次元坠落']].攻击次数2 = 1

        if self.万花镜形态 == 0:
            self.技能栏[self.技能序号['次元万花镜']].攻击次数 = 4
            self.技能栏[self.技能序号['次元万花镜']].攻击次数2 = 0
        if self.万花镜形态 == 1:
            self.技能栏[self.技能序号['次元万花镜']].攻击次数 = 0
            self.技能栏[self.技能序号['次元万花镜']].攻击次数2 = 4

        if self.粒子风暴形态 == 0:
            self.技能栏[self.技能序号['次元粒子风暴']].攻击次数 = 3
            self.技能栏[self.技能序号['次元粒子风暴']].攻击次数2 = 0
        if self.粒子风暴形态 == 1:
            self.技能栏[self.技能序号['次元粒子风暴']].攻击次数 = 0
            self.技能栏[self.技能序号['次元粒子风暴']].攻击次数2 = 1

        if self.粒子波形态 == 0:
            self.技能栏[self.技能序号['次元粒子波']].攻击次数 = 10
            self.技能栏[self.技能序号['次元粒子波']].攻击次数2 = 20
        if self.粒子波形态 == 1:
            self.技能栏[self.技能序号['次元粒子波']].攻击次数 = 0
            self.技能栏[self.技能序号['次元粒子波']].攻击次数2 = 30

        if self.奇点形态 == 0:
            self.技能栏[self.技能序号['次元奇点']].攻击次数 = 4
            self.技能栏[self.技能序号['次元奇点']].攻击次数2 = 4
        # if self.奇点形态 == 1:
        #     self.技能栏[self.技能序号['次元奇点']].攻击次数 = 4
        #     self.技能栏[self.技能序号['次元奇点']].攻击次数2 = 4

        if self.二觉形态 == 0: # 不强化
            self.技能栏[self.技能序号['禁断之盛宴']].攻击次数 = 1
            self.技能栏[self.技能序号['禁断之盛宴']].攻击次数2 = 0
            self.技能栏[self.技能序号['禁断之盛宴']].攻击次数3 = 0
        if self.二觉形态 == 1: # 强化:取消后摇
            self.技能栏[self.技能序号['禁断之盛宴']].攻击次数 = 0
            self.技能栏[self.技能序号['禁断之盛宴']].攻击次数2 = 1
            self.技能栏[self.技能序号['禁断之盛宴']].攻击次数3 = 0
        if self.二觉形态 == 2: # 强化：不取消后摇
            self.技能栏[self.技能序号['禁断之盛宴']].攻击次数 = 0
            self.技能栏[self.技能序号['禁断之盛宴']].攻击次数2 = 1
            self.技能栏[self.技能序号['禁断之盛宴']].攻击次数3 = 10

class 混沌行者(角色窗口):
    def 窗口属性输入(self):
        self.初始属性 = 混沌行者角色属性()
        self.角色属性A = 混沌行者角色属性()
        self.角色属性B = 混沌行者角色属性()
        self.一觉序号 = 混沌行者一觉序号
        self.二觉序号 = 混沌行者二觉序号
        self.三觉序号 = 混沌行者三觉序号
        self.护石选项 = deepcopy(混沌行者护石选项)
        self.符文选项 = deepcopy(混沌行者符文选项)

    def 界面(self):
        super().界面()

        self.坠落触发箱子 = QCheckBox("坠落触发箱子", self.main_frame2)
        self.坠落触发箱子.setStyleSheet(复选框样式)
        self.坠落触发箱子.setChecked(False)
        self.坠落触发箱子.resize(120, 20)
        self.坠落触发箱子.move(315, 380)

        self.离子束强化=QCheckBox("强化离子束", self.main_frame2)
        self.离子束强化.setStyleSheet(复选框样式)
        self.离子束强化.setChecked(False)
        self.离子束强化.resize(120, 20)
        self.离子束强化.move(315, 405)

        self.强化万花镜 = QCheckBox("强化万花镜", self.main_frame2)
        self.强化万花镜.setStyleSheet(复选框样式)
        self.强化万花镜.setChecked(True)
        self.强化万花镜.resize(120, 20)
        self.强化万花镜.move(315, 430)

        self.强化离子风暴 = QCheckBox("强化粒子风暴", self.main_frame2)
        self.强化离子风暴.setStyleSheet(复选框样式)
        self.强化离子风暴.setChecked(True)
        self.强化离子风暴.resize(120, 20)
        self.强化离子风暴.move(315, 455)

        self.强化粒子波 = QCheckBox("强化粒子波", self.main_frame2)
        self.强化粒子波.setStyleSheet(复选框样式)
        self.强化粒子波.setChecked(True)
        self.强化粒子波.resize(120, 20)
        self.强化粒子波.move(315, 480)

        # self.强化奇点 = QCheckBox("强化奇点", self.main_frame2)
        # self.强化奇点.setStyleSheet(复选框样式)
        # self.强化奇点.setChecked(True)
        # self.强化奇点.resize(120, 20)
        # self.强化奇点.move(315, 505)

        self.二觉形态选择 = MyQComboBox(self.main_frame2)
        self.二觉形态选择.addItem('不强化二觉')
        self.二觉形态选择.addItem('强化二觉:取消后摇')
        self.二觉形态选择.addItem('强化二觉:保留后摇')
        self.二觉形态选择.setCurrentIndex(2)
        self.二觉形态选择.resize(140, 20)
        self.二觉形态选择.move(305, 505)

    def 输入属性(self, 属性, x = 0):
        super().输入属性(属性)
        if self.坠落触发箱子.isChecked():
            属性.坠落形态 = 1
        if self.离子束强化.isChecked():
            属性.离子束形态 = 1
        if self.强化万花镜.isChecked():
            属性.万花镜形态 = 1
        if self.强化离子风暴.isChecked():
            属性.粒子风暴形态 = 1
        if self.强化粒子波.isChecked():
            属性.粒子波形态 = 1
        # if self.强化奇点.isChecked():
        #     属性.奇点形态 = 1
        属性.二觉形态 = self.二觉形态选择.currentIndex()
