from math import *
from PublicReference.base import *

# 2020.7.3 数据有待修整


# 武器战斧
class 炎狱裁决者主动技能(主动技能):
    def 等效CD(self, 武器类型):
        if 武器类型 == '战斧':
            return round(self.CD / self.恢复 * 1.1, 1)
            


# 战斧精通
class 炎狱裁决者技能0(被动技能):
    名称 = '战斧精通'
    所在等级 = 20
    等级上限 = 20
    基础等级 = 10
    
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        elif self.等级 <= 10:
            return round(1.05 + 0.01 * self.等级, 5)
        else :
            return round(0.95 + 0.02 * self.等级, 5)

    def 物理攻击力倍率(self, 武器类型):
        return self.加成倍率(武器类型)
        
# 一觉被动
class 炎狱裁决者技能1(被动技能):
    名称 = '异端烙印'
    所在等级 = 48
    等级上限 = 40
    基础等级 = 20

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.075 + 0.015 * self.等级, 5)


# 二觉被动
class 炎狱裁决者技能2(被动技能):
    名称 = '定罪法则'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 11

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.23 + 0.02 * self.等级, 5)
    关联技能2 = ['火焰精华','神焰']
    def 加成倍率2(self, 武器类型):
        if self.等级 ==0:
            return 1.0
        else:
            return(round(1.073 + 0.017 * self.等级, 5)/ self.加成倍率(武器类型))
    冷却关联技能 = ['火焰精华','神焰']
    def CD缩减倍率(self, 武器类型):
        if  self.等级 ==0:
            return 1.0
        else:
            return 0.85

# 卓越之力
class 炎狱裁决者技能3(被动技能):
    名称 = '卓越之力'
    所在等级 = 95
    等级上限 = 40
    基础等级 = 4

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.18 + 0.02 * self.等级, 5)

# 超卓之心
class 炎狱裁决者技能4(被动技能):
    名称 = '超卓之心'
    所在等级 = 95
    等级上限 = 11
    基础等级 = 1

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.045 + 0.005 * self.等级, 5)

# 觉醒之抉择
class 炎狱裁决者技能5(被动技能):
    名称 = '觉醒之抉择'
    所在等级 = 100
    等级上限 = 40
    基础等级 = 2
    关联技能 = ['无']

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.10 + 0.05 * self.等级, 5)

# 惩戒十字
class 炎狱裁决者技能6(炎狱裁决者主动技能):
    名称 = '惩戒十字'
    所在等级 = 15
    等级上限 = 60
    基础等级 = 46
    基础 = 1186 + 1779 - 120 - 180
    成长 = 300
    CD = 6
    TP成长 = 0.10
    TP上限 = 5

# 净化火焰瓶
class 炎狱裁决者技能7(炎狱裁决者主动技能):
    名称 = '净化火焰瓶'
    所在等级 = 15
    等级上限 = 60
    基础等级 = 46
    基础 = 2938 - 298
    成长 = 298
    CD = 6
    TP成长 = 0.10
    TP上限 = 5

# 裁决之击
class 炎狱裁决者技能8(炎狱裁决者主动技能):
    名称 = '裁决之击'
    所在等级 = 20
    等级上限 = 60
    基础等级 = 43
    基础 = 4420 - 448.5
    成长 = 448.5
    CD = 8
    TP成长 = 0.10
    TP上限 = 5


# 火焰精华
class 炎狱裁决者技能9(炎狱裁决者主动技能):
    名称 = '火焰精华'
    所在等级 = 20
    等级上限 = 60
    基础等级 = 29
    基础 = 4315 - 688
    成长 = 688
    CD = 8
    TP成长 = 0.10
    TP上限 = 5

# 神焰
class 炎狱裁决者技能10(炎狱裁决者主动技能):
    名称 = '神焰'
    所在等级 = 25
    等级上限 = 20
    基础等级 = 10
    基础 = 6966 -1615.5
    成长 = 1615.5
    CD = 10
    TP成长 = 0.20
    TP上限 = 1
    关联技能 = ['所有']

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        elif self.等级 <= 10:
            return round(1.05 + 0.01 * self.等级, 2)
        else:
            return round(1.15 + 0.02 * (self.等级 - 10), 2)

# 审判重击
class 炎狱裁决者技能11(炎狱裁决者主动技能):
    名称 = '审判重击'
    所在等级 = 30
    等级上限 = 60
    基础等级 = 38
    基础 = 2847 + 2786 - 289 - 282.5
    成长 = 289 + 282.5
    CD = 10
    TP成长 = 0.10
    TP上限 = 5

# 神焰斩
class 炎狱裁决者技能12(炎狱裁决者主动技能):
    名称 = '神焰斩'
    所在等级 = 35
    等级上限 = 60
    基础等级 = 36
    
    基础 = 1209  - 123 
    成长 = 123 
    攻击次数 = 1
    
    基础2 = 10903 -1106
    成长2 = 1106
    攻击次数2 = 1
   
    CD = 20
    TP成长 = 0.10
    TP上限 = 5
    是否有护石 = 1
    技能施放时间 = 1

    def 装备护石(self):
        self.攻击次数 = 0
        self.攻击次数2 = 1.29
        self.CD *= 0.85

# 神焰洗礼
class 炎狱裁决者技能13(炎狱裁决者主动技能):
    名称 = '神焰洗礼'
    所在等级 = 35
    等级上限 = 60
    基础等级 = 36
    基础 = 9137 - 927
    成长 = 927
    CD = 15
    TP成长 = 0.10
    TP上限 = 5


# 神焰怒火
class 炎狱裁决者技能14(炎狱裁决者主动技能):
    名称 = '神焰怒火'
    所在等级 = 40
    等级上限 = 60
    基础等级 = 33

    CD = 25
    TP成长 = 0.10
    TP上限 = 5
    是否有护石 = 1


    基础 = 1670 - 169.5
    成长 = 169.5
    攻击次数 = 5

    基础2 = 5567 - 565
    成长2 = 565
    攻击次数2 = 1
    


    def 装备护石(self):
        self.CD *= 0.85
        self.攻击次数 += 2

        
# 行刑
class 炎狱裁决者技能15(炎狱裁决者主动技能):
    名称 = '行刑'
    所在等级 = 45
    等级上限 = 60
    基础等级 = 31
    基础 = 23205 -2354.5
    成长 = 2354.5
    CD = 45
    TP成长 = 0.10
    TP上限 = 5
    是否有护石 = 1
    是否装备护石 = 0

    def 装备护石(self):
        self.CD *= 0.9
        self.是否装备护石 = 1

#数据未录
# 一觉
class 炎狱裁决者技能16(炎狱裁决者主动技能):
    名称 = '火刑'
    所在等级 = 50
    等级上限 = 40
    基础等级 = 12
    #多段
    基础 = 10371 - 678 *12
    成长 = 678
    攻击次数 = 15 *1.1
    #前2
    基础2 = 9712 + 29135 - 12 *(633+1901)
    成长2 = 633 +1901
    攻击次数2 = 1
    

    CD = 145


# 神焰漩涡,最大旋转
class 炎狱裁决者技能17(炎狱裁决者主动技能):
    名称 = '神焰漩涡'
    所在等级 = 60
    等级上限 = 40
    基础等级 = 23

    CD = 25
    TP成长 = 0.10
    TP上限 = 5
    是否有护石 = 1


    基础 = 1635 - 166
    成长 = 166    
    攻击次数 = 9

    基础2 = 3451 - 350.16
    成长2 = 350.16
    攻击次数2 = 1


    def 装备护石(self):
        self.攻击次数 += 3
        self.攻击次数 *= 0.94
        self.攻击次数2 *= 1.14
        
# 净化之焰

class 炎狱裁决者技能18(炎狱裁决者主动技能):
    名称 = '净化之焰'
    所在等级 = 70
    等级上限 = 40
    基础等级 = 18
    
    基础 = 28032 - 2844
    成长 = 2844


    CD = 40
    TP成长 = 0.10
    TP上限 = 5
    是否有护石 = 1

    def 装备护石(self):
        self.倍率 *= 1.19

# 裁决轮回斩
class 炎狱裁决者技能19(炎狱裁决者主动技能):
    名称 = '裁决轮回斩'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 16
    基础 = (2858 - 290)*3 + 45518 - 4618
    成长 = 290*3+4618
    CD = 40

# 车轮刑
class 炎狱裁决者技能20(炎狱裁决者主动技能):
    名称 = '车轮刑'
    所在等级 = 80
    等级上限 = 40
    基础等级 = 13
    基础 = (1872 - 190)*26 +12016 - 1219
    成长 = 190 *26 + 1219
    CD = 45

# 二觉
class 炎狱裁决者技能21(炎狱裁决者主动技能):
    名称 = '炎狱祭坛：炮烙'
    所在等级 = 85
    等级上限 = 40
    基础等级 = 5
    基础 = (33499 - 4030*5) *3 + 150746 - 18135*5
    成长 = 4030 *3 + 18135
    CD = 180


炎狱裁决者技能列表 = []
i = 0
while i >= 0:
    try:
        exec('炎狱裁决者技能列表.append(炎狱裁决者技能' + str(i) + '())')
        i += 1
    except:
        i = -1

炎狱裁决者技能序号 = dict()
for i in range(len(炎狱裁决者技能列表)):
    炎狱裁决者技能序号[炎狱裁决者技能列表[i].名称] = i

炎狱裁决者一觉序号 = 0
炎狱裁决者二觉序号 = 0
炎狱裁决者三觉序号 = 0
for i in 炎狱裁决者技能列表:
    if i.所在等级 == 50:
        炎狱裁决者一觉序号 = 炎狱裁决者技能序号[i.名称]
    if i.所在等级 == 85:
        炎狱裁决者二觉序号 = 炎狱裁决者技能序号[i.名称]
    if i.所在等级 == 100:
        炎狱裁决者三觉序号 = 炎狱裁决者技能序号[i.名称]

炎狱裁决者护石选项 = ['无']
for i in 炎狱裁决者技能列表:
    if i.是否有伤害 == 1 and i.是否有护石 == 1:
        炎狱裁决者护石选项.append(i.名称)

炎狱裁决者符文选项 = ['无']
for i in 炎狱裁决者技能列表:
    if i.所在等级 >= 20 and i.所在等级 <= 80 and i.所在等级 != 50 and i.是否有伤害 == 1:
        炎狱裁决者符文选项.append(i.名称)


class 炎狱裁决者角色属性(角色属性):
    实际名称 = '炎狱裁决者'
    角色 = '圣职者(女)'
    职业 = '异端审判者'

    武器选项 = ['战斧']

    伤害类型选择 = ['物理百分比']

    伤害类型 = '物理百分比'
    防具类型 = '重甲'
    防具精通属性 = ['力量']

    主BUFF = 1.93
    
    def __init__(self):
        基础属性输入(self)
        self.技能栏 = deepcopy(炎狱裁决者技能列表)
        self.技能序号 = deepcopy(炎狱裁决者技能序号)

    def 被动倍率计算(self):
        super().被动倍率计算()
        self.技能栏[9].被动倍率 /= self.技能栏[10].加成倍率(self.武器类型)
        if self.技能栏[15].是否装备护石 == 1:
            self.技能栏[15].被动倍率 /= self.技能栏[10].加成倍率(self.武器类型)
            self.技能栏[15].被动倍率 *= 1 + (self.技能栏[10].加成倍率(self.武器类型) - 1) * 1.39


class 炎狱裁决者(角色窗口):
    def 窗口属性输入(self):
        self.初始属性 = 炎狱裁决者角色属性()
        self.角色属性A = 炎狱裁决者角色属性()
        self.角色属性B = 炎狱裁决者角色属性()
        self.一觉序号 = 炎狱裁决者一觉序号
        self.二觉序号 = 炎狱裁决者二觉序号
        self.三觉序号 = 炎狱裁决者三觉序号
        self.护石选项 = deepcopy(炎狱裁决者护石选项)
        self.符文选项 = deepcopy(炎狱裁决者符文选项)

