from math import *
from PublicReference.base import *

# 2020.6.20 数据有待修整
# 2020.6.22 全部使用回归方程，捷影步段数改为5段，修正枪刃乱舞护石算法
#           轮盘连射取非抓取，大回旋坠斩护石跳跃暂不考虑，致命焰火取后方射击
#           剑刃突刺、回旋飞剑实战中会因位置原因丢失段数
#           潜行射击段数随攻速加快而减少，取12段
#           全方位护石游戏内会吃同时释放的其他技能的判定导致伤害显示偏高
#           尝试对末尾取整问题进行补正，总体误差万分之1左右


# 武器长刀
class 铁血统帅主动技能(主动技能):
    def 等效CD(self, 武器类型):
        if 武器类型 == '长刀':
            return round(self.CD / self.恢复 * 1.05, 1)
            


# 长刀精通
class 铁血统帅技能0(被动技能):
    名称 = '长刀精通'
    所在等级 = 15
    等级上限 = 20
    基础等级 = 10
    
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.05 + 0.02 * self.等级, 5)

    def 物理攻击力倍率(self, 武器类型):
        return self.加成倍率(武器类型)
        

    def CD缩减倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return 0.95

# 暗刃战略
class 铁血统帅技能1(被动技能):
    名称 = '暗刃战略'
    所在等级 = 25
    等级上限 = 20
    基础等级 = 10

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.10 + 0.02 * self.等级, 5)


# 一觉被动
class 铁血统帅技能2(被动技能):
    名称 = 'B.G枪刃改造'
    所在等级 = 48
    等级上限 = 40
    基础等级 = 20

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.025 + 0.02 * self.等级, 5)


# 二觉被动
class 铁血统帅技能3(被动技能):
    名称 = 'B.C精锐特训'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 11

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.22 + 0.02 * self.等级, 5)


# 卓越之力
class 铁血统帅技能4(被动技能):
    名称 = '卓越之力'
    所在等级 = 95
    等级上限 = 40
    基础等级 = 4

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.18 + 0.02 * self.等级, 5)


# 超卓之心
class 铁血统帅技能5(被动技能):
    名称 = '超卓之心'
    所在等级 = 95
    等级上限 = 11
    基础等级 = 1

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.045 + 0.005 * self.等级, 5)


# 觉醒之抉择
class 铁血统帅技能6(被动技能):
    名称 = '觉醒之抉择'
    所在等级 = 100
    等级上限 = 40
    基础等级 = 2
    关联技能 = ['无']

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.10 + 0.05 * self.等级, 5)

# 掩护射击
class 铁血统帅技能7(铁血统帅主动技能):
    名称 = '掩护射击'
    所在等级 = 15
    等级上限 = 60
    基础等级 = 46
    攻击段数 = 10
    基础 = 1847.755698 - 攻击段数 * 0.5
    成长 = 209.2273524
    CD = 6
    TP成长 = 0.10
    TP上限 = 7

# 捷影步
class 铁血统帅技能8(铁血统帅主动技能):
    名称 = '捷影步'
    所在等级 = 15
    等级上限 = 60
    基础等级 = 46
    攻击段数 = 5
    基础 = 1658.836937
    成长 = 187.6461134
    CD = 5
    TP成长 = 0.10
    TP上限 = 7

# 轮盘连射，非抓取
class 铁血统帅技能9(铁血统帅主动技能):
    名称 = '轮盘连射'
    所在等级 = 20
    等级上限 = 60
    基础等级 = 43
    攻击段数 = 2
    基础 = 3029.19026 - 攻击段数 * 0.5
    成长 = 342.1142515
    CD = 8
    TP成长 = 0.10
    TP上限 = 7


# 剑刃突刺
class 铁血统帅技能10(铁血统帅主动技能):
    名称 = '剑刃突刺'
    所在等级 = 20
    等级上限 = 60
    基础等级 = 43
    攻击段数 = 8
    基础 = 2270.46039 - 攻击段数 * 0.5
    成长 = 258.1335954
    CD = 6
    TP成长 = 0.10
    TP上限 = 7

# 潜行射击
class 铁血统帅技能11(铁血统帅主动技能):
    名称 = '潜行射击'
    所在等级 = 25
    等级上限 = 60
    基础等级 = 41
    攻击段数 = 15
    基础 = (2709.696017 - 攻击段数 * 0.5 ) * 0.8
    成长 = 307.081761 * 0.8#游戏中攻速越高攻击段数越低，取本人60%-90%攻速时大致为12/15
    CD = 7
    TP成长 = 0.10
    TP上限 = 7
    
# 利刃旋斩
class 铁血统帅技能12(铁血统帅主动技能):
    名称 = '利刃旋斩'
    所在等级 = 25
    等级上限 = 60
    基础等级 = 41
    攻击段数 = 8
    基础 = 2730.212439 - 攻击段数 * 0.5
    成长 = 308.7161807
    CD = 7
    TP成长 = 0.10
    TP上限 = 7

# 游弹枪袭
class 铁血统帅技能13(铁血统帅主动技能):
    名称 = '游弹枪袭'
    所在等级 = 30
    等级上限 = 60
    基础等级 = 38
    攻击段数 = 30
    基础 = 3624.235294 - 攻击段数 * 0.5
    成长 = 411.4886878
    CD = 8
    TP成长 = 0.10
    TP上限 = 7

# 全方位射击
class 铁血统帅技能14(铁血统帅主动技能):
    名称 = '全方位射击'
    所在等级 = 35
    等级上限 = 60
    基础等级 = 36
    
    基础 = 253.6930612 - 0.5
    成长 = 28.71635054
    攻击次数 = 15
    
    基础2 = 423.2865306 - 0.5
    成长2 = 47.85935174
    攻击次数2 = 6
   
    CD = 15
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1
    技能施放时间 = 1

    def 装备护石(self):
        self.攻击次数2 = 0
        self.攻击次数 = 20
        self.倍率 = self.倍率 * 1.27 * 1.07
        self.CD *= 0.95

# 回旋飞剑
class 铁血统帅技能15(铁血统帅主动技能):
    名称 = '回旋飞剑'
    所在等级 = 35
    等级上限 = 60
    基础等级 = 36
    攻击段数 = 14
    基础 = 7642.573878 + 攻击段数 * 0.5
    成长 = 863.4943577
    CD = 20
    TP成长 = 0.10
    TP上限 = 7


# 枪刃乱舞
class 铁血统帅技能16(铁血统帅主动技能):
    名称 = '枪刃乱舞'
    所在等级 = 40
    等级上限 = 60
    基础等级 = 33

    CD = 25
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1


    基础 = 285.9777983 - 0.5
    成长 = 32.3413506
    攻击次数 = 10

    基础2 = 197.4236818 - 0.5
    成长2 = 22.34227567
    攻击次数2 = 15
    
    基础3 = 3738.310823 - 0.5
    成长3 = 422.1492831
    攻击次数3 = 1
    

    def 装备护石(self):
        self.CD *= 0.80#加算
        self.攻击次数3 *= 1.27
        self.攻击次数 *= 1.07
        self.攻击次数2 *= 1.07
        
# 血光斩
class 铁血统帅技能17(铁血统帅主动技能):
    名称 = '血光斩'
    所在等级 = 45
    等级上限 = 60
    基础等级 = 31
    攻击段数 = 1
    基础 = 14496.06087 - 0.5
    成长 = 1636.743941
    CD = 45
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1

    def 装备护石(self):
        self.倍率 *= 1.25#加算


# 一觉
class 铁血统帅技能18(铁血统帅主动技能):
    名称 = '电光飞掠'
    所在等级 = 50
    等级上限 = 40
    基础等级 = 12
    攻击段数 = 29
    基础 = 34891.02857 - 攻击段数 * 0.5
    成长 = 10539.71429
    CD = 145


# 近敌灭杀
class 铁血统帅技能19(铁血统帅主动技能):
    名称 = '近敌灭杀'
    所在等级 = 60
    等级上限 = 40
    基础等级 = 23

    CD = 25
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1


    基础 = 5288.051613 - 0.5
    成长 = 597.1358871
    攻击次数 = 1

    基础2 = 396.1870968 - 0.5
    成长2 = 44.7766129
    攻击次数2 = 20


    def 装备护石(self):
        self.CD *= 0.85
        self.攻击次数2 *= ( 1 + 0.35 * 1.2 )
        
# 大回旋坠斩，护石暂不考虑跳跃

class 铁血统帅技能20(铁血统帅主动技能):
    名称 = '大回旋坠斩'
    所在等级 = 70
    等级上限 = 40
    基础等级 = 18
    
    基础 = 795.9230769 + 832.6695157 - 1
    成长 = 90.02136752 + 94.03418803
    攻击次数 = 10

    基础2 = 6902.951567 - 0.5
    成长2 = 779.4108669
    攻击次数2 = 1

    CD = 50
    TP成长 = 0.10
    TP上限 = 7
    是否有护石 = 1

    def 装备护石(self):
        self.攻击次数 += 1
        self.倍率 *= 1.16

# 致命焰火，取后方射击
class 铁血统帅技能21(铁血统帅主动技能):
    名称 = '致命焰火'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 16
    攻击段数 = 25
    基础 = 38280.86957 - 攻击段数 * 0.5
    成长 = 4321.793478
    CD = 40

# 碧波瞬斩
class 铁血统帅技能22(铁血统帅主动技能):
    名称 = '碧波瞬斩'
    所在等级 = 80
    等级上限 = 40
    基础等级 = 13
    攻击段数 = 3
    基础 = 45399.56842 - 攻击段数 * 0.5
    成长 = 5125.574436
    CD = 50

# 二觉
class 铁血统帅技能23(铁血统帅主动技能):
    名称 = '集结·暮光之翼'
    所在等级 = 85
    等级上限 = 40
    基础等级 = 5
    攻击段数 = 36
    基础 = 81504.02778 - 攻击段数 * 0.5
    成长 = 24603.08333
    CD = 180


铁血统帅技能列表 = []
i = 0
while i >= 0:
    try:
        exec('铁血统帅技能列表.append(铁血统帅技能' + str(i) + '())')
        i += 1
    except:
        i = -1

铁血统帅技能序号 = dict()
for i in range(len(铁血统帅技能列表)):
    铁血统帅技能序号[铁血统帅技能列表[i].名称] = i

铁血统帅一觉序号 = 0
铁血统帅二觉序号 = 0
铁血统帅三觉序号 = 0
for i in 铁血统帅技能列表:
    if i.所在等级 == 50:
        铁血统帅一觉序号 = 铁血统帅技能序号[i.名称]
    if i.所在等级 == 85:
        铁血统帅二觉序号 = 铁血统帅技能序号[i.名称]
    if i.所在等级 == 100:
        铁血统帅三觉序号 = 铁血统帅技能序号[i.名称]

铁血统帅护石选项 = ['无']
for i in 铁血统帅技能列表:
    if i.是否有伤害 == 1 and i.是否有护石 == 1:
        铁血统帅护石选项.append(i.名称)

铁血统帅符文选项 = ['无']
for i in 铁血统帅技能列表:
    if i.所在等级 >= 20 and i.所在等级 <= 80 and i.所在等级 != 50 and i.是否有伤害 == 1:
        铁血统帅符文选项.append(i.名称)


class 铁血统帅角色属性(角色属性):
    职业名称 = '铁血统帅'

    武器选项 = ['长刀']

    # '物理百分比','魔法百分比','物理固伤','魔法固伤'
    伤害类型选择 = ['物理百分比']

    # 默认
    伤害类型 = '物理百分比'
    防具类型 = '轻甲'
    防具精通属性 = ['力量']

    主BUFF = 1.85
    
    # 基础属性(含唤醒)
    基础力量 = 963
    基础智力 = 788

    # 适用系统奶加成
    力量 = 基础力量
    智力 = 基础智力

    # 人物基础 + 唤醒
    物理攻击力 = 65.0
    魔法攻击力 = 65.0
    独立攻击力 = 1045
    火属性强化 = 13
    冰属性强化 = 13
    光属性强化 = 13
    暗属性强化 = 13

    def __init__(self):
        self.技能栏 = deepcopy(铁血统帅技能列表)
        self.技能序号 = deepcopy(铁血统帅技能序号)

    def 被动倍率计算(self):
        super().被动倍率计算()

class 铁血统帅(角色窗口):
    def 窗口属性输入(self):
        self.初始属性 = 铁血统帅角色属性()
        self.角色属性A = 铁血统帅角色属性()
        self.角色属性B = 铁血统帅角色属性()
        self.一觉序号 = 铁血统帅一觉序号
        self.二觉序号 = 铁血统帅二觉序号
        self.三觉序号 = 铁血统帅三觉序号
        self.护石选项 = deepcopy(铁血统帅护石选项)
        self.符文选项 = deepcopy(铁血统帅符文选项)

