from PublicReference.base import *

风暴骑兵等级 = 100 + 5

class 风暴骑兵技能0(主动技能):
    名称 = 'M3喷火器'
    所在等级 = 15
    等级上限 = 60
    学习间隔 = 2
    等级精通 = 50
    基础等级 = min(int((风暴骑兵等级 - 所在等级) / 学习间隔 + 1), 等级精通) + 1
    数据 = [0, 207, 228, 250, 270, 291, 313, 333, 355, 376, 396, 418, 439, 460, 481, 502, 523, 544, 566, 586, 607, 629, 649, 671, 692, 712, 734, 755, 776, 797, 818, 839, 860, 882, 902, 923, 945, 965, 987, 1008, 1028, 1050, 1071, 1092, 1113, 1134, 1155, 1176, 1198, 1218, 1239, 1261, 1281, 1303, 1324, 1344, 1366, 1387, 1408, 1429, 1450]
    攻击次数 = 14
    CD = 7.0
    TP成长 = 0.08
    TP上限 = 7
    def 等效百分比(self, 武器类型):
        return self.数据[self.等级] * (self.攻击次数 + (1 if self.TP等级 >= 5 else 0)) * (1 + self.TP成长 * self.TP等级) * self.倍率

class 风暴骑兵技能1(被动技能):
    名称 = '重火器精通'
    所在等级 = 15
    等级上限 = 20
    基础等级 = 10
    关联技能 = ['所有']
    关联技能2 = ['所有']
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1 + 0.02 * self.等级, 5)

    def 加成倍率2(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1 + 0.01 * self.等级, 5)

    def 物理攻击力倍率(self, 武器类型):
        return self.加成倍率2(武器类型)


class 风暴骑兵技能2(主动技能):
    名称 = '加农炮'
    所在等级 = 20
    等级上限 = 60
    学习间隔 = 2
    等级精通 = 50
    基础等级 = min(int((风暴骑兵等级 - 所在等级) / 学习间隔 + 1), 等级精通) + 1
    数据 = [0, 1048, 1154, 1261, 1367, 1473, 1580, 1686, 1793, 1899, 2005, 2112, 2218, 2325, 2431, 2537, 2644, 2750, 2857, 2963, 3068, 3176, 3281, 3388, 3494, 3600, 3707, 3813, 3920, 4026, 4132, 4239, 4345, 4452, 4558, 4664, 4771, 4877, 4984, 5090, 5196, 5303, 5409, 5516, 5622, 5728, 5835, 5941, 6047, 6154, 6260, 6367, 6473, 6579, 6686, 6792, 6898, 7005, 7111, 7217, 7324]
    CD = 5.0
    TP成长 = 0.10
    TP上限 = 7
    def 等效百分比(self, 武器类型):
        return self.数据[self.等级] * 2 * (1 + self.TP成长 * self.TP等级) * self.倍率


class 风暴骑兵技能3(主动技能):
    名称 = '反坦克炮'
    所在等级 = 20
    等级上限 = 60
    学习间隔 = 2
    等级精通 = 50
    基础等级 = min(int((风暴骑兵等级 - 所在等级) / 学习间隔 + 1), 等级精通) + 1
    数据1 = [0, 137, 150, 164, 179, 192, 206, 219, 233, 248, 261, 275, 289, 303, 317, 331, 344, 358, 373, 386, 400, 414, 428, 442, 456, 469, 484, 498, 511, 525, 539, 553, 567, 581, 594, 609, 623, 636, 650, 664, 678, 692, 706, 719, 734, 748, 761, 775, 789, 803, 817, 831, 845, 859, 872, 886, 900, 914, 928, 942, 956]
    数据2 = [0, 714, 786, 859, 932, 1005, 1077, 1150, 1222, 1295, 1367, 1440, 1512, 1584, 1657, 1729, 1802, 1874, 1947, 2020, 2093, 2165, 2238, 2310, 2382, 2455, 2527, 2600, 2672, 2745, 2817, 2890, 2962, 3035, 3108, 3180, 3253, 3325, 3398, 3470, 3543, 3615, 3688, 3760, 3833, 3905, 3977, 4050, 4123, 4196, 4268, 4341, 4413, 4486, 4558, 4631, 4703, 4776, 4848, 4921, 4993]
    CD = 6.0
    TP成长 = 0.10
    TP上限 = 7
    def 等效百分比(self, 武器类型):
        return (self.数据1[self.等级] + self.数据2[self.等级] * 3) * (1 + self.TP成长 * self.TP等级) * self.倍率

class 风暴骑兵技能4(被动技能):
    名称 = 'APG63'
    所在等级 = 25
    等级上限 = 20
    基础等级 = 10

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.14 + 0.01 * self.等级, 5)

    def 物理攻击力倍率(self, 武器类型):
        return self.加成倍率(武器类型)


class 风暴骑兵技能5(主动技能):
    名称 = '激光炮'
    所在等级 = 25
    等级上限 = 60
    学习间隔 = 2
    等级精通 = 50
    基础等级 = min(int((风暴骑兵等级 - 所在等级) / 学习间隔 + 1), 等级精通) + 1
    数据 = [0, 2541, 2800, 3057, 3315, 3572, 3831, 4089, 4346, 4605, 4863, 5120, 5378, 5636, 5894, 6152, 6409, 6668, 6925, 7183, 7442, 7699, 7957, 8214, 8473, 8731, 8988, 9246, 9504, 9762, 10020, 10277, 10536, 10793, 11051, 11310, 11567, 11825, 12083, 12341, 12599, 12856, 13114, 13373, 13630, 13888, 14146, 14404, 14662, 14919, 15177, 15435, 15693, 15951, 16209, 16467, 16725, 16983, 17240, 17498, 17756]
    CD = 7.0
    TP成长 = 0.10
    TP上限 = 7
    def 等效百分比(self, 武器类型):
        return self.数据[self.等级] * (1 + self.TP成长 * self.TP等级) * self.倍率

class 风暴骑兵技能6(被动技能):
    名称 = '蓄电激光炮'
    所在等级 = 25
    等级上限 = 11
    基础等级 = 1
    关联技能 = ['激光炮']

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.25+0.05 * self.等级, 5)

class 风暴骑兵技能7(主动技能):
    名称 = '聚焦喷火器'
    所在等级 = 30
    等级上限 = 60
    学习间隔 = 2
    等级精通 = 50
    基础等级 = min(int((风暴骑兵等级 - 所在等级) / 学习间隔 + 1), 等级精通) + 1
    数据 = [0, 199, 219, 240, 260, 280, 300, 321, 341, 361, 381, 402, 422, 442, 462, 483, 503, 523, 543, 564, 584, 604, 624, 645, 665, 685, 705, 726, 746, 766, 786, 807, 827, 847, 867, 888, 908, 928, 948, 969, 989, 1009, 1029, 1050, 1070, 1090, 1110, 1131, 1151, 1171, 1191, 1212, 1232, 1252, 1272, 1293, 1313, 1333, 1353, 1374, 1394]
    攻击次数 = 29
    CD = 12.0
    TP成长 = 0.10
    TP上限 = 7
    def 等效百分比(self, 武器类型):
        return self.数据[self.等级] * self.攻击次数 * (1 + self.TP成长 * self.TP等级) * self.倍率

class 风暴骑兵技能8(主动技能):
    名称 = 'FM31榴弹发射器'
    所在等级 = 35
    等级上限 = 60
    学习间隔 = 2
    等级精通 = 50
    基础等级 = min(int((风暴骑兵等级 - 所在等级) / 学习间隔 + 1), 等级精通) + 1
    数据 = [0, 819, 903, 985, 1068, 1151, 1235, 1318, 1402, 1484, 1567, 1650, 1734, 1817, 1901, 1983, 2066, 2149, 2233, 2316, 2400, 2482, 2565, 2648, 2732, 2815, 2899, 2981, 3064, 3147, 3231, 3314, 3397, 3480, 3563, 3646, 3730, 3813, 3896, 3979, 4062, 4145, 4229, 4311, 4395, 4478, 4561, 4644, 4728, 4811, 4894, 4977, 5060, 5143, 5226, 5310, 5393, 5476, 5559, 5642, 5725]
    攻击次数 = 8
    CD = 15.0
    TP成长 = 0.20
    TP上限 = 1

    def 等效百分比(self, 武器类型):
        return self.数据[self.等级] * self.攻击次数 * (1 + self.TP成长 * self.TP等级) * self.倍率

    是否有护石 = 1
    def 装备护石(self):
        self.基础释放次数 = 4
        self.攻击次数 = 2
        self.倍率 *= 1.18
        self.CD *= float(4 / 15)

class 风暴骑兵技能9(主动技能):
    名称 = 'FM92mk2榴弹'
    所在等级 = 35
    等级上限 = 60
    学习间隔 = 2
    等级精通 = 50
    基础等级 = min(int((风暴骑兵等级 - 所在等级) / 学习间隔 + 1), 等级精通) + 1
    数据 = [0, 1137, 1253, 1368, 1485, 1600, 1715, 1831, 1946, 2061, 2177, 2292, 2407, 2524, 2639, 2754, 2870, 2985, 3101, 3216, 3331, 3448, 3563, 3678, 3794, 3909, 4024, 4140, 4255, 4372, 4487, 4602, 4718, 4833, 4948, 5064, 5179, 5294, 5411, 5526, 5641, 5757, 5872, 5988, 6103, 6219, 6334, 6450, 6565, 6681, 6796, 6912, 7027, 7143, 7258, 7373, 7489, 7604, 7720, 7835, 7951]
    攻击次数 = 8
    CD = 20.0
    TP成长 = 0.10
    TP上限 = 7

    def 等效百分比(self, 武器类型):
        return self.数据[self.等级] * self.攻击次数 * (1 + self.TP成长 * self.TP等级) * self.倍率

class 风暴骑兵技能10(主动技能):
    名称 = '量子爆弹'
    所在等级 = 40
    等级上限 = 60
    学习间隔 = 2
    等级精通 = 50
    基础等级 = min(int((风暴骑兵等级 - 所在等级) / 学习间隔 + 1), 等级精通) + 1
    数据1 = [0, 673, 741, 809, 878, 946, 1013, 1082, 1150, 1219, 1287, 1355, 1424, 1492, 1561, 1629, 1696, 1765, 1833, 1902, 1970, 2038, 2107, 2175, 2244, 2311, 2379, 2448, 2516, 2584, 2653, 2721, 2790, 2858, 2926, 2994, 3062, 3130, 3199, 3267, 3336, 3404, 3472, 3540, 3609, 3677, 3745, 3813, 3882, 3950, 4018, 4087, 4155, 4223, 4291, 4360, 4428, 4496, 4565, 4633, 4701]
    攻击次数1 = 1
    数据2 = [0, 7739, 8525, 9310, 10096, 10881, 11667, 12451, 13237, 14022, 14807, 15593, 16378, 17163, 17948, 18734, 19519, 20305, 21090, 21874, 22660, 23445, 24231, 25016, 25802, 26586, 27371, 28157, 28942, 29728, 30513, 31298, 32083, 32868, 33654, 34439, 35225, 36009, 36795, 37580, 38366, 39151, 39936, 40721, 41507, 42292, 43077, 43862, 44648, 45433, 46218, 47003, 47789, 48574, 49359, 50145, 50930, 51715, 52500, 53286, 54071] 
    攻击次数2 = 1

    #感电
    数据3 =[0, 10, 10, 10, 10, 10, 10, 11, 12, 12, 13, 14, 14, 15, 16, 16, 17, 18, 19, 19, 20, 21, 21, 22, 23, 23, 24, 25, 25, 26, 27, 27, 28, 29, 30, 30, 31, 32, 32, 33, 34, 34, 35, 36, 36, 37, 38, 38, 39, 40, 40, 41, 42, 42, 43, 44, 45, 45, 46, 47, 47]
    攻击次数3 = 10
    CD = 18.0
    TP成长 = 0.10
    TP上限 = 7


    def 等效百分比(self, 武器类型):
        return (self.数据1[self.等级] * self.攻击次数1 + self.数据2[self.等级] * self.攻击次数2 + self.数据3[self.等级] * self.攻击次数3) * (1 + self.TP成长 * self.TP等级) * self.倍率

    是否有护石 = 1
    def 装备护石(self):
        self.攻击次数1 = 0
        self.攻击次数2 = 0.16 * 8 * 1.07
        self.攻击次数3 *= 0.16 * 8 * 1.07
        self.CD *= 0.9

class 风暴骑兵技能11(主动技能):
    名称 = 'X1压缩量子炮'
    所在等级 = 45
    等级上限 = 60
    学习间隔 = 2
    等级精通 = 50
    基础等级 = min(int((风暴骑兵等级 - 所在等级) / 学习间隔 + 1), 等级精通) + 1
    数据 = [0, 17355, 19115, 20876, 22636, 24397, 26159, 27919, 29680, 31440, 33201, 34961, 36722, 38483, 40243, 42004, 43765, 45526, 47286, 49047, 50808, 52568, 54329, 56089, 57850, 59612, 61372, 63133, 64893, 66654, 68414, 70175, 71935, 73696, 75457, 77218, 78979, 80739, 82500, 84261, 86021, 87782, 89543, 91303, 93064, 94825, 96585, 98346, 100107, 101867, 103628, 105389, 107149, 108910, 110671, 112431, 114192, 115953, 117713, 119474, 121235]
    CD = 45.0
    TP成长 = 0.10
    TP上限 = 7

    def 等效百分比(self, 武器类型):
        return self.数据[self.等级] * (1 + self.TP成长 * self.TP等级) * self.倍率

    是否有护石 = 1
    def 装备护石(self):
        self.倍率 *= 1.1
        self.CD *= 0.88

class 风暴骑兵技能12(被动技能):
    名称 = '超温重火器'
    所在等级 = 48
    等级上限 = 40
    学习间隔 = 3
    等级精通 = 30
    基础等级 = min(int((风暴骑兵等级 - 所在等级) / 学习间隔 + 1), 等级精通)

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.04 + 0.02 * self.等级, 5)

class 风暴骑兵技能13(主动技能):
    名称 = '远古粒子炮'
    所在等级 = 50
    等级上限 = 40
    学习间隔 = 5
    等级精通 = 30
    基础等级 = min(int((风暴骑兵等级 - 所在等级) / 学习间隔 + 1), 等级精通)
    数据1 = [0, 4615, 5685, 6755, 7826, 8896, 9966, 11036, 12106, 13176, 14247, 15317, 16387, 17457, 18527, 19598, 20668, 21738, 22808, 23878, 24948, 26019, 27089, 28159, 29229, 30299, 31370, 32440, 33510, 34580, 35650, 36720, 37791, 38861, 39931, 41001, 42071, 43142, 44212, 45282, 46352]
    攻击次数1 = 0
    数据2 = [0, 5364, 6609, 7853, 9098, 10342, 11587, 12831, 14076, 15320, 16565, 17809, 19054, 20298, 21543, 22787, 24032, 25276, 26521, 27765, 29010, 30254, 31499, 32743, 33988, 35232, 36477, 37721, 38966, 40210, 41455, 42699, 43944, 45188, 46432, 47677, 48921, 50166, 51410, 52655, 53899]
    攻击次数2 = 10
    CD = 159.5
    def 等效百分比(self, 武器类型):
        return (self.数据1[self.等级] * self.攻击次数1 + self.数据2[self.等级] * self.攻击次数2) * (1 + self.TP成长 * self.TP等级) * self.倍率

class 风暴骑兵技能14(主动技能):
    名称 = '等离子放射器'
    所在等级 = 60
    等级上限 = 40
    学习间隔 = 2
    等级精通 = 30
    基础等级 = min(int((风暴骑兵等级 - 所在等级) / 学习间隔 + 1), 等级精通) + 1
    数据 = [0, 411, 452, 494, 536, 577, 619, 660, 702, 744, 785, 827, 869, 910, 952, 994, 1035, 1077, 1119, 1160, 1202, 1244, 1285, 1327, 1369, 1410, 1452, 1494, 1535, 1577, 1618, 1660, 1702, 1743, 1785, 1827, 1868, 1910, 1952, 1993, 2035]
    攻击次数 = 37
    CD = 30.0
    TP成长 = 0.10
    TP上限 = 7

    def 等效百分比(self, 武器类型):
        return self.数据[self.等级] * self.攻击次数 * (1 + self.TP成长 * self.TP等级) * self.倍率

    是否有护石 = 1
    def 装备护石(self):
        self.倍率 *= 0.85
        self.CD *= 0.60

class 风暴骑兵技能15(主动技能):
    名称 = 'FM92mk2SW榴弹'
    所在等级 = 70
    等级上限 = 40
    学习间隔 = 2
    等级精通 = 30
    基础等级 = min(int((风暴骑兵等级 - 所在等级) / 学习间隔 + 1), 等级精通) + 1
    数据 = [0, 29853, 32880, 35920, 38944, 41968, 45016, 48032, 51056, 54104, 57120, 60144, 63192, 66208, 69256, 72280, 75296, 78344, 81368, 84384, 87432, 90456, 93487, 96517, 99547, 102577, 105607, 108637, 111667, 114697, 117727, 120757, 123787, 126818, 129848, 132878, 135908, 138938, 141969, 144999, 148029]
    CD = 50.0
    TP成长 = 0.10
    TP上限 = 7

    def 等效百分比(self, 武器类型):
        return self.数据[self.等级] * (1 + self.TP成长 * self.TP等级) * self.倍率

    是否有护石 = 1
    def 装备护石(self):
        self.倍率 *= 1.19
        self.CD *= 0.9

class 风暴骑兵技能16(被动技能):
    名称 = '重武装改造'
    所在等级 = 75
    等级上限 = 40
    学习间隔 = 3
    等级精通 = 30
    基础等级 = min(int((风暴骑兵等级 - 所在等级) / 学习间隔 + 1), 等级精通)

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.23 + 0.02 * self.等级, 5)

class 风暴骑兵技能17(主动技能):
    名称 = 'FSC7'
    所在等级 = 75
    等级上限 = 40
    学习间隔 = 2
    等级精通 = 30
    基础等级 = min(int((风暴骑兵等级 - 所在等级) / 学习间隔 + 1), 等级精通) + 1
    数据1 = [0, 2020, 2226, 2431, 2635, 2840, 3046, 3250, 3455, 3660, 3865, 4070, 4274, 4480, 4686, 4890, 5095, 5300, 5505, 5710, 5915, 6120, 6325, 6530, 6735, 6940, 7145, 7350, 7555, 7760, 7965, 8170, 8375, 8579, 8784, 8989, 9194, 9399, 9604, 9809, 10014]
    攻击次数1 = 1
    数据2 = [0, 3839, 4229, 4618, 5007, 5396, 5786, 6176, 6565, 6955, 7344, 7735, 8123, 8512, 8902, 9291, 9682, 10071, 10461, 10849, 11239, 11629, 12018, 12408, 12797, 13187, 13576, 13966, 14355, 14745, 15134, 15524, 15913, 16303, 16692, 17082, 17471, 17861, 18250, 18640, 19029]
    攻击次数2 = 10
    CD = 40.0
    def 等效百分比(self, 武器类型):
        return (self.数据1[self.等级] * self.攻击次数1 + self.数据2[self.等级] * self.攻击次数2) * (1 + self.TP成长 * self.TP等级) * self.倍率

class 风暴骑兵技能18(主动技能):
    名称 = 'PT15原始型压缩炮'
    备注 = '(向前)'
    所在等级 = 80
    等级上限 = 40
    学习间隔 = 2
    等级精通 = 30
    基础等级 = min(int((风暴骑兵等级 - 所在等级) / 学习间隔 + 1), 等级精通) + 1
    数据 = [0, 50432, 55548, 60664, 65781, 70896, 76013, 81130, 86246, 91362, 96478, 101595, 106710, 111827, 116944, 122060, 127176, 132292, 137409, 142525, 147641, 152758, 157874, 162990, 168106, 173223, 178339, 183455, 188572, 193688, 198804, 203920, 209037, 214153, 219269, 224386, 229502, 234618, 239734, 244851, 249967]
    CD = 45.0

    def 等效百分比(self, 武器类型):
        return self.数据[self.等级] * (1 + self.TP成长 * self.TP等级) * self.倍率

class 风暴骑兵技能19(主动技能):
    名称 = '火力全开'
    所在等级 = 85
    等级上限 = 40
    学习间隔 = 5
    等级精通 = 30
    基础等级 = min(int((风暴骑兵等级 - 所在等级) / 学习间隔 + 1), 等级精通)
    数据 = [0, 124535, 153451, 182368, 211285, 240201, 269081, 298034, 326951, 355867, 384784, 413700, 442617, 471533, 500450, 529366, 558283, 587199, 616116, 645032, 673949, 702865, 731782, 760699, 789615, 818532, 847448, 876365, 905281, 934198, 963114, 992031, 1020947, 1049864, 1078780, 1107697, 1136613, 1165530, 1194446, 1223363, 1252279]
    CD = 198.0

    def 等效百分比(self, 武器类型):
        return self.数据[self.等级] * (1 + self.TP成长 * self.TP等级) * self.倍率

class 风暴骑兵技能20(被动技能):
    名称 = '卓越之力'
    所在等级 = 95
    等级上限 = 40
    学习间隔 = 3
    等级精通 = 30
    基础等级 = min(int((风暴骑兵等级 - 所在等级) / 学习间隔 + 1), 等级精通)

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.18 + 0.02 * self.等级, 5)

class 风暴骑兵技能21(被动技能):
    名称 = '超卓之心'
    所在等级 = 95
    等级上限 = 11
    学习间隔 = 2
    等级精通 = 1
    基础等级 = min(int((风暴骑兵等级 - 所在等级) / 学习间隔 + 1), 等级精通)

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.045 + 0.005 * self.等级, 5)

class 风暴骑兵技能22(被动技能):
    名称 = '觉醒之抉择'
    所在等级 = 100
    等级上限 = 40
    学习间隔 = 5
    等级精通 = 30
    基础等级 = min(int((风暴骑兵等级 - 所在等级) / 学习间隔 + 1), 等级精通)
    关联技能 = ['无']

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.10 + 0.05 * self.等级, 5)

风暴骑兵技能列表 = []
i = 0
while i >= 0:
    try:
        exec('风暴骑兵技能列表.append(风暴骑兵技能'+str(i)+'())')
        i += 1
    except:
        i = -1

风暴骑兵技能序号 = dict()
for i in range(len(风暴骑兵技能列表)):
    风暴骑兵技能序号[风暴骑兵技能列表[i].名称] = i

风暴骑兵一觉序号 = 0
风暴骑兵二觉序号 = 0
风暴骑兵三觉序号 = 0
for i in 风暴骑兵技能列表:
    if i.所在等级 == 50:
        风暴骑兵一觉序号 = 风暴骑兵技能序号[i.名称]
    if i.所在等级 == 85:
        风暴骑兵二觉序号 = 风暴骑兵技能序号[i.名称]
    if i.所在等级 == 100:
        风暴骑兵三觉序号 = 风暴骑兵技能序号[i.名称]

风暴骑兵护石选项 = ['无']
for i in 风暴骑兵技能列表:
    if i.是否有伤害 == 1 and i.是否有护石 == 1:
        风暴骑兵护石选项.append(i.名称)

风暴骑兵符文选项 = ['无']
for i in 风暴骑兵技能列表:
    if i.所在等级 >= 20 and i.所在等级 <= 80 and i.所在等级 != 50 and i.是否有伤害 == 1:
        风暴骑兵符文选项.append(i.名称)

class 风暴骑兵角色属性(角色属性):

    职业名称 = '风暴骑兵'

    武器选项 = ['手炮']
    
    #'物理百分比','魔法百分比','物理固伤','魔法固伤'
    伤害类型选择 = ['物理百分比']
    
    #默认
    伤害类型 = '物理百分比'
    防具类型 = '重甲'
    防具精通属性 = ['力量']

    主BUFF = 1.957
   
    #基础属性(含唤醒)
    基础力量 = 961.0
    基础智力 = 790.0
    
    #适用系统奶加成
    力量 = 基础力量
    智力 = 基础智力

    #人物基础 + 唤醒
    物理攻击力 = 65.0
    魔法攻击力 = 65.0
    独立攻击力 = 1045.0
    火属性强化 = 13
    冰属性强化 = 13
    光属性强化 = 13
    暗属性强化 = 13
  
    def __init__(self):
        self.技能栏= deepcopy(风暴骑兵技能列表)
        self.技能序号= deepcopy(风暴骑兵技能序号)

class 风暴骑兵(角色窗口):
    def 窗口属性输入(self):
        self.初始属性 = 风暴骑兵角色属性()
        self.角色属性A = 风暴骑兵角色属性()
        self.角色属性B = 风暴骑兵角色属性()
        self.一觉序号 = 风暴骑兵一觉序号
        self.二觉序号 = 风暴骑兵二觉序号
        self.三觉序号 = 风暴骑兵三觉序号
        self.护石选项 = deepcopy(风暴骑兵护石选项)
        self.符文选项 = deepcopy(风暴骑兵符文选项)

