from math import *
from PublicReference.base import *
    
class 魔道学者技能0(主动技能):
    名称 = '变异苍蝇拍'
    所在等级 = 25
    等级上限 = 60
    基础等级 = 41
    基础 = 5143
    成长 = 580.585
    CD = 6.4
    TP成长 = 0.1
    TP上限 = 5
    演出时间 = 0.1

class 魔道学者技能1(被动技能):
    名称 = '亲和法米利尔'
    所在等级 = 15
    等级上限 = 15
    基础等级 = 5
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1 + 0.02 * self.等级 , 5)


class 魔道学者技能2(主动技能):
    名称 = '改良舒露露'
    所在等级 = 25
    等级上限 = 60
    基础等级 = 46
    基础 = 5768
    成长 = 651.23913
    CD = 16.0
    TP成长 = 0.10
    TP上限 = 5

class 魔道学者技能3(主动技能):
    名称 = '熔岩药瓶失败'
    所在等级 = 30
    等级上限 = 60
    基础等级 = 26
    基础 = 5823
    成长 = 1085.30769
    CD = 20.0
    TP成长 = 0.10
    TP上限 = 5

class 魔道学者技能4(主动技能):
    名称 = '魔道酸云雨'
    所在等级 = 30
    等级上限 = 60
    基础等级 = 26
    基础 = 9998.4
    成长 = 1895.6
    CD = 20.0
    TP成长 = 0.10
    TP上限 = 5


class 魔道学者技能5(主动技能):
    名称 = '电鳗碰撞机'
    所在等级 = 35
    等级上限 = 60
    基础等级 = 36
    基础 = 12165
    成长 = 1377.694
    CD = 20.0
    TP成长 = 0.10
    TP上限 = 5
    是否有护石 = 1
    演出时间 = 4.8

    def 装备护石(self):
        self.倍率 *= 1.27


        
class 魔道学者技能6(主动技能):
    名称 = '反重力装置'
    所在等级 = 40
    等级上限 = 60
    基础等级 = 33
    基础 = 11014
    成长 = 1243.575757
    CD = 20.0
    TP成长 = 0.10
    TP上限 = 5
    演出时间 = 0.4


class 魔道学者技能7(主动技能):
    名称 = '暴炎加热炉失败'
    所在等级 = 40
    等级上限 = 60
    基础等级 = 33
    基础 = 10722.5625
    成长 = 1211.4375
    CD = 25.0
    TP成长 = 0.10
    TP上限 = 5
    是否有护石 = 1
    演出时间 = 2.0

    def 装备护石(self):
        self.倍率 *= 1.2768


class 魔道学者技能8(主动技能):
    名称 = '冰霜钻孔车失败'
    所在等级 = 45
    等级上限 = 60
    基础等级 = 31
    基础 = 14914
    成长 = 1686.258
    CD = 45.0
    TP成长 = 0.10
    TP上限 = 5
    是否有护石 = 1
    演出时间 = 2.0

    def 装备护石(self):
        self.倍率 *= 1.24
        self.演出时间 *= 1

        
class 魔道学者技能9(主动技能):
    名称 = '超级苍蝇拍'
    所在等级 = 60
    等级上限 = 40
    基础等级 = 23
    基础 = 24612.182
    成长 = 2778.818
    CD = 30.0
    TP成长 = 0.10
    TP上限 = 5
    是否有护石 = 1
    演出时间 = 0.1

    def 装备护石(self):
        self.CD *= 0.9
        self.倍率 *= 1.15
        
class 魔道学者技能10(被动技能):
    名称 = '成功预感'
    所在等级 = 48
    等级上限 = 40
    基础等级 = 20

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return 1 + round(16 + 1.5 * (self.等级 - 16), 1) / 100

class 魔道学者技能11(主动技能):
    名称 = '技艺融合'
    所在等级 = 50
    等级上限 = 40
    基础等级 = 12
    基础 = 64062.9
    成长 = 19249.3
    CD = 145.0
   
class 魔道学者技能12(主动技能):
    名称 = '光电兔'
    所在等级 = 70
    等级上限 = 40
    基础等级 = 18
    基础 = 38889
    成长 = 4391
    CD = 50.0
    TP成长 = 0.10
    TP上限 = 5
    是否有护石 = 1
    演出时间 = 4

    def 装备护石(self):
        self.倍率 *= 1.15

class 魔道学者技能13(主动技能):
    名称 = '雪人刨冰'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 16
    基础 = 65385
    成长 = 7367
    CD = 40.0
    演出时间 = 4

class 魔道学者技能14(被动技能):
    名称 = '贤者之石'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 11
    关联技能 = ['魔道酸云雨','电鳗碰撞机','反重力装置','熔岩药瓶成功']
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.22 + 0.02 * self.等级, 5)          


class 魔道学者技能15(被动技能):
    名称 = '魔道学助手'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 11
    关联技能 = ['变异苍蝇拍','超级苍蝇拍','改良舒露露','技艺融合','超级棒棒糖','光电兔','雪人刨冰','乌洛波洛斯之环']
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.17 + 0.02 * self.等级, 5)           

  
class 魔道学者技能16(被动技能):
    名称 = '魔道学助手+苦涩棒棒糖'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 11
    关联技能 = ['冰霜钻孔车失败','暴炎加热炉失败','熔岩药瓶失败']
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.88 + 0.02 * self.等级, 5)      

class 魔道学者技能17(主动技能):
    名称 = '超级棒棒糖'
    所在等级 = 80
    等级上限 = 40
    基础等级 = 13
    基础 = 75371.58334
    成长 = 8509.41666
    CD = 45.0
    演出时间 = 0.3

class 魔道学者技能18(主动技能):
    名称 = '乌洛波洛斯之环'
    所在等级 = 85
    等级上限 = 40
    基础等级 = 5
    基础 = 132723.86
    成长 = 40079.77
    CD = 180.0


class 魔道学者技能19(主动技能):
    名称 = '魔法秀'
    所在等级 = 20
    等级上限 = 20
    基础等级 = 10
    是否有伤害 = 0
    冷却关联技能 = ['改良舒露露','熔岩药瓶失败','魔道酸云雨','电鳗碰撞机','暴炎加热炉失败','冰霜钻孔车失败','反重力装置','熔岩药瓶成功','光电兔','雪人刨冰']

    def CD缩减倍率(self, 武器类型):
            if self.等级 == 0:
               return 1.0
            else:
               return round(1 - 0.0216 * self.等级 , 3)
    
    
class 魔道学者技能20(被动技能):
    名称 = '卓越之力'
    所在等级 = 95
    等级上限 = 40
    基础等级 = 4

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.18 + 0.02 * self.等级, 5)

class 魔道学者技能21(被动技能):
    名称 = '超卓之心'
    所在等级 = 95
    等级上限 = 11
    基础等级 = 1

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.045 + 0.005 * self.等级, 5)

class 魔道学者技能22(被动技能):
    名称 = '觉醒之抉择'
    所在等级 = 100
    等级上限 = 40
    基础等级 = 2
    关联技能 = ['无']

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.10 + 0.05 * self.等级, 5)

class 魔道学者技能23(被动技能):
    名称 = '幸运棒棒糖'
    所在等级 = 25
    等级上限 = 15
    基础等级 = 5
    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.07 + 0.01 * self.等级 , 5)

class 魔道学者技能24(主动技能):
    名称 = '熔岩药瓶成功'
    所在等级 = 30
    等级上限 = 60
    基础等级 = 26
    基础 = 10432
    成长 = 2005
    CD = 20.0
    TP成长 = 0.10
    TP上限 = 5

魔道学者技能列表 = []
i = 0
while i >= 0:
    try:
        exec('魔道学者技能列表.append(魔道学者技能'+str(i)+'())')
        i += 1
    except:
        i = -1

魔道学者技能序号 = dict()
for i in range(len(魔道学者技能列表)):
    魔道学者技能序号[魔道学者技能列表[i].名称] = i

魔道学者一觉序号 = 0
魔道学者二觉序号 = 0
魔道学者三觉序号 = 0
for i in 魔道学者技能列表:
    if i.所在等级 == 50:
        魔道学者一觉序号 = 魔道学者技能序号[i.名称]
    if i.所在等级 == 85:
        魔道学者二觉序号 = 魔道学者技能序号[i.名称]
    if i.所在等级 == 100:
        魔道学者三觉序号 = 魔道学者技能序号[i.名称]

魔道学者护石选项 = ['无']
for i in 魔道学者技能列表:
    if i.是否有伤害 == 1 and i.是否有护石 == 1:
        魔道学者护石选项.append(i.名称)

魔道学者符文选项 = ['无']
for i in 魔道学者技能列表:
    if i.所在等级 >= 20 and i.所在等级 <= 80 and i.所在等级 != 50 and i.是否有伤害 == 1:
        魔道学者符文选项.append(i.名称)

class 魔道学者角色属性(角色属性):

    职业名称 = '魔道学者'

    武器选项 = ['魔杖','法杖','棍棒','矛','扫把']
    
    #'物理百分比','魔法百分比','物理固伤','魔法固伤'
    伤害类型选择 = ['魔法固伤']
    
    #默认
    伤害类型 = '魔法固伤'
    防具类型 = '皮甲'
    防具精通属性 = ['智力']

    主BUFF = 1.92
   
    #基础属性(含唤醒)
    基础力量 = 867.0
    基础智力 = 943.0
    
    #适用系统奶加成
    力量 = 基础力量
    智力 = 基础智力

    #人物基础 + 唤醒
    物理攻击力 = 65.0
    魔法攻击力 = 65.0
    独立攻击力 = 1045.0
    火属性强化 = 13
    冰属性强化 = 13
    光属性强化 = 13
    暗属性强化 = 13
    远古记忆 = 0
  
    def __init__(self):
        self.技能栏= deepcopy(魔道学者技能列表)
        self.技能序号= deepcopy(魔道学者技能序号)
    
class 魔道学者(角色窗口):
    def 窗口属性输入(self):
        self.初始属性 = 魔道学者角色属性()
        self.角色属性A = 魔道学者角色属性()
        self.角色属性B = 魔道学者角色属性()
        self.一觉序号 = 魔道学者一觉序号
        self.二觉序号 = 魔道学者二觉序号
        self.三觉序号 = 魔道学者三觉序号
        self.护石选项 = deepcopy(魔道学者护石选项)
        self.符文选项 = deepcopy(魔道学者符文选项)
