from PublicReference.config import *

#region  100SS武器
class 装备0():
    名称 = '信念徽章：自由'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '短剑'
    力量 = 0
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.26)
        属性.百分比三攻加成(0.22)
        属性.伤害增加加成(0.22)
        属性.技能攻击力加成(0.3)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.移动速度 += 0.1
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1414<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +26%<br>'
        temp += '百分比三攻 +22%<br>'
        temp += '伤害增加 +22%<br>'
        temp += '技能攻击力 +30%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        return temp    

class 装备1():
    名称 = '太极天帝剑'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '太刀'
    力量 = 81
    智力 = 122
    物理攻击力 = 1167
    魔法攻击力 = 1290
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.1)
        属性.百分比三攻加成(0.4)
        属性.技能攻击力加成(0.3)
        if 属性.太极天帝剑 == 0:
            属性.技能攻击力加成(0.23)
        if 属性.太极天帝剑 == 1:
            属性.最终伤害加成(0.21)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.太极天帝剑 == 0:
            属性.攻击速度 += -0.5
            属性.移动速度 += -0.5
            属性.释放速度 += -0.5
        if 属性.太极天帝剑 == 1:
            属性.攻击速度 += 0.2
            属性.移动速度 += 0.2
            属性.释放速度 += 0.35
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1290<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +10%<br>'
        temp += '百分比三攻 +40%<br>'
        temp += '技能攻击力 +30%<br>'
        if 属性.太极天帝剑 == 0:
            temp += '<font color="#00A2E8">阳之气息：</font><br>'
            temp += '技能攻击力 +23%<br>'
            temp += '攻击速度 -50%<br>'
            temp += '移动速度 -50%<br>'
            temp += '释放速度 -50%<br>'
        elif 属性.太极天帝剑 == 1:
            temp += '<font color="#00A2E8">阴之气息：</font><br>'
            temp += '最终伤害 +21%<br>'
            temp += '攻击速度 +20%<br>'
            temp += '移动速度 +20%<br>'
            temp += '释放速度 +35%<br>'        
        return temp      

class 装备2():
    名称 = '哈蒂-赎月者'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '钝器'
    力量 = 122
    智力 = 0
    物理攻击力 = 1352
    魔法攻击力 = 1167
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.16)
        属性.暴击伤害加成(0.41)
        属性.附加伤害加成(0.12)
        属性.技能攻击力加成(0.32)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +122<br>'
        temp += '物理攻击力 +1352<br>'
        temp += '魔法攻击力 +1167<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +16%<br>'
        temp += '暴击伤害 +41%<br>'
        temp += '附加伤害 +12%<br>'
        temp += '技能攻击力 +32%<br>'
        temp += '攻击速度 +15%<br>'
        return temp    

class 装备3():
    名称 = '卡西姆的大剑'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '巨剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.2)
        属性.最终伤害加成(0.43)
        属性.技能攻击力加成(0.3)
        属性.技能冷却缩减(1, 45, 0.20)
        属性.技能冷却缩减(60, 80, 0.20)
        属性.技能冷却缩减(90, 95, 0.20)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        属性.释放速度 += 0.225
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1475<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '附加伤害 +20%<br>'
        temp += '最终伤害 +43%<br>'
        temp += '技能攻击力 +30%<br>'
        temp += 'Lv1-45  技能CD-20%<br>'
        temp += 'Lv60-80 技能CD-20%<br>'
        temp += 'Lv90-95 技能CD-20%<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        temp += '释放速度 +22.5%<br>'
        return temp     

class 装备4():
    名称 = '星之海：巴德纳尔'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '光剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1143
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.26)
        属性.属性附加加成(0.2)
        属性.技能攻击力加成(0.22)
        属性.所有属性强化加成(25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        属性.释放速度 += 0.225
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1143<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +26%<br>'
        temp += '属性附加 +20%<br>'
        temp += '技能攻击力 +22%<br>'
        temp += '所有属性强化 +25<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        temp += '释放速度 +22.5%<br>'
        return temp   

class 装备5():
    名称 = '白虎啸魂手套'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '手套'
    力量 = 0
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.5)
        if 属性.职业 == '气功师':
           属性.技能攻击力加成(0.4)
           属性.单技能修改('狮子吼',1.20,0.70)
        pass
    def 进图属性(self, 属性):
        if 属性.职业 == '气功师':
           属性.所有属性强化加成(56)
        pass
    def 其它属性(self, 属性):
        if 属性.职业 == '气功师':
           属性.攻击速度 += 0.1
           属性.移动速度 += 0.1
           属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1414<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +50%<br>'
        if 属性.职业 == '气功师':
           temp += '技能攻击力 +40%<br>'
           temp += '所有属性强化 +56<br>'
           temp += '狮子吼攻击力 +20% 冷却 -30%<br>'
           temp += '攻击速度 +10%<br>'
           temp += '移动速度 +10%<br>'
           temp += '释放速度 +15%<br>'
        return temp      

class 装备6():
    名称 = '太阴神：灵龟'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '臂铠'
    力量 = 122
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.14)
        属性.暴击伤害加成(0.25)
        属性.最终伤害加成(0.26)
        属性.技能攻击力加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +122<br>'
        temp += '物理攻击力 +1475<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +14%<br>'
        temp += '暴击伤害 +25%<br>'
        temp += '最终伤害 +26%<br>'
        temp += '技能攻击力 +35%<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        return temp   

class 装备7():
    名称 = '疯狂飓风'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '爪'
    力量 = 81
    智力 = 41
    物理攻击力 = 1229
    魔法攻击力 = 1229
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.16)
        属性.伤害增加加成(0.47)
        属性.持续伤害 += 0.1
        属性.技能攻击力加成(0.22)
        属性.单技能等级加成('爪精通', 3)
        属性.单技能等级加成('万毒噬心诀', 1)
        属性.单技能等级加成('燃火轰天炮', 1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +41<br>'
        temp += '物理攻击力 +1229<br>'
        temp += '魔法攻击力 +1229<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +16%<br>'
        temp += '伤害增加 +47%<br>'
        temp += '持续伤害 +10%<br>'
        temp += '技能攻击力 +22%<br>'
        temp += '爪精通 Lv+3<br>'
        temp += '万毒噬心诀 Lv+1<br>'
        temp += '燃火轰天炮 Lv+1<br>'
        temp += '移动速度 +15%<br>'
        return temp     

class 装备8():
    名称 = '猎焰追魂拳套'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '拳套'
    力量 = 81
    智力 = 0
    物理攻击力 = 1290
    魔法攻击力 = 1167
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.35)
        属性.伤害增加加成(0.24)
        属性.最终伤害加成(0.12)
        属性.技能攻击力加成(0.3)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1290<br>'
        temp += '魔法攻击力 +1167<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +35%<br>'
        temp += '伤害增加 +24%<br>'
        temp += '最终伤害 +12%<br>'
        temp += '技能攻击力 +30%<br>'
        return temp      

class 装备9():
    名称 = '青沙棍'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '东方棍'
    力量 = 81
    智力 = 122
    物理攻击力 = 1167
    魔法攻击力 = 1229
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.4)
        属性.附加伤害加成(0.34)
        属性.技能攻击力加成(0.3)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.06
        属性.魔法暴击率 += 0.06
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1229<br>'
        temp += '独立攻击力 +770<br>'
        temp += '暴击伤害 +40%<br>'
        temp += '附加伤害 +34%<br>'
        temp += '技能攻击力 +30%<br>'
        temp += '物理暴击率 +6%<br>'
        temp += '魔法暴击率 +6%<br>'
        return temp        

class 装备10():
    名称 = '午夜生死轮盘'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '左轮枪'
    力量 = 81
    智力 = 0
    物理攻击力 = 1238
    魔法攻击力 = 1042
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.18)
        属性.暴击伤害加成(0.54)
        属性.技能攻击力加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1238<br>'
        temp += '魔法攻击力 +1042<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +18%<br>'
        temp += '暴击伤害 +54%<br>'
        temp += '技能攻击力 +35%<br>'
        return temp    

class 装备11():
    名称 = '雷霆怒啸手枪'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '自动手枪'
    力量 = 0
    智力 = 81
    物理攻击力 = 868
    魔法攻击力 = 1273
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.29)
        属性.最终伤害加成(0.22)
        属性.技能攻击力加成(0.38)
        属性.所有属性强化加成(40)
        属性.单技能修改('光反应能量模块',1.2,1)
        属性.单技能等级加成('TN80终结者',3)
        属性.单技能等级加成('GSP猎鹰捕食者形态',3)
        属性.单技能等级加成('GSP猎鹰科罗纳形态',3)
        属性.单技能等级加成('GSP猎鹰旋雷者形态',3)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +868<br>'
        temp += '魔法攻击力 +1273<br>'
        temp += '独立攻击力 +770<br>'
        temp += '附加伤害 +29%<br>'
        temp += '最终伤害 +22%<br>'
        temp += '技能攻击力 +38%<br>'
        temp += '所有属性强化 +40<br>'
        temp += '光反应能量模块攻击力 +20%<br>'
        temp += 'TN80终结者 Lv+3<br>'
        temp += 'GSP猎鹰 Lv+3<br>'
        return temp     

class 装备12():
    名称 = '强力打击-X'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '步枪'
    力量 = 81
    智力 = 122
    物理攻击力 = 1331
    魔法攻击力 = 1157
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.27)
        属性.伤害增加加成(0.2)
        属性.暴击伤害加成(0.2)
        属性.技能攻击力加成(0.3)
        属性.单技能等级加成('战地勋章',2)
        属性.单技能等级加成('重火力支援',2)
        属性.单技能等级加成('制空掌握',2)
        属性.单技能等级加成('开火',2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1331<br>'
        temp += '魔法攻击力 +1157<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +27%<br>'
        temp += '伤害增加 +20%<br>'
        temp += '暴击伤害 +20%<br>'
        temp += '技能攻击力 +30%<br>'
        temp += '战地勋章 Lv+2<br>'
        temp += '重火力支援 Lv+2<br>'
        temp += '制空掌握 Lv+2<br>'
        temp += '开火 Lv+2<br>'
        return temp     

class 装备13():
    名称 = '绝杀：无人生还'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '手炮'
    力量 = 122
    智力 = 0
    物理攻击力 = 1447
    魔法攻击力 = 868
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.32)
        属性.百分比三攻加成(0.16)
        属性.技能攻击力加成(0.3)
        属性.所有属性强化加成(40)
        属性.技能等级加成('所有',50,50,2)
        属性.技能等级加成('所有',85,85,2)
        属性.技能等级加成('所有',100,100,2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +122<br>'
        temp += '物理攻击力 +1447<br>'
        temp += '魔法攻击力 +868<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +32%<br>'
        temp += '百分比三攻 +16%<br>'
        temp += '技能攻击力 +30%<br>'
        temp += '所有属性强化 +40<br>'
        temp += 'Lv50  技能等级+2<br>'
        temp += 'Lv85  技能等级+2<br>'
        temp += 'Lv100 技能等级+2<br>'
        return temp      

class 装备14():
    名称 = '激光流星弓'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '手弩'
    力量 = 81
    智力 = 41
    物理攻击力 = 1042
    魔法攻击力 = 1157
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.36)
        属性.附加伤害加成(0.35)
        属性.技能攻击力加成(0.3)
        属性.单技能等级加成('弹夹改装',1)
        属性.单技能等级加成('单兵推进器',1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.命中率 += 0.03
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +41<br>'
        temp += '物理攻击力 +1042<br>'
        temp += '魔法攻击力 +1157<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +36%<br>'
        temp += '附加伤害 +35%<br>'
        temp += '技能攻击力 +30%<br>'
        temp += '弹夹改装 Lv+1<br>'
        temp += '单兵推进器 Lv+1<br>'
        temp += '攻击速度 +10%<br>'
        temp += '命中率 +3%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp     

class 装备15():
    名称 = '歼灵灭魂矛'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '矛'
    力量 = 122
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1045
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.属性附加加成(0.15)
        属性.最终伤害加成(0.33)
        属性.技能攻击力加成(0.35)
        if 属性.职业 == '战斗法师':
            属性.技能栏[属性.技能序号['碎霸']].额外倍率 = 5
        elif 属性.职业 == '血法师':
            属性.技能栏[属性.技能序号['狱血之牙']].额外倍率 = 5
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +122<br>'
        temp += '物理攻击力 +1475<br>'
        temp += '魔法攻击力 +1045<br>'
        temp += '独立攻击力 +770<br>'
        temp += '属性附加 +15%<br>'
        temp += '最终伤害 +33%<br>'
        temp += '技能攻击力 +35%<br>'
        temp += '释放碎霸/狱血之牙时<br>10%概率攻击力 +500%<br>'
        return temp     

class 装备16():
    名称 = '混沌之种'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '棍棒'
    力量 = 81
    智力 = 81
    物理攻击力 = 1328
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.35)
        属性.附加伤害加成(0.35)
        属性.技能攻击力加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1328<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +35%<br>'
        temp += '附加伤害 +35%<br>'
        temp += '技能攻击力 +35%<br>'
        return temp    

class 装备17():
    名称 = '火焰地狱'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '魔杖'
    力量 = 0
    智力 = 122
    物理攻击力 = 1106
    魔法攻击力 = 1352
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.属性附加加成(0.15)
        属性.最终伤害加成(0.34)
        属性.技能攻击力加成(0.33)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1106<br>'
        temp += '魔法攻击力 +1352<br>'
        temp += '独立攻击力 +770<br>'
        temp += '属性附加 +15%<br>'
        temp += '最终伤害 +34%<br>'
        temp += '技能攻击力 +33%<br>'
        return temp     

class 装备18():
    名称 = '世界树的根须'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '法杖'
    力量 = 0
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1475
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.24)
        属性.百分比三攻加成(0.2)
        属性.附加伤害加成(0.1)
        属性.技能攻击力加成(0.32)
        属性.技能冷却缩减(1,100,0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.释放速度 += 0.2
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1475<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +24%<br>'
        temp += '百分比三攻 +20%<br>'
        temp += '附加伤害 +10%<br>'
        temp += '技能攻击力 +32%<br>'
        temp += 'Lv1-100 技能CD-10%<br>'
        temp += '释放速度 +20%<br>'
        return temp    

class 装备19():
    名称 = '纯白的祈祷'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '扫把'
    力量 = 0
    智力 = 81
    物理攻击力 = 1229
    魔法攻击力 = 1352
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.15)
        属性.百分比三攻加成(0.15)
        属性.伤害增加加成(0.15)
        属性.暴击伤害加成(0.15)
        属性.技能攻击力加成(0.3)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(26)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        属性.释放速度 += 0.225
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1229<br>'
        temp += '魔法攻击力 +1352<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +15%<br>'
        temp += '百分比三攻 +15%<br>'
        temp += '伤害增加 +15%<br>'
        temp += '暴击伤害 +15%<br>'
        temp += '技能攻击力 +30%<br>'
        temp += '所有属性强化 +26<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        temp += '释放速度 +22.5%<br>'
        return temp     

class 装备20():
    名称 = '圣者的慈悲'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '十字架'
    力量 = 0
    智力 = 81
    物理攻击力 = 1229
    魔法攻击力 = 1167
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.36)
        属性.百分比三攻加成(0.36)
        属性.技能攻击力加成(0.31)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.16
        属性.移动速度 += 0.16
        属性.释放速度 += 0.24
        属性.物理暴击率 += 0.08
        属性.魔法暴击率 += 0.08
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1229<br>'
        temp += '魔法攻击力 +1167<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +36%<br>'
        temp += '百分比三攻 +36%<br>'
        temp += '技能攻击力 +31%<br>'
        temp += '攻击速度 +16%<br>'
        temp += '移动速度 +16%<br>'
        temp += '释放速度 +24%<br>'
        temp += '物理暴击率 +8%<br>'
        temp += '魔法暴击率 +8%<br>'
        return temp     

class 装备21():
    名称 = '轮回之环：桓龙'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '念珠'
    力量 = 0
    智力 = 122
    物理攻击力 = 1106
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.34)
        属性.伤害增加加成(0.2)
        属性.技能攻击力加成(0.34)
        属性.技能冷却缩减(1,100,0.1)
        if 属性.职业 in ['驱魔师', '巫女']:
            属性.技能等级加成('所有',48,80,1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1106<br>'
        temp += '魔法攻击力 +1414<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +34%<br>'
        temp += '伤害增加 +20%<br>'
        temp += '技能攻击力 +34%<br>'
        temp += 'Lv1-100 技能CD-10%<br>'
        temp += '驱魔师、巫女装备时：<br>'
        temp += 'Lv48-80 技能等级+1<br>'
        return temp     

class 装备22():
    名称 = '暗战终结者'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '图腾'
    力量 = 122
    智力 = 0
    物理攻击力 = 1290
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.12)
        属性.暴击伤害加成(0.16)
        属性.附加伤害加成(0.38)
        属性.技能攻击力加成(0.36)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +122<br>'
        temp += '物理攻击力 +1290<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +12%<br>'
        temp += '暴击伤害 +16%<br>'
        temp += '附加伤害 +38%<br>'
        temp += '技能攻击力 +36%<br>'
        return temp      

class 装备23():
    名称 = '泯灭之灵'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '镰刀'
    力量 = 81
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1229
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.28)
        属性.附加伤害加成(0.18)
        属性.最终伤害加成(0.18)
        属性.技能攻击力加成(0.38)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1229<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +28%<br>'
        temp += '附加伤害 +18%<br>'
        temp += '最终伤害 +18%<br>'
        temp += '技能攻击力 +38%<br>'
        return temp   

class 装备24():
    名称 = '弗卡奴斯的第二个痕迹'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '战斧'
    力量 = 81
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1045
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.41)
        属性.持续伤害 += 0.1
        属性.最终伤害加成(0.17)
        属性.技能攻击力加成(0.28)
        属性.单技能等级加成('苍龙逐日',3)
        属性.单技能等级加成('火刑',3)
        属性.单技能修改('无双击',1.40,1)
        属性.单技能修改('行刑',1.40,1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1475<br>'
        temp += '魔法攻击力 +1045<br>'
        temp += '独立攻击力 +770<br>'
        temp += '附加伤害 +41%<br>'
        temp += '持续伤害 +10%<br>'
        temp += '最终伤害 +17%<br>'
        temp += '技能攻击力 +28%<br>'
        temp += '苍龙逐日 Lv+3<br>'
        temp += '火刑 Lv+3<br>'
        temp += '无双击攻击力 +40%<br>'
        temp += '行刑攻击力 +40%<br>'        
        return temp     

class 装备25():
    名称 = '匿影'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '匕首'
    力量 = 81
    智力 = 0
    物理攻击力 = 1167
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.属性附加加成(0.18)
        属性.最终伤害加成(0.26)
        属性.技能攻击力加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        属性.释放速度 += 0.225
        属性.命中率 += 0.15
        属性.回避率 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '属性附加 +18%<br>'
        temp += '最终伤害 +26%<br>'
        temp += '技能攻击力 +34%<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        temp += '释放速度 +22.5%<br>'
        temp += '命中率 +15%<br>'
        temp += '回避率 +15%<br>'
        return temp      

class 装备26():
    名称 = '一叶障目'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '双剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1343
    魔法攻击力 = 983
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.32)
        属性.最终伤害加成(0.32)
        属性.技能攻击力加成(0.32)
        属性.技能倍率加成(40,0.32)
        属性.技能倍率加成(45,0.32)
        属性.技能倍率加成(70,0.32)
        属性.单技能修改('忍法：影分身',0.68,0.68)
        属性.单技能修改('弧光闪',0.68,0.68)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1343<br>'
        temp += '魔法攻击力 +983<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +32%<br>'
        temp += '最终伤害 +32%<br>'
        temp += '技能攻击力 +32%<br>'
        temp += '忍法：影分身攻击和冷却 -32%<br>'
        temp += '弧光闪攻击和冷却 -32%<br>'
        return temp      

class 装备27():
    名称 = '绿色生命的面容'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '手杖'
    力量 = 0
    智力 = 81
    物理攻击力 = 1086
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.19)
        属性.附加伤害加成(0.19)
        属性.最终伤害加成(0.2)
        属性.技能攻击力加成(0.4)
        if 属性.绿色生命的面容 == 1:
            属性.最终伤害加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.绿色生命的面容 == 1:
            属性.释放速度 += 0.21
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1086<br>'
        temp += '魔法攻击力 +1414<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +19%<br>'
        temp += '附加伤害 +19%<br>'
        temp += '最终伤害 +20%<br>'
        temp += '技能攻击力 +40%<br>'
        if 属性.绿色生命的面容 == 1:
            temp += '<font color="#00A2E8">绿色生命的阴暗面：</font><br>'
            temp += '最终伤害 +10%<br>'
            temp += '释放速度 +21%<br>'
        return temp     

class 装备28():
    名称 = '血腥红宝石之眼'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '苦无'
    力量 = 0
    智力 = 122
    物理攻击力 = 1029
    魔法攻击力 = 1352
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.3)
        属性.暴击伤害加成(0.2)
        属性.技能攻击力加成(0.35)
        属性.火属性强化加成(40)
        属性.单技能等级加成('火遁·蟾蜍油炎弹',5)
        属性.单技能等级加成('八岐大蛇',5)
        属性.单技能等级加成('天照',5)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1029<br>'
        temp += '魔法攻击力 +1352<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +30%<br>'
        temp += '暴击伤害 +20%<br>'
        temp += '技能攻击力 +35%<br>'
        temp += '火属性强化 +40<br>'
        temp += '火遁·蟾蜍油炎弹 Lv+5<br>'
        temp += '八岐大蛇 Lv+5<br>'
        temp += '天照 Lv+5<br>'
        return temp     

class 装备29():
    名称 = '幻影狂欢长枪'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '长枪'
    力量 = 122
    智力 = 0
    物理攻击力 = 1290
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.4)
        属性.附加伤害加成(0.12)
        属性.最终伤害加成(0.12)
        属性.技能攻击力加成(0.28)
        属性.单技能等级加成('行云：沐',2)
        属性.单技能等级加成('行云：启',2)
        属性.单技能等级加成('行云：冥',2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +122<br>'
        temp += '物理攻击力 +1290<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '暴击伤害 +40%<br>'
        temp += '附加伤害 +12%<br>'
        temp += '最终伤害 +12%<br>'
        temp += '技能攻击力 +28%<br>'
        temp += '行云：沐 Lv+2<br>'
        temp += '行云：启 Lv+2<br>'
        temp += '行云：冥 Lv+2<br>'
        return temp     

class 装备30():
    名称 = '万夫之勇'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '战戟'
    力量 = 81
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1045
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.属性附加加成(0.14)
        属性.最终伤害加成(0.29)
        属性.技能攻击力加成(0.16)
        属性.单技能等级加成('战戟之魂',3)
        属性.单技能等级加成('战神之力',3)
        属性.单技能等级加成('千魂弑',2)
        属性.单技能等级加成('血战天狱',2)
        属性.技能等级加成('所有',100,100,2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1475<br>'
        temp += '魔法攻击力 +1045<br>'
        temp += '独立攻击力 +770<br>'
        temp += '属性附加 +14%<br>'
        temp += '最终伤害 +29%<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '战戟之魂 Lv+3<br>'
        temp += '战神之力 Lv+3<br>'
        temp += '千魂弑 Lv+2<br>'
        temp += '血战天狱 Lv+2<br>'
        temp += 'Lv100 技能等级+2<br>'
        return temp      

class 装备31():
    名称 = '千芒闪爆枪'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '光枪'
    力量 = 81
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.18)
        属性.百分比三攻加成(0.16)
        属性.附加伤害加成(0.32)
        属性.技能攻击力加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1414<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +18%<br>'
        temp += '百分比三攻 +16%<br>'
        temp += '附加伤害 +32%<br>'
        temp += '技能攻击力 +35%<br>'
        return temp      

class 装备32():
    名称 = '寂灭剧毒矛'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '暗矛'
    力量 = 81
    智力 = 122
    物理攻击力 = 1167
    魔法攻击力 = 1290
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.24)
        属性.最终伤害加成(0.4)
        属性.技能攻击力加成(0.3)
        属性.单技能等级加成('黑暗本源',3)
        属性.单技能等级加成('坠蚀之雨',2)
        属性.单技能等级加成('冥夜裂空',2)
        属性.单技能等级加成('冥蚀脉冲',2)
        属性.单技能修改('幽影暗蚀：寂灭',1.114000616,1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1290<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +24%<br>'
        temp += '最终伤害 +40%<br>'
        temp += '技能攻击力 +30%<br>'
        temp += '黑暗本源 Lv+3<br>'
        temp += '坠蚀之雨 Lv+2<br>'
        temp += '冥夜裂空 Lv+2<br>'
        temp += '冥蚀脉冲 Lv+2<br>'
        temp += '幽影暗蚀：寂灭攻击力 +11.4%<br>'
        return temp      

class 装备33():
    名称 = '金刚密藏刀'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '长刀'
    力量 = 81
    智力 = 81
    物理攻击力 = 1328
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.1)
        属性.百分比三攻加成(0.1)
        属性.伤害增加加成(0.1)
        属性.暴击伤害加成(0.1)
        属性.技能攻击力加成(0.28)
        属性.所有属性强化加成(50)
        属性.技能等级加成('所有',1,85,1)
        属性.技能等级加成('所有',100,100,1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        属性.释放速度 += 0.225
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1328<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +10%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '伤害增加 +10%<br>'
        temp += '暴击伤害 +10%<br>'
        temp += '技能攻击力 +28%<br>'
        temp += '所有属性强化 +50<br>'
        temp += 'Lv1-85 技能等级+1<br>'
        temp += 'Lv100  技能等级+1<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        temp += '释放速度 +22.5%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp      

class 装备34():
    名称 = '冰洁的红焰'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '小太刀'
    力量 = 81
    智力 = 41
    物理攻击力 = 1229
    魔法攻击力 = 1229
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.11)
        属性.伤害增加加成(0.21)
        属性.最终伤害加成(0.3)
        属性.技能攻击力加成(0.4)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +41<br>'
        temp += '物理攻击力 +1229<br>'
        temp += '魔法攻击力 +1229<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +11%<br>'
        temp += '伤害增加 +21%<br>'
        temp += '最终伤害 +30%<br>'
        temp += '技能攻击力 +40%<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        return temp     

class 装备35():
    名称 = '聚能擎天剑'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '重剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.15)
        属性.暴击伤害加成(0.55)
        属性.技能攻击力加成(0.3)
        属性.所有属性强化加成(22)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.40
        属性.移动速度 += 0.3
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1475<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +15%<br>'
        temp += '暴击伤害 +55%<br>'
        temp += '技能攻击力 +30%<br>'
        temp += '所有属性强化 +22<br>'
        temp += '攻击速度 +40%<br>'
        temp += '移动速度 +30%<br>'
        return temp      

class 装备36():
    名称 = '远古御神战剑'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '源力剑'
    力量 = 0
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.23)
        属性.附加伤害加成(0.24)
        属性.最终伤害加成(0.2)
        属性.技能攻击力加成(0.33)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1414<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +23%<br>'
        temp += '附加伤害 +24%<br>'
        temp += '最终伤害 +20%<br>'
        temp += '技能攻击力 +33%<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        return temp     

class 装备37():
    名称 = '战场的热血：安格巴迪'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '短剑'
    力量 = 0
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.3)
        属性.附加伤害加成(0.34)
        属性.技能攻击力加成(0.4)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.移动速度 += 0.05
        属性.释放速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1414<br>'
        temp += '独立攻击力 +770<br>'
        temp += '暴击伤害 +30%<br>'
        temp += '附加伤害 +34%<br>'
        temp += '技能攻击力 +40%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +5%<br>'
        temp += '释放速度 +10%<br>'
        return temp     

class 装备38():
    名称 = '前瞻守卫者'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '太刀'
    力量 = 81
    智力 = 122
    物理攻击力 = 1167
    魔法攻击力 = 1290
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.25)
        属性.伤害增加加成(0.14)
        属性.暴击伤害加成(0.26)
        属性.技能攻击力加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.移动速度 += 0.3
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1290<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +25%<br>'
        temp += '伤害增加 +14%<br>'
        temp += '暴击伤害 +26%<br>'
        temp += '技能攻击力 +35%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +30%<br>'
        return temp     

class 装备39():
    名称 = '骚动的冥焰'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '钝器'
    力量 = 122
    智力 = 0
    物理攻击力 = 1352
    魔法攻击力 = 1167
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.2)
        属性.附加伤害加成(0.32)
        属性.技能攻击力加成(0.36)
        属性.所有属性强化加成(55)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +122<br>'
        temp += '物理攻击力 +1352<br>'
        temp += '魔法攻击力 +1167<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +20%<br>'
        temp += '附加伤害 +32%<br>'
        temp += '技能攻击力 +36%<br>'
        temp += '所有属性强化 +55<br>'
        return temp     

class 装备40():
    名称 = '神之意象'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '巨剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.35)
        属性.技能攻击力加成(0.24)
        属性.所有属性强化加成(50)
        属性.技能等级加成('所有',1,85,2)
        属性.技能等级加成('所有',100,100,2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1475<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +35%<br>'
        temp += '技能攻击力 +24%<br>'
        temp += '所有属性强化 +50<br>'
        temp += 'Lv1-85 技能等级+2<br>'
        temp += 'Lv100  技能等级+2<br>'
        return temp   

class 装备41():
    名称 = '赤光剑路易纳斯'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '光剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1143
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.17)
        属性.百分比三攻加成(0.2)
        属性.最终伤害加成(0.22)
        属性.技能攻击力加成(0.33)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(31)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1143<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +17%<br>'
        temp += '百分比三攻 +20%<br>'
        temp += '最终伤害 +22%<br>'
        temp += '技能攻击力 +33%<br>'
        temp += '所有属性强化 +31<br>'
        return temp      

class 装备42():
    名称 = '无瑕之意志手套'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '手套'
    力量 = 0
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.11)
        属性.属性附加加成(0.15)
        属性.最终伤害加成(0.2)
        属性.技能攻击力加成(0.15)
        属性.技能等级加成('所有',1,48,2)
        属性.技能等级加成('所有',60,80,2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1414<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +11%<br>'
        temp += '属性附加 +15%<br>'
        temp += '最终伤害 +20%<br>'
        temp += '技能攻击力 +15%<br>'
        temp += 'Lv1-48  技能等级+2<br>'
        temp += 'Lv60-80 技能等级+2<br>'
        return temp     

class 装备43():
    名称 = '毁灭之碾压'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '臂铠'
    力量 = 122
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.4)
        属性.附加伤害加成(0.34)
        属性.技能攻击力加成(0.3)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.命中率 += 0.05
        属性.物理暴击率 += 0.1
        属性.魔法暴击率 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +122<br>'
        temp += '物理攻击力 +1475<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '暴击伤害 +40%<br>'
        temp += '附加伤害 +34%<br>'
        temp += '技能攻击力 +30%<br>'
        temp += '攻击速度 +15%<br>'
        temp += '命中率 +5%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp   

class 装备44():
    名称 = '痛苦之源'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '爪'
    力量 = 81
    智力 = 41
    物理攻击力 = 1229
    魔法攻击力 = 1229
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.17)
        属性.附加伤害加成(0.5)
        属性.技能攻击力加成(0.4)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +41<br>'
        temp += '物理攻击力 +1229<br>'
        temp += '魔法攻击力 +1229<br>'
        temp += '独立攻击力 +770<br>'
        temp += '暴击伤害 +17%<br>'
        temp += '附加伤害 +50%<br>'
        temp += '技能攻击力 +40%<br>'
        return temp     

class 装备45():
    名称 = '幻光绽放拳套'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '拳套'
    力量 = 81
    智力 = 0
    物理攻击力 = 1290
    魔法攻击力 = 1167
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.2)
        属性.附加伤害加成(0.35)
        属性.持续伤害 += 0.1
        属性.技能攻击力加成(0.26)
        属性.所有属性强化加成(35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1290<br>'
        temp += '魔法攻击力 +1167<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +20%<br>'
        temp += '附加伤害 +35%<br>'
        temp += '持续伤害 +10%<br>'
        temp += '技能攻击力 +26%<br>'
        temp += '所有属性强化 +35<br>'
        return temp      

class 装备46():
    名称 = '鸣鸿破影棍'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '东方棍'
    力量 = 81
    智力 = 122
    物理攻击力 = 1167
    魔法攻击力 = 1229
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.4)
        属性.伤害增加加成(0.3)
        属性.技能攻击力加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1229<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +40%<br>'
        temp += '伤害增加 +30%<br>'
        temp += '技能攻击力 +34%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        return temp      

class 装备47():
    名称 = '血枪之脉'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '左轮枪'
    力量 = 81
    智力 = 0
    物理攻击力 = 1238
    魔法攻击力 = 1042
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.4)
        属性.附加伤害加成(0.32)
        属性.技能攻击力加成(0.32)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.2
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1238<br>'
        temp += '魔法攻击力 +1042<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +40%<br>'
        temp += '附加伤害 +32%<br>'
        temp += '技能攻击力 +32%<br>'
        temp += '攻击速度 +20%<br>'
        return temp     

class 装备48():
    名称 = '寻觅海石竹'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '自动手枪'
    力量 = 0
    智力 = 81
    物理攻击力 = 868
    魔法攻击力 = 1273
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.35)
        属性.百分比三攻加成(0.35)
        属性.技能攻击力加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +868<br>'
        temp += '魔法攻击力 +1273<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +35%<br>'
        temp += '百分比三攻 +35%<br>'
        temp += '技能攻击力 +34%<br>'
        temp += '移动速度 +10%<br>'
        return temp
      

class 装备49():
    名称 = '湍流'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '步枪'
    力量 = 81
    智力 = 122
    物理攻击力 = 1331
    魔法攻击力 = 1157
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.23)
        属性.暴击伤害加成(0.23)
        属性.附加伤害加成(0.23)
        属性.技能攻击力加成(0.31)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1331<br>'
        temp += '魔法攻击力 +1157<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +23%<br>'
        temp += '暴击伤害 +23%<br>'
        temp += '附加伤害 +23%<br>'
        temp += '技能攻击力 +31%<br>'
        return temp    

class 装备50():
    名称 = '乾坤极电炮'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '手炮'
    力量 = 122
    智力 = 0
    物理攻击力 = 1447
    魔法攻击力 = 868
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.32)
        属性.暴击伤害加成(0.16)
        属性.附加伤害加成(0.2)
        属性.技能攻击力加成(0.3)
        属性.单技能修改('激光炮',1.2,0.7)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +122<br>'
        temp += '物理攻击力 +1447<br>'
        temp += '魔法攻击力 +868<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +32%<br>'
        temp += '暴击伤害 +16%<br>'
        temp += '附加伤害 +20%<br>'
        temp += '技能攻击力 +30%<br>'
        temp += '激光炮攻击力 +20%冷却 -30%<br>'
        return temp      

class 装备51():
    名称 = '吟游诗人的轻吟'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '手弩'
    力量 = 81
    智力 = 41
    物理攻击力 = 1042
    魔法攻击力 = 1157
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.34)
        属性.最终伤害加成(0.4)
        属性.技能攻击力加成(0.3)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.移动速度 += 0.1
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +41<br>'
        temp += '物理攻击力 +1042<br>'
        temp += '魔法攻击力 +1157<br>'
        temp += '独立攻击力 +770<br>'
        temp += '暴击伤害 +34%<br>'
        temp += '最终伤害 +40%<br>'
        temp += '技能攻击力 +30%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp    

class 装备52():
    名称 = '吟唱：不灭之魂'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '矛'
    力量 = 122
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1045
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.15)
        属性.伤害增加加成(0.25)
        属性.暴击伤害加成(0.25)
        属性.技能攻击力加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +122<br>'
        temp += '物理攻击力 +1475<br>'
        temp += '魔法攻击力 +1045<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +15%<br>'
        temp += '伤害增加 +25%<br>'
        temp += '暴击伤害 +25%<br>'
        temp += '技能攻击力 +35%<br>'
        return temp     

class 装备53():
    名称 = '精灵浮风棍'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '棍棒'
    力量 = 81
    智力 = 81
    物理攻击力 = 1328
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.26)
        属性.附加伤害加成(0.15)
        属性.最终伤害加成(0.21)
        属性.技能攻击力加成(0.33)
        属性.单技能等级加成('斗神意志',4)
        属性.单技能等级加成('御风之力',4)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 +=0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1328<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +26%<br>'
        temp += '附加伤害 +15%<br>'
        temp += '最终伤害 +21%<br>'
        temp += '技能攻击力 +33%<br>'
        temp += '斗神意志 Lv+4<br>'
        temp += '御风之力 Lv+4<br>'
        temp += '攻击速度 +10%<br>'
        return temp     

class 装备54():
    名称 = '魔力之泉：加斯达利亚'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '魔杖'
    力量 = 0
    智力 = 122
    物理攻击力 = 1106
    魔法攻击力 = 1352
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.21)
        属性.百分比三攻加成(0.21)
        属性.最终伤害加成(0.21)
        属性.技能攻击力加成(0.38)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.移动速度 += 0.1
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1106<br>'
        temp += '魔法攻击力 +1352<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +21%<br>'
        temp += '百分比三攻 +21%<br>'
        temp += '最终伤害 +21%<br>'
        temp += '技能攻击力 +38%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        return temp      

class 装备55():
    名称 = '银月的祝福'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '法杖'
    力量 = 0
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1475
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.13)
        属性.暴击伤害加成(0.13)
        属性.最终伤害加成(0.25)
        属性.技能攻击力加成(0.36)
        属性.技能等级加成('所有',50,50,2)
        属性.技能等级加成('所有',85,85,2)
        属性.技能等级加成('所有',100,100,2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.释放速度 += 0.1
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1475<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +13%<br>'
        temp += '暴击伤害 +13%<br>'
        temp += '最终伤害 +25%<br>'
        temp += '技能攻击力 +36%<br>'
        temp += 'Lv50  技能等级+2<br>'
        temp += 'Lv85  技能等级+2<br>'
        temp += 'Lv100 技能等级+2<br>'
        temp += '释放速度 +10%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp     

class 装备56():
    名称 = '世界树之精灵'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '扫把'
    力量 = 0
    智力 = 81
    物理攻击力 = 1229
    魔法攻击力 = 1352
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.属性附加加成(0.15)
        属性.最终伤害加成(0.26)
        属性.技能攻击力加成(0.26)
        属性.技能等级加成('所有',50,50,2)
        属性.技能等级加成('所有',85,85,2)
        属性.技能等级加成('所有',100,100,2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1229<br>'
        temp += '魔法攻击力 +1352<br>'
        temp += '独立攻击力 +770<br>'
        temp += '属性附加 +15%<br>'
        temp += '最终伤害 +26%<br>'
        temp += '技能攻击力 +26%<br>'
        temp += 'Lv50  技能等级+2<br>'
        temp += 'Lv85  技能等级+2<br>'
        temp += 'Lv100 技能等级+2<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp      

class 装备57():
    名称 = '闪耀的神威'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '十字架'
    力量 = 0
    智力 = 81
    物理攻击力 = 1229
    魔法攻击力 = 1167
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.3)
        属性.暴击伤害加成(0.3)
        属性.技能攻击力加成(0.32)
        属性.所有属性强化加成(40)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1229<br>'
        temp += '魔法攻击力 +1167<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +30%<br>'
        temp += '暴击伤害 +30%<br>'
        temp += '技能攻击力 +32%<br>'
        temp += '所有属性强化 +40<br>'
        temp += '移动速度 +10%<br>'
        return temp      

class 装备58():
    名称 = '古代神兽的记忆'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '念珠'
    力量 = 0
    智力 = 122
    物理攻击力 = 1106
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.33)
        属性.暴击伤害加成(0.36)
        属性.技能攻击力加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1106<br>'
        temp += '魔法攻击力 +1414<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +33%<br>'
        temp += '暴击伤害 +36%<br>'
        temp += '技能攻击力 +35%<br>'
        return temp       

class 装备59():
    名称 = '拓荒者之路'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '图腾'
    力量 = 122
    智力 = 0
    物理攻击力 = 1290
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.31)
        属性.百分比三攻加成(0.24)
        属性.暴击伤害加成(0.1)
        属性.技能攻击力加成(0.36)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.2
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +122<br>'
        temp += '物理攻击力 +1290<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +31%<br>'
        temp += '百分比三攻 +24%<br>'
        temp += '暴击伤害 +10%<br>'
        temp += '技能攻击力 +36%<br>'
        temp += '攻击速度 +20%<br>'
        return temp     

class 装备60():
    名称 = '异教主的审判'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '镰刀'
    力量 = 81
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1229
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.2)
        属性.暴击伤害加成(0.24)
        属性.附加伤害加成(0.25)
        属性.技能攻击力加成(0.31)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.14
        属性.移动速度 += 0.14
        属性.释放速度 += 0.21
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1229<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +20%<br>'
        temp += '暴击伤害 +24%<br>'
        temp += '附加伤害 +25%<br>'
        temp += '技能攻击力 +31%<br>'
        temp += '攻击速度 +14%<br>'
        temp += '移动速度 +14%<br>'
        temp += '释放速度 +21%<br>'
        return temp      

class 装备61():
    名称 = '信念之重量'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '战斧'
    力量 = 81
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1045
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.12)
        属性.最终伤害加成(0.55)
        属性.技能攻击力加成(0.4)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.移动速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1475<br>'
        temp += '魔法攻击力 +1045<br>'
        temp += '独立攻击力 +770<br>'
        temp += '暴击伤害 +12%<br>'
        temp += '最终伤害 +55%<br>'
        temp += '技能攻击力 +40%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        return temp      

class 装备62():
    名称 = '暗杀团长的玉妆刀'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '匕首'
    力量 = 81
    智力 = 0
    物理攻击力 = 1167
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.22)
        属性.百分比三攻加成(0.22)
        属性.最终伤害加成(0.22)
        属性.技能攻击力加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.移动速度 += 0.1
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +22%<br>'
        temp += '百分比三攻 +22%<br>'
        temp += '最终伤害 +22%<br>'
        temp += '技能攻击力 +35%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        return temp       

class 装备63():
    名称 = '血色舞会'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '双剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1343
    魔法攻击力 = 983
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.2)
        属性.附加伤害加成(0.21)
        属性.最终伤害加成(0.2)
        属性.技能攻击力加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        属性.命中率 += 0.05
        属性.回避率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1343<br>'
        temp += '魔法攻击力 +983<br>'
        temp += '独立攻击力 +770<br>'
        temp += '暴击伤害 +20%<br>'
        temp += '附加伤害 +21%<br>'
        temp += '最终伤害 +20%<br>'
        temp += '[终结追击]技能每个连击点数攻击力增加比率 +40%<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        temp += '命中率 +5%<br>'
        temp += '回避率 +5%<br>'
        return temp       

class 装备64():
    名称 = '圣洁的精灵遗物'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '手杖'
    力量 = 0
    智力 = 81
    物理攻击力 = 1086
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.27)
        属性.伤害增加加成(0.13)
        属性.暴击伤害加成(0.27)
        属性.技能攻击力加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.释放速度 += 0.12
        属性.命中率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1086<br>'
        temp += '魔法攻击力 +1414<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +27%<br>'
        temp += '伤害增加 +13%<br>'
        temp += '暴击伤害 +27%<br>'
        temp += '技能攻击力 +35%<br>'
        temp += '释放速度 +12%<br>'
        temp += '命中率 +5%<br>'
        return temp      

class 装备65():
    名称 = '天幕道火扇'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '苦无'
    力量 = 0
    智力 = 122
    物理攻击力 = 1029
    魔法攻击力 = 1352
    独立攻击力 = 770
    def 城镇属性(self, 属性):      
        属性.附加伤害加成(0.13)
        属性.技能攻击力加成(0.28)
        pass
    def 进图属性(self, 属性):
        属性.百分比三攻加成(0.45)
        属性.技能等级加成('所有',1,45,3)
        属性.单技能等级加成('烈焰印记',3)
        属性.单技能等级加成('火遁·冥炎业火阵',2)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1029<br>'
        temp += '魔法攻击力 +1352<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +45%<br>'
        temp += '附加伤害 +13%<br>'
        temp += '技能攻击力 +28%<br>'
        temp += 'Lv1-45 技能等级+3<br>'
        temp += '烈焰印记 Lv+3<br>'
        temp += '火遁·冥炎业火阵 Lv+2<br>'
        return temp      

class 装备66():
    名称 = '彪悍冲锋者'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '长枪'
    力量 = 122
    智力 = 0
    物理攻击力 = 1290
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.26)
        属性.百分比三攻加成(0.13)
        属性.伤害增加加成(0.24)
        属性.技能攻击力加成(0.38)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +122<br>'
        temp += '物理攻击力 +1290<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +26%<br>'
        temp += '百分比三攻 +13%<br>'
        temp += '伤害增加 +24%<br>'
        temp += '技能攻击力 +38%<br>'
        temp += '攻击速度 +15%<br>'
        return temp
    

class 装备67():
    名称 = '沙岩幻戟'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '战戟'
    力量 = 81
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1045
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.3)
        属性.最终伤害加成(0.24)
        属性.技能攻击力加成(0.16)
        属性.技能等级加成('所有',1,48,2)
        属性.技能等级加成('所有',60,80,2)
        属性.技能冷却缩减(1,48,0.19)
        属性.技能冷却缩减(60,80,0.19)
        属性.技能冷却缩减(90,95,0.19)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.2
        属性.移动速度 += 0.2
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1475<br>'
        temp += '魔法攻击力 +1045<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +30%<br>'
        temp += '最终伤害 +24%<br>'
        temp += '技能攻击力 +16%<br>'
        temp += 'Lv1-48  技能等级+2<br>'
        temp += 'Lv60-80 技能等级+2<br>'
        temp += 'Lv1-48  技能CD-19%<br>'
        temp += 'Lv60-80 技能CD-19%<br>'
        temp += 'Lv90-95 技能CD-19%<br>'
        temp += '攻击速度 +20%<br>'
        temp += '移动速度 +20%<br>'
        return temp       

class 装备68():
    名称 = '天将军：传承之光'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '光枪'
    力量 = 81
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.1)
        属性.暴击伤害加成(0.34)
        属性.最终伤害加成(0.2)
        属性.技能攻击力加成(0.38)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1414<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +10%<br>'
        temp += '暴击伤害 +34%<br>'
        temp += '最终伤害 +20%<br>'
        temp += '技能攻击力 +38%<br>'
        return temp     

class 装备69():
    名称 = '魅影飞龙'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '暗矛'
    力量 = 81
    智力 = 122
    物理攻击力 = 1167
    魔法攻击力 = 1290
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.26)
        属性.暴击伤害加成(0.35)
        属性.技能攻击力加成(0.38)
        属性.单技能修改('暗蚀螺旋枪',1.315316871,1)
        属性.单技能修改('暗蚀爆雷杀',1.144086022,1)
        属性.单技能修改('无尽侵蚀：缚魂',1.134989433,1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.移动速度 += 0.1
        属性.释放速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1290<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +26%<br>'
        temp += '暴击伤害 +35%<br>'
        temp += '技能攻击力 +38%<br>'
        temp += '暗蚀螺旋枪攻击力 +31.53%<br>'
        temp += '暗蚀爆雷杀攻击力 +14.40%<br>'
        temp += '无尽侵蚀：缚魂攻击力 +13.50%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +10%<br>'
        return temp     

class 装备70():
    名称 = '夜天刀'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '长刀'
    力量 = 81
    智力 = 81
    物理攻击力 = 1328
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.属性附加加成(0.14)
        属性.最终伤害加成(0.29)
        属性.技能攻击力加成(0.16)
        属性.单技能等级加成('B.G枪刃改造',3)
        属性.单技能等级加成('B.C精锐特训',3)
        属性.单技能等级加成('电光飞掠',2)
        属性.单技能等级加成('集结·暮光之翼',2)
        属性.技能等级加成('所有',100,100,2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1328<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '属性附加 +14%<br>'
        temp += '最终伤害 +29%<br>'
        temp += '技能攻击力 +16%<br>'
        temp += 'B.G枪刃改造 Lv+3<br>'
        temp += 'B.C精锐特训 Lv+3<br>'
        temp += '电光飞掠 Lv+2<br>'
        temp += '集结·暮光之翼 Lv+2<br>'
        temp += 'Lv100 技能等级+2<br>'
        return temp    

class 装备71():
    名称 = '冥焰黑暗之触'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '小太刀'
    力量 = 81
    智力 = 41
    物理攻击力 = 1229
    魔法攻击力 = 1229
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.23)
        属性.暴击伤害加成(0.3)
        属性.附加伤害加成(0.14)
        属性.技能攻击力加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.06
        属性.魔法暴击率 += 0.06
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +41<br>'
        temp += '物理攻击力 +1229<br>'
        temp += '魔法攻击力 +1229<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +23%<br>'
        temp += '暴击伤害 +30%<br>'
        temp += '附加伤害 +14%<br>'
        temp += '技能攻击力 +35%<br>'
        temp += '物理暴击率 +6%<br>'
        temp += '魔法暴击率 +6%<br>'
        return temp      

class 装备72():
    名称 = '爆烈红焰'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '重剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.17)
        属性.属性附加加成(0.2)
        属性.最终伤害加成(0.15)
        属性.技能攻击力加成(0.28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1475<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '附加伤害 +17%<br>'
        temp += '属性附加 +20%<br>'
        temp += '最终伤害 +15%<br>'
        temp += '技能攻击力 +28%<br>'
        return temp       

class 装备73():
    名称 = '谍影：超级核心'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '源力剑'
    力量 = 0
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.22)
        属性.暴击伤害加成(0.2)
        属性.最终伤害加成(0.2)
        属性.技能攻击力加成(0.08)
        属性.单技能等级加成('源力剑精通',3)
        try:
            属性.技能栏[属性.技能序号['源力剑精通']].谍影专用倍率 = 2
        except:
            pass
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1414<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +22%<br>'
        temp += '暴击伤害 +20%<br>'
        temp += '最终伤害 +20%<br>'
        temp += '技能攻击力 +8%<br>'
        temp += '源力剑精通 Lv+3<br>'
        temp += '源力剑精通数值翻倍<br>'
        return temp
#endregion

# region 智慧产物武器

class 飘零之花武器():
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    物攻成长 = 0
    魔攻成长 = 0
    独立成长 = 115
    力智成长 = 20
    def 城镇属性(self, 属性):
        改造等级 = 属性.获取改造(self.部位)
        属性.技能攻击力加成(0.35)
        属性.附加伤害加成(0.50)
        属性.百分比力智加成(0.20)
        属性.物理攻击力 += self.物攻成长 * 改造等级
        属性.魔法攻击力 += self.魔攻成长 * 改造等级
        属性.独立攻击力 += self.独立成长 * 改造等级
        属性.力量 += self.力智成长 * 改造等级
        属性.智力 += self.力智成长 * 改造等级
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if self.力量 != 0:
            temp += '力量 +' + str(self.力量) + '<br>'
        if self.智力 != 0:
            temp += '智力 +' + str(self.智力) + '<br>'
        temp += '物理攻击力 +' + str(self.物理攻击力) + '<br>'
        temp += '魔法攻击力 +' + str(self.魔法攻击力) + '<br>'
        temp += '独立攻击力 +' + str(self.独立攻击力) + '<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 5:
            temp += '技能攻击力 +35%<br>'
            temp += '附加伤害 +50%<br>'
            temp += '百分比力智 +20%<br>'
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '力量 +' + str(self.力智成长 * 改造等级) + '<br>'
            temp += '智力 +' + str(self.力智成长 * 改造等级) + '<br>'
            temp += '物理攻击力 +' + str(self.物攻成长 * 改造等级) + '<br>'
            temp += '魔法攻击力 +' + str(self.魔攻成长 * 改造等级) + '<br>'
            temp += '独立攻击力 +' + str(self.独立成长 * 改造等级) + '<br>'
        return temp        

class 装备251(飘零之花武器):
    名称 = '飘零之花手炮'
    类型 = '手炮'
    力量 = 122
    智力 = 0
    物理攻击力 = 1346
    魔法攻击力 = 768
    独立攻击力 = 711
    物攻成长 = 188
    魔攻成长 = 181

class 装备257(飘零之花武器):
    名称 = '飘零之花巨剑'
    类型 = '巨剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1375
    魔法攻击力 = 1005
    独立攻击力 = 711
    物攻成长 = 190
    魔攻成长 = 185

class 装备258(飘零之花武器):
    名称 = '飘零之花手弩'
    类型 = '手弩'
    力量 = 81
    智力 = 41
    物理攻击力 = 942
    魔法攻击力 = 1057
    独立攻击力 = 711
    物攻成长 = 183
    魔攻成长 = 184


class 装备259(飘零之花武器):
    名称 = '飘零之花步枪'
    类型 = '步枪'
    力量 = 81
    智力 = 122
    物理攻击力 = 1231
    魔法攻击力 = 1057
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 184

class 装备260(飘零之花武器):
    名称 = '飘零之花十字架'
    类型 = '十字架'
    力量 = 0
    智力 = 81
    物理攻击力 = 1129
    魔法攻击力 = 1067
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 186

class 装备261(飘零之花武器):
    名称 = '飘零之花短剑'
    类型 = '短剑'
    力量 = 0
    智力 = 81
    物理攻击力 = 1067
    魔法攻击力 = 1313
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 189

class 装备262(飘零之花武器):
    名称 = '飘零之花钝器'
    类型 = '钝器'
    力量 = 122
    智力 = 0
    物理攻击力 = 1252
    魔法攻击力 = 1067
    独立攻击力 = 711
    物攻成长 = 188
    魔攻成长 = 186

class 装备263(飘零之花武器):
    名称 = '飘零之花法杖'
    类型 = '法杖'
    力量 = 0
    智力 = 81
    物理攻击力 = 1067
    魔法攻击力 = 1375
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 190

class 装备264(飘零之花武器):
    名称 = '飘零之花光剑'
    类型 = '光剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1043
    魔法攻击力 = 1005
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 185

class 装备265(飘零之花武器):
    名称 = '飘零之花棍棒'
    类型 = '棍棒'
    力量 = 81
    智力 = 81
    物理攻击力 = 1228
    魔法攻击力 = 1005
    独立攻击力 = 711
    物攻成长 = 188
    魔攻成长 = 185
    def 城镇属性(self, 属性):
        super().城镇属性(属性)
        if 属性.职业 == '战斗法师':
            属性.魔法攻击力 += (self.物攻成长 - self.魔攻成长)* 属性.获取改造(self.部位)
        pass     

class 装备266(飘零之花武器):
    名称 = '飘零之花矛'
    类型 = '矛'
    力量 = 122
    智力 = 0
    物理攻击力 = 1375
    魔法攻击力 = 945
    独立攻击力 = 711
    物攻成长 = 190
    魔攻成长 = 184
    def 城镇属性(self, 属性):
        super().城镇属性(属性)
        if 属性.职业 == '战斗法师':
            属性.魔法攻击力 += (self.物攻成长 - self.魔攻成长)* 属性.获取改造(self.部位)
        pass       

class 装备267(飘零之花武器):
    名称 = '飘零之花魔杖'
    类型 = '魔杖'
    力量 = 0
    智力 = 122
    物理攻击力 = 1005
    魔法攻击力 = 1252
    独立攻击力 = 711
    物攻成长 = 185
    魔攻成长 = 188

class 装备268(飘零之花武器):
    名称 = '飘零之花拳套'
    类型 = '拳套'
    力量 = 81
    智力 = 0
    物理攻击力 = 1190
    魔法攻击力 = 1067
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 186

class 装备269(飘零之花武器):
    名称 = '飘零之花扫把'
    类型 = '扫把'
    力量 = 0
    智力 = 81
    物理攻击力 = 1129
    魔法攻击力 = 1252
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 188

class 装备270(飘零之花武器):
    名称 = '飘零之花手套'
    类型 = '手套'
    力量 = 0
    智力 = 81
    物理攻击力 = 1067
    魔法攻击力 = 1313
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 189

class 装备271(飘零之花武器):
    名称 = '飘零之花太刀'
    类型 = '太刀'
    力量 = 81
    智力 = 122
    物理攻击力 = 1067
    魔法攻击力 = 1190
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 187
    def 城镇属性(self, 属性):
        super().城镇属性(属性)
        if 属性.职业 == '剑影':
            属性.物理攻击力 += (self.魔攻成长 - self.物攻成长)* 属性.获取改造(self.部位)
        pass    

class 装备272(飘零之花武器):
    名称 = '飘零之花爪'
    类型 = '爪'
    力量 = 81
    智力 = 41
    物理攻击力 = 1129
    魔法攻击力 = 1129
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 187    

class 装备273(飘零之花武器):
    名称 = '飘零之花左轮枪'
    类型 = '左轮枪'
    力量 = 81
    智力 = 0
    物理攻击力 = 1137
    魔法攻击力 = 942
    独立攻击力 = 711
    物攻成长 = 185
    魔攻成长 = 183

class 装备371(飘零之花武器):
    名称 = '飘零之花念珠'
    类型 = '念珠'
    力量 = 0
    智力 = 122
    物理攻击力 = 1005
    魔法攻击力 = 1313
    独立攻击力 = 711
    物攻成长 = 185
    魔攻成长 = 189

class 装备372(飘零之花武器):
    名称 = '飘零之花图腾'
    类型 = '图腾'
    力量 = 122
    智力 = 0
    物理攻击力 = 1190
    魔法攻击力 = 1005
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 185

class 装备373(飘零之花武器):
    名称 = '飘零之花镰刀'
    类型 = '镰刀'
    力量 = 81
    智力 = 81
    物理攻击力 = 1067
    魔法攻击力 = 1129
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 187

class 装备374(飘零之花武器):
    名称 = '飘零之花战斧'
    类型 = '战斧'
    力量 = 81
    智力 = 0
    物理攻击力 = 1375
    魔法攻击力 = 945
    独立攻击力 = 711
    物攻成长 = 190
    魔攻成长 = 184

class 装备375(飘零之花武器):
    名称 = '飘零之花暗矛'
    类型 = '暗矛'
    力量 = 81
    智力 = 122
    物理攻击力 = 1067
    魔法攻击力 = 1190
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 187

class 装备376(飘零之花武器):
    名称 = '飘零之花匕首'
    类型 = '匕首'
    力量 = 81
    智力 = 0
    物理攻击力 = 1067
    魔法攻击力 = 1005
    独立攻击力 = 711
    物攻成长 = 185
    魔攻成长 = 185

class 装备377(飘零之花武器):
    名称 = '飘零之花臂铠'
    类型 = '臂铠'
    力量 = 81
    智力 = 0
    物理攻击力 = 1190
    魔法攻击力 = 1067
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 186

class 装备378(飘零之花武器):
    名称 = '飘零之花东方棍'
    类型 = '东方棍'
    力量 = 81
    智力 = 122
    物理攻击力 = 1067
    魔法攻击力 = 1129
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 187

class 装备379(飘零之花武器):
    名称 = '飘零之花光枪'
    类型 = '光枪'
    力量 = 81
    智力 = 81
    物理攻击力 = 1067
    魔法攻击力 = 1313
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 189

class 装备380(飘零之花武器):
    名称 = '飘零之花苦无'
    类型 = '苦无'
    力量 = 0
    智力 = 122
    物理攻击力 = 928
    魔法攻击力 = 1252
    独立攻击力 = 711
    物攻成长 = 185
    魔攻成长 = 188

class 装备381(飘零之花武器):
    名称 = '飘零之花手杖'
    类型 = '手杖'
    力量 = 0
    智力 = 81
    物理攻击力 = 986
    魔法攻击力 = 1313
    独立攻击力 = 711
    物攻成长 = 184
    魔攻成长 = 189

class 装备382(飘零之花武器):
    名称 = '飘零之花双剑'
    类型 = '双剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1243
    魔法攻击力 = 883
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 184

class 装备383(飘零之花武器):
    名称 = '飘零之花小太刀'
    类型 = '小太刀'
    力量 = 81
    智力 = 41
    物理攻击力 = 1129
    魔法攻击力 = 1129
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 187

class 装备384(飘零之花武器):
    名称 = '飘零之花源力剑'
    类型 = '源力剑'
    力量 = 0
    智力 = 81
    物理攻击力 = 1067
    魔法攻击力 = 1313
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 189

class 装备385(飘零之花武器):
    名称 = '飘零之花战戟'
    类型 = '战戟'
    力量 = 81
    智力 = 0
    物理攻击力 = 1375
    魔法攻击力 = 945
    独立攻击力 = 711
    物攻成长 = 190
    魔攻成长 = 184

class 装备386(飘零之花武器):
    名称 = '飘零之花长刀'
    类型 = '长刀'
    力量 = 81
    智力 = 81
    物理攻击力 = 1228
    魔法攻击力 = 1005
    独立攻击力 = 711
    物攻成长 = 188
    魔攻成长 = 185

class 装备387(飘零之花武器):
    名称 = '飘零之花长枪'
    类型 = '长枪'
    力量 = 122
    智力 = 0
    物理攻击力 = 1190
    魔法攻击力 = 1005
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 185

class 装备388(飘零之花武器):
    名称 = '飘零之花重剑'
    类型 = '重剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1375
    魔法攻击力 = 1005
    独立攻击力 = 711
    物攻成长 = 190
    魔攻成长 = 185

class 装备389(飘零之花武器):
    名称 = '飘零之花自动手枪'
    类型 = '自动手枪'
    力量 = 0
    智力 = 81
    物理攻击力 = 768
    魔法攻击力 = 1173
    独立攻击力 = 711
    物攻成长 = 181
    魔攻成长 = 186
# endregion

#region  夜语黑瞳武器

class 夜语黑瞳武器():
    模式 = 普雷武器显示
    所属套装 = '无'
    等级 = 95
    品质 = '史诗'
    部位 = '武器'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.32)
        属性.技能攻击力加成(0.55)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if self.力量 != 0:
            temp += '力量 +' + str(self.力量) + '<br>'
        if self.智力 != 0:
            temp += '智力 +' + str(self.智力) + '<br>'
        temp += '物理攻击力 +' + str(self.物理攻击力) + '<br>'
        temp += '魔法攻击力 +' + str(self.魔法攻击力) + '<br>'
        temp += '独立攻击力 +' + str(self.独立攻击力) + '<br>'
        temp += '技能攻击力 +55%<br>'
        temp += '最终伤害 +32%<br>'
        return temp      

class 装备274(夜语黑瞳武器):
    名称 = '界·夜语黑瞳短剑'
    类型 = '短剑'
    力量 = 0
    智力 = 78
    物理攻击力 = 1112
    魔法攻击力 = 1346
    独立攻击力 = 723

class 装备275(夜语黑瞳武器):
    名称 = '界·夜语黑瞳太刀'
    类型 = '太刀'
    力量 = 78
    智力 = 117
    物理攻击力 = 1112
    魔法攻击力 = 1230
    独立攻击力 = 723

class 装备276(夜语黑瞳武器):
    名称 = '界·夜语黑瞳钝器'
    类型 = '钝器'
    力量 = 117
    智力 = 0
    物理攻击力 = 1288
    魔法攻击力 = 1112
    独立攻击力 = 723

class 装备277(夜语黑瞳武器):
    名称 = '界·夜语黑瞳巨剑'
    类型 = '巨剑'
    力量 = 78
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备278(夜语黑瞳武器):
    名称 = '界·夜语黑瞳光剑'
    类型 = '光剑'
    力量 = 78
    智力 = 0
    物理攻击力 = 1089
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备279(夜语黑瞳武器):
    名称 = '界·夜语黑瞳手套'
    类型 = '手套'
    力量 = 0
    智力 = 78
    物理攻击力 = 1112
    魔法攻击力 = 1346
    独立攻击力 = 723

class 装备280(夜语黑瞳武器):
    名称 = '界·夜语黑瞳臂铠'
    类型 = '臂铠'
    力量 = 117
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备281(夜语黑瞳武器):
    名称 = '界·夜语黑瞳利爪'
    类型 = '爪'
    力量 = 78
    智力 = 39
    物理攻击力 = 1172
    魔法攻击力 = 1172
    独立攻击力 = 723

class 装备282(夜语黑瞳武器):
    名称 = '界·夜语黑瞳拳套'
    类型 = '拳套'
    力量 = 78
    智力 = 0
    物理攻击力 = 1230
    魔法攻击力 = 1112
    独立攻击力 = 723

class 装备283(夜语黑瞳武器):
    名称 = '界·夜语黑瞳东方棍'
    类型 = '东方棍'
    力量 = 78
    智力 = 117
    物理攻击力 = 1112
    魔法攻击力 = 1172
    独立攻击力 = 723

class 装备284(夜语黑瞳武器):
    名称 = '界·夜语黑瞳左轮枪'
    类型 = '左轮枪'
    力量 = 78
    智力 = 0
    物理攻击力 = 1176
    魔法攻击力 = 989
    独立攻击力 = 723

class 装备285(夜语黑瞳武器):
    名称 = '界·夜语黑瞳自动手枪'
    类型 = '自动手枪'
    力量 = 0
    智力 = 78
    物理攻击力 = 825
    魔法攻击力 = 1209
    独立攻击力 = 723

class 装备286(夜语黑瞳武器):
    名称 = '界·夜语黑瞳步枪'
    类型 = '步枪'
    力量 = 78
    智力 = 117
    物理攻击力 = 1264
    魔法攻击力 = 1099
    独立攻击力 = 723

class 装备287(夜语黑瞳武器):
    名称 = '界·夜语黑瞳手炮'
    类型 = '手炮'
    力量 = 117
    智力 = 0
    物理攻击力 = 1374
    魔法攻击力 = 825
    独立攻击力 = 723

class 装备288(夜语黑瞳武器):
    名称 = '界·夜语黑瞳手弩'
    类型 = '手弩'
    力量 = 78
    智力 = 39
    物理攻击力 = 989
    魔法攻击力 = 1099
    独立攻击力 = 723

class 装备289(夜语黑瞳武器):
    名称 = '界·夜语黑瞳矛'
    类型 = '矛'
    力量 = 117
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 996
    独立攻击力 = 723

class 装备290(夜语黑瞳武器):
    名称 = '界·夜语黑瞳棍棒'
    类型 = '棍棒'
    力量 = 78
    智力 = 78
    物理攻击力 = 1265
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备291(夜语黑瞳武器):
    名称 = '界·夜语黑瞳魔杖'
    类型 = '魔杖'
    力量 = 0
    智力 = 117
    物理攻击力 = 1054
    魔法攻击力 = 1288
    独立攻击力 = 723

class 装备292(夜语黑瞳武器):
    名称 = '界·夜语黑瞳法杖'
    类型 = '法杖'
    力量 = 0
    智力 = 78
    物理攻击力 = 1112
    魔法攻击力 = 1406
    独立攻击力 = 723

class 装备293(夜语黑瞳武器):
    名称 = '界·夜语黑瞳扫把'
    类型 = '扫把'
    力量 = 0
    智力 = 78
    物理攻击力 = 1172
    魔法攻击力 = 1288
    独立攻击力 = 723

class 装备294(夜语黑瞳武器):
    名称 = '界·夜语黑瞳十字架'
    类型 = '十字架'
    力量 = 0
    智力 = 78
    物理攻击力 = 1172
    魔法攻击力 = 1112
    独立攻击力 = 723

class 装备295(夜语黑瞳武器):
    名称 = '界·夜语黑瞳念珠'
    类型 = '念珠'
    力量 = 0
    智力 = 117
    物理攻击力 = 1054
    魔法攻击力 = 1346
    独立攻击力 = 723

class 装备296(夜语黑瞳武器):
    名称 = '界·夜语黑瞳图腾'
    类型 = '图腾'
    力量 = 117
    智力 = 0
    物理攻击力 = 1230
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备297(夜语黑瞳武器):
    名称 = '界·夜语黑瞳镰刀'
    类型 = '镰刀'
    力量 = 78
    智力 = 78
    物理攻击力 = 1112
    魔法攻击力 = 1172
    独立攻击力 = 723

class 装备298(夜语黑瞳武器):
    名称 = '界·夜语黑瞳战斧'
    类型 = '战斧'
    力量 = 78
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 996
    独立攻击力 = 723

class 装备299(夜语黑瞳武器):
    名称 = '界·夜语黑瞳匕首'
    类型 = '匕首'
    力量 = 78
    智力 = 0
    物理攻击力 = 1109
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备300(夜语黑瞳武器):
    名称 = '界·夜语黑瞳双剑'
    类型 = '双剑'
    力量 = 78
    智力 = 0
    物理攻击力 = 1278
    魔法攻击力 = 937
    独立攻击力 = 723

class 装备301(夜语黑瞳武器):
    名称 = '界·夜语黑瞳手杖'
    类型 = '手杖'
    力量 = 0
    智力 = 78
    物理攻击力 = 1032
    魔法攻击力 = 1346
    独立攻击力 = 723

class 装备302(夜语黑瞳武器):
    名称 = '界·夜语黑瞳苦无'
    类型 = '苦无'
    力量 = 0
    智力 = 117
    物理攻击力 = 977
    魔法攻击力 = 1288
    独立攻击力 = 723

class 装备303(夜语黑瞳武器):
    名称 = '界·夜语黑瞳长枪'
    类型 = '长枪'
    力量 = 117
    智力 = 0
    物理攻击力 = 1230
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备304(夜语黑瞳武器):
    名称 = '界·夜语黑瞳战戟'
    类型 = '战戟'
    力量 = 78
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 996
    独立攻击力 = 723

class 装备305(夜语黑瞳武器):
    名称 = '界·夜语黑瞳光枪'
    类型 = '光枪'
    力量 = 78
    智力 = 78
    物理攻击力 = 1112
    魔法攻击力 = 1346
    独立攻击力 = 723

class 装备306(夜语黑瞳武器):
    名称 = '界·夜语黑瞳暗矛'
    类型 = '暗矛'
    力量 = 78
    智力 = 117
    物理攻击力 = 1112
    魔法攻击力 = 1230
    独立攻击力 = 723

class 装备307(夜语黑瞳武器):
    名称 = '界·夜语黑瞳长刀'
    类型 = '长刀'
    力量 = 78
    智力 = 78
    物理攻击力 = 1265
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备308(夜语黑瞳武器):
    名称 = '界·夜语黑瞳小太刀'
    类型 = '小太刀'
    力量 = 78
    智力 = 39
    物理攻击力 = 1172
    魔法攻击力 = 1172
    独立攻击力 = 723

class 装备309(夜语黑瞳武器):
    名称 = '界·夜语黑瞳重剑'
    类型 = '重剑'
    力量 = 78
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备310(夜语黑瞳武器):
    名称 = '界·夜语黑瞳源力剑'
    类型 = '源力剑'
    力量 = 0
    智力 = 78
    物理攻击力 = 1112
    魔法攻击力 = 1346
    独立攻击力 = 723
#endregion

#region  暗黑圣战之溯回武器
class 暗黑圣战之溯回武器():
    模式 = 1
    所属套装 = '无'
    等级 = 100
    品质 = '传说'
    部位 = '武器'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.30)
        属性.技能攻击力加成(0.52)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if self.力量 != 0:
            temp += '力量 +' + str(self.力量) + '<br>'
        if self.智力 != 0:
            temp += '智力 +' + str(self.智力) + '<br>'
        temp += '物理攻击力 +' + str(self.物理攻击力) + '<br>'
        temp += '魔法攻击力 +' + str(self.魔法攻击力) + '<br>'
        temp += '独立攻击力 +' + str(self.独立攻击力) + '<br>'
        temp += '技能攻击力 +52%<br>'
        temp += '最终伤害 +30%<br>'
        return temp        

class 装备491(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：短剑'
    类型 = '短剑'
    力量 = 0
    智力 = 78
    物理攻击力 = 1113
    魔法攻击力 = 1348
    独立攻击力 = 719

class 装备492(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：太刀'
    类型 = '太刀'
    力量 = 78
    智力 = 117
    物理攻击力 = 1113
    魔法攻击力 = 1230
    独立攻击力 = 719

class 装备493(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：钝器'
    类型 = '钝器'
    力量 = 117
    智力 = 0
    物理攻击力 = 1289
    魔法攻击力 = 1113
    独立攻击力 = 719

class 装备494(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：巨剑'
    类型 = '巨剑'
    力量 = 78
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备495(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：光剑'
    类型 = '光剑'
    力量 = 78
    智力 = 0
    物理攻击力 = 1089
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备496(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：手套'
    类型 = '手套'
    力量 = 0
    智力 = 78
    物理攻击力 = 1113
    魔法攻击力 = 1348
    独立攻击力 = 719

class 装备497(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：臂铠'
    类型 = '臂铠'
    力量 = 117
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备498(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：爪'
    类型 = '爪'
    力量 = 78
    智力 = 39
    物理攻击力 = 1172
    魔法攻击力 = 1172
    独立攻击力 = 719

class 装备499(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：拳套'
    类型 = '拳套'
    力量 = 78
    智力 = 0
    物理攻击力 = 1230
    魔法攻击力 = 1113
    独立攻击力 = 719

class 装备500(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：东方棍'
    类型 = '东方棍'
    力量 = 78
    智力 = 117
    物理攻击力 = 1113
    魔法攻击力 = 1172
    独立攻击力 = 719

class 装备501(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：左轮枪'
    类型 = '左轮枪'
    力量 = 78
    智力 = 0
    物理攻击力 = 1178
    魔法攻击力 = 991
    独立攻击力 = 719

class 装备502(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：自动手枪'
    类型 = '自动手枪'
    力量 = 0
    智力 = 78
    物理攻击力 = 826
    魔法攻击力 = 1211
    独立攻击力 = 719

class 装备503(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：步枪'
    类型 = '步枪'
    力量 = 78
    智力 = 117
    物理攻击力 = 1266
    魔法攻击力 = 1101
    独立攻击力 = 719

class 装备504(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：手炮'
    类型 = '手炮'
    力量 = 117
    智力 = 0
    物理攻击力 = 1376
    魔法攻击力 = 826
    独立攻击力 = 719

class 装备505(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：手弩'
    类型 = '手弩'
    力量 = 78
    智力 = 39
    物理攻击力 = 991
    魔法攻击力 = 1101
    独立攻击力 = 719

class 装备506(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：矛'
    类型 = '矛'
    力量 = 117
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 996
    独立攻击力 = 719

class 装备507(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：棍棒'
    类型 = '棍棒'
    力量 = 78
    智力 = 78
    物理攻击力 = 1265
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备508(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：魔杖'
    类型 = '魔杖'
    力量 = 0
    智力 = 117
    物理攻击力 = 1055
    魔法攻击力 = 1289
    独立攻击力 = 719

class 装备509(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：法杖'
    类型 = '法杖'
    力量 = 0
    智力 = 78
    物理攻击力 = 1113
    魔法攻击力 = 1406
    独立攻击力 = 719

class 装备510(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：扫把'
    类型 = '扫把'
    力量 = 0
    智力 = 78
    物理攻击力 = 1172
    魔法攻击力 = 1289
    独立攻击力 = 719

class 装备511(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：十字架'
    类型 = '十字架'
    力量 = 0
    智力 = 78
    物理攻击力 = 1172
    魔法攻击力 = 1113
    独立攻击力 = 719

class 装备512(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：念珠'
    类型 = '念珠'
    力量 = 0
    智力 = 117
    物理攻击力 = 1055
    魔法攻击力 = 1348
    独立攻击力 = 719

class 装备513(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：图腾'
    类型 = '图腾'
    力量 = 117
    智力 = 0
    物理攻击力 = 1230
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备514(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：镰刀'
    类型 = '镰刀'
    力量 = 78
    智力 = 78
    物理攻击力 = 1113
    魔法攻击力 = 1172
    独立攻击力 = 719

class 装备515(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：战斧'
    类型 = '战斧'
    力量 = 78
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 996
    独立攻击力 = 719

class 装备516(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：匕首'
    类型 = '匕首'
    力量 = 78
    智力 = 0
    物理攻击力 = 1110
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备517(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：双剑'
    类型 = '双剑'
    力量 = 78
    智力 = 0
    物理攻击力 = 1279
    魔法攻击力 = 937
    独立攻击力 = 719

class 装备518(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：手杖'
    类型 = '手杖'
    力量 = 0
    智力 = 78
    物理攻击力 = 1033
    魔法攻击力 = 1348
    独立攻击力 = 719

class 装备519(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：苦无'
    类型 = '苦无'
    力量 = 0
    智力 = 117
    物理攻击力 = 979
    魔法攻击力 = 1289
    独立攻击力 = 719

class 装备520(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：长枪'
    类型 = '长枪'
    力量 = 117
    智力 = 0
    物理攻击力 = 1230
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备521(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：战戟'
    类型 = '战戟'
    力量 = 78
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 996
    独立攻击力 = 719

class 装备522(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：光枪'
    类型 = '光枪'
    力量 = 78
    智力 = 78
    物理攻击力 = 1113
    魔法攻击力 = 1348
    独立攻击力 = 719

class 装备523(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：暗矛'
    类型 = '暗矛'
    力量 = 78
    智力 = 117
    物理攻击力 = 1113
    魔法攻击力 = 1230
    独立攻击力 = 719

class 装备524(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：长刀'
    类型 = '长刀'
    力量 = 78
    智力 = 78
    物理攻击力 = 1265
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备525(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：小太刀'
    类型 = '小太刀'
    力量 = 78
    智力 = 39
    物理攻击力 = 1172
    魔法攻击力 = 1172
    独立攻击力 = 719

class 装备526(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：重剑'
    类型 = '重剑'
    力量 = 78
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备527(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：源力剑'
    类型 = '源力剑'
    力量 = 0
    智力 = 78
    物理攻击力 = 1113
    魔法攻击力 = 1348
    独立攻击力 = 719

#endregion