from .basic_equ import *

#region  100SS防具 
class 装备74(装备):
    名称 = '魔法师[???]的长袍'
    模式 = 0
    所属套装 = '遗忘魔法师的馈赠'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.05)
        self.属性描述 += 属性.百分比三攻加成(0.1)
        self.属性描述 += 属性.最终伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有',1,45,1)
        pass
    def 其它属性(self, 属性):
        pass      
    def 进图属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有',1,45,1)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=180)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
        pass
    

class 装备75(装备):
    名称 = '死亡阴影夹克'
    模式 = 0
    所属套装 = '死亡阴影'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.04)
        self.属性描述 += 属性.伤害增加加成(0.18)
        self.属性描述 += 属性.暴击伤害加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=180)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFFLv=1)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
        pass
    

class 装备76(装备):
    名称 = '燃烧烈焰之勇气'
    模式 = 0
    所属套装 = '贫瘠沙漠的遗产'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(属性.技能栏空位 / 100)
        self.属性描述 += 属性.暴击伤害加成(0.28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass   
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
        pass
    

class 装备77(装备):
    名称 = '撒旦：沸腾之怒'
    模式 = 0
    所属套装 = '噩梦：地狱之路'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.16)
        self.属性描述 += 属性.暴击伤害加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
    

class 装备78(装备):
    名称 = '奔流不息之岁月'
    模式 = 0
    所属套装 = '永恒不息之路'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.32)
        if 属性.职业 == '缔造者':
            self.属性描述 += 属性.技能倍率加成(50, -0.3)
            self.属性描述 += 属性.技能恢复加成(50, 50, 1.00)
        else:
            self.属性描述 += 属性.技能倍率加成(45, -0.3)
            self.属性描述 += 属性.技能恢复加成(45, 45, 1.00)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass   
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
    

class 装备79(装备):
    名称 = '优雅旋律华尔兹'
    模式 = 0
    所属套装 = '天堂舞姬'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.14) 
        # self.属性描述 += 属性.伤害增加加成(0.09)     
        # self.属性描述 += 属性.技能攻击力加成(0.1) 
        self.属性描述 += 属性.伤害增加加成(0.17)
        # self.属性描述 += 属性.暴击伤害加成(0.14)
        self.属性描述 += 属性.技能冷却缩减(1, 45, 0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=200)
        self.属性描述 += 属性.被动增加(转职被动智力=100)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
     

class 装备80(装备):
    名称 = '首席执行官裁决夹克'
    模式 = 0
    所属套装 = '皇家裁决者宣言'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.19)
        self.属性描述 += 属性.暴击伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass   
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
    

class 装备81(装备):
    名称 = '炙炎：火龙果'
    模式 = 0
    所属套装 = '炙炎之盛宴'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.16)
        self.属性描述 += 属性.暴击伤害加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.1)
        pass   
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=200)
        self.属性描述 += 属性.被动增加(转职被动智力=100)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.02, BUFF智力per=1.02)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)

class 装备82(装备):
    名称 = '妖精之姿'
    模式 = 0
    所属套装 = '传奇铁匠-封神'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.1)
        pass    
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=241)
        self.属性描述 += 属性.被动增加(转职被动智力=141)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
    

class 装备83(装备):
    名称 = '人性的抉择'
    模式 = 0
    所属套装 = '命运歧路'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.11)
        self.属性描述 += 属性.伤害增加加成(0.21)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=280)
        self.属性描述 += 属性.被动增加(转职被动智力=180)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
        pass
    

class 装备84(装备):
    名称 = '大祭司的星祈礼袍'
    模式 = 0
    所属套装 = '古代祭祀的神圣仪式'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.1)
        self.属性描述 += 属性.百分比三攻加成(0.1)
        self.属性描述 += 属性.最终伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass   
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
    

class 装备85(装备):
    名称 = '冲锋陷阵胸甲'
    模式 = 0
    所属套装 = '龙血玄黄'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            self.属性描述 += 属性.百分比三攻加成(0.35)
        else:
            self.属性描述 += 属性.百分比三攻加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=263)
        self.属性描述 += 属性.被动增加(转职被动智力=163)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
      

class 装备86(装备):
    名称 = '气吞山河战甲'
    模式 = 0
    所属套装 = '擎天战甲'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.34)
        if 属性.职业 == '缔造者':
            self.属性描述 += 属性.技能等级加成('所有', 50, 50, 2)
        else:
            self.属性描述 += 属性.技能等级加成('所有', 45, 45, 2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 城镇属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 45, 45, 2)
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=263)
        self.属性描述 += 属性.被动增加(转职被动智力=163)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
    

class 装备87(装备):
    名称 = '千链锁灵战甲'
    模式 = 0
    所属套装 = '荆棘漫天'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass  
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
    

class 装备88(装备):
    名称 = '宽恕坚韧之地'
    模式 = 0
    所属套装 = '大自然的呼吸'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.28)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(24)
        pass
    def 其它属性(self, 属性):
        pass   
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=242)
        self.属性描述 += 属性.被动增加(转职被动智力=142)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
    

class 装备89(装备):
    名称 = '堕落深渊黑魔法衬衫'
    模式 = 0
    所属套装 = '深渊窥视者'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=173)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
    

class 装备90(装备):
    名称 = '引路者的黄昏披风'
    模式 = 0
    所属套装 = '圣者的黄昏'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.2)
        self.属性描述 += 属性.百分比三攻加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=236)
        self.属性描述 += 属性.被动增加(转职被动智力=136)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
    

class 装备91(装备):
    名称 = '地狱边缘'
    模式 = 0
    所属套装 = '坎坷命运'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.04)
        self.属性描述 += 属性.移动速度增加(0.04)
        self.属性描述 += 属性.释放速度增加(0.06)
        if 属性.装备检查('悲痛者项链'):
            self.属性描述 += '<font color="#00A2E8">装备悲痛者项链时</font><br>'
            self.属性描述 += 属性.攻击速度增加(-0.01)
            self.属性描述 += 属性.移动速度增加(-0.01)
            self.属性描述 += 属性.释放速度增加(-0.015)
        if 属性.装备检查('悲情者遗物'):
            self.属性描述 += '<font color="#00A2E8">装备悲情者遗物时</font><br>'
            self.属性描述 += 属性.攻击速度增加(-0.01)
            self.属性描述 += 属性.移动速度增加(-0.01)
            self.属性描述 += 属性.释放速度增加(-0.015)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
    

class 装备92(装备):
    名称 = '泣血之恨'
    模式 = 0
    所属套装 = '吞噬愤怒'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.23)
        self.属性描述 += 属性.持续伤害加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass    
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
    

class 装备93(装备):
    名称 = '大魔法师[???]的长袍'
    模式 = 0
    所属套装 = '遗忘魔法师的馈赠'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '布甲'

    属性1描述 = '伤害增加：'
    属性1范围 = [11, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能等级Lv1 -'
    属性2范围 = [45, 5, 5]
    属性2选择 = 0
    属性3描述 = '百分比力智：'
    属性3范围 = [12, 3, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    # 专属属性
    属性1描述_BUFF = 'BUFF力智：'
    属性1范围_BUFF = [11, 1, 1]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = '一觉力智：'
    属性2范围_BUFF = [90, 10, 10]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = '转职被动：'
    属性3范围_BUFF = [200, 20, 20]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '无'
    属性4范围_BUFF = [0, 0, 0]  # 最大值 最小值 间隔
    属性4选择_BUFF = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.14)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'    
        self.属性描述 += 属性.伤害增加加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]) / 100)     
        self.属性描述 += 属性.技能等级加成('所有', 1, (self.属性2范围[0]-self.属性2选择*self.属性2范围[2]), 1)
        self.属性描述 += 属性.百分比力智加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.1)
        self.属性描述 += 属性.百分比力智加成(0.05)
        self.属性描述 += 属性.技能等级加成('所有', 1, 45, 1)
        pass
    def 其它属性(self, 属性):
        pass
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 1, 45, 1)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=180)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.11 - self.属性1选择_BUFF / 100, BUFF智力per=1.11 - self.属性1选择_BUFF / 100)
        self.属性描述 += 属性.技能等级加成('所有', 1, (45 - self.属性2选择_BUFF * 5) , 1)
        self.属性描述 += 属性.觉醒增加(一觉力智=90 - self.属性2选择_BUFF * 10)
        self.属性描述 += 属性.被动增加(守护恩赐体精=200 - self.属性3选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(转职被动智力=100 - self.属性3选择_BUFF * 20)
        
    
class 装备94(装备):
    名称 = '掌管生死之影夹克'
    模式 = 0
    所属套装 = '死亡阴影'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '皮甲'

    属性1描述 = '百分比力智：'
    属性1范围 = [10, 1, 1]
    属性1选择 = 0
    属性2描述 = '暴击伤害：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '物攻/魔攻/独立 +'
    属性3范围 = [170, 80, 10]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    # 专属属性
    属性1描述_BUFF = '一觉力智：'
    属性1范围_BUFF = [100, 10, 10]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = 'BUFF力智：'
    属性2范围_BUFF = [10, 1, 1]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = '一觉被动(120/100)+'
    属性3范围_BUFF = [180, 0, 20]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '无'
    属性4范围_BUFF = [0, 0, 0]  # 最大值 最小值 间隔
    属性4选择_BUFF = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.1)
        self.属性描述 += 属性.百分比三攻加成(0.04)
        self.属性描述 += 属性.伤害增加加成(0.18)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.百分比力智加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]) / 100)
        self.属性描述 += 属性.暴击伤害加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.三攻固定加成( x = (self.属性3范围[0]-self.属性3选择*self.属性3范围[2]))
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=180)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFFLv=1)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.觉醒增加(一觉力智=100 - self.属性1选择_BUFF * 10)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.1 - self.属性2选择_BUFF / 100, BUFF智力per=1.1 - self.属性2选择_BUFF / 100)
        self.属性描述 += 属性.被动增加(信念光环体精=300 - self.属性3选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(一觉被动力智=280 - self.属性3选择_BUFF * 20)    

class 装备95(装备):
    名称 = '爆裂大地之勇猛'
    模式 = 0
    所属套装 = '贫瘠沙漠的遗产'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '轻甲'

    属性1描述 = '百分比三攻：'
    属性1范围 = [8, 1, 1]
    属性1选择 = 0
    属性2描述 = '百分比力智：'
    属性2范围 = [8, 1, 1]
    属性2选择 = 0
    属性3描述 = '暴击伤害：'
    属性3范围 = [15, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    属性1描述_BUFF = '转职被动：'
    属性1范围_BUFF = [240, 100, 20]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = 'BUFF三攻：'
    属性2范围_BUFF = [8, 1, 1]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = '一觉力智：'
    属性3范围_BUFF = [150, 10, 10]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '无'
    属性4范围_BUFF = [0, 0, 0]  # 最大值 最小值 间隔
    属性4选择_BUFF = 0    

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(属性.技能栏空位 / 100)
        self.属性描述 += 属性.暴击伤害加成(0.28 - self.属性3选择 / 100)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.百分比三攻加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]) / 100)
        self.属性描述 += 属性.百分比力智加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.暴击伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass 
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250 - self.属性1选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(转职被动智力=150 - self.属性1选择_BUFF * 20)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.被动增加(守护恩赐体精=240 - self.属性1选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(转职被动智力=240 - self.属性1选择_BUFF * 20)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.08 - self.属性2选择_BUFF / 100, BUFF魔攻per=1.08 - self.属性2选择_BUFF / 100, BUFF独立per=1.08 - self.属性2选择_BUFF / 100)
        self.属性描述 += 属性.觉醒增加(一觉力智=150 - self.属性3选择_BUFF * 10)
    

class 装备96(装备):
    名称 = '撒旦：愤怒之王'
    模式 = 0
    所属套装 = '噩梦：地狱之路'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '重甲'

    属性1描述 = '持续伤害：'
    属性1范围 = [5, 2, 1]
    属性1选择 = 0
    属性2描述 = '暴击伤害：'
    属性2范围 = [7, 1, 1]
    属性2选择 = 0
    属性3描述 = '附加伤害：'
    属性3范围 = [4, 1, 1]
    属性3选择 = 0
    属性4描述 = '伤害增加：'
    属性4范围 = [9, 1, 1]
    属性4选择 = 0

    属性1描述_BUFF = '一觉被动(160/140)+'
    属性1范围_BUFF = [60, 0, 20]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = 'BUFF三攻：'
    属性2范围_BUFF = [7, 1, 1]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = '一觉力智：'
    属性3范围_BUFF = [50, 20, 10]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = 'BUFF力智：'
    属性4范围_BUFF = [9, 1, 1]  # 最大值 最小值 间隔
    属性4选择_BUFF = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.16)
        self.属性描述 += 属性.暴击伤害加成(0.16)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.持续伤害加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]) / 100)
        self.属性描述 += 属性.暴击伤害加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.附加伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        self.属性描述 += 属性.伤害增加加成((self.属性4范围[0]-self.属性4选择*self.属性4范围[2]) / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass 
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.被动增加(信念光环体精=220 - self.属性1选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(一觉被动力智=200 - self.属性1选择_BUFF * 20)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.07 - self.属性2选择_BUFF / 100, BUFF魔攻per=1.07 - self.属性2选择_BUFF / 100, BUFF独立per=1.07 - self.属性2选择_BUFF / 100)        
        self.属性描述 += 属性.觉醒增加(一觉力智=50 - self.属性3选择_BUFF * 10)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.09 - self.属性4选择_BUFF / 100, BUFF智力per=1.09 - self.属性4选择_BUFF / 100)

class 装备97(装备):
    名称 = '英明循环之生命'
    模式 = 0
    所属套装 = '永恒不息之路'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '板甲'

    属性1描述 = '技能等级Lv1 -'
    属性1范围 = [45, 30, 5]
    属性1选择 = 0
    属性2描述 = '附加伤害：'
    属性2范围 = [5, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比力智：'
    属性3范围 = [8, 1, 1]
    属性3选择 = 0
    属性4描述 = '最终伤害：'
    属性4范围 = [6, 1, 1]
    属性4选择 = 0

    属性1描述_BUFF = 'BUFF力智：'
    属性1范围_BUFF = [6, 3, 1]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = '一觉力智：'
    属性2范围_BUFF = [60, 20, 10]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = 'BUFF三攻：'
    属性3范围_BUFF = [9, 2, 1]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '转职被动Lv+'
    属性4范围_BUFF = [6, 1, 1]  # 最大值 最小值 间隔
    属性4选择_BUFF = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.3)
        if 属性.职业 == '缔造者':
            self.属性描述 += 属性.技能倍率加成(50, -0.3)
            self.属性描述 += 属性.技能恢复加成(50, 50, 1.00)
        else:
            self.属性描述 += 属性.技能倍率加成(45, -0.3)
            self.属性描述 += 属性.技能恢复加成(45, 45, 1.00)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.技能等级加成('所有', 1, (self.属性1范围[0]-self.属性1选择*self.属性1范围[2]), 1)
        self.属性描述 += 属性.附加伤害加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.百分比力智加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        self.属性描述 += 属性.最终伤害加成((self.属性4范围[0]-self.属性4选择*self.属性4范围[2]) / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass   
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.技能等级加成('所有', 1, 45 - self.属性1选择_BUFF * 5, 1)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.06 - self.属性1选择_BUFF / 100, BUFF智力per=1.06 - self.属性1选择_BUFF / 100)
        self.属性描述 += 属性.觉醒增加(一觉力智=60 - self.属性2选择_BUFF * 10)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.09 - self.属性3选择_BUFF / 100, BUFF魔攻per=1.09 - self.属性3选择_BUFF / 100, BUFF独立per=1.09 - self.属性3选择_BUFF / 100)
        self.属性描述 += 属性.被动增加(守护恩赐Lv = 6 - self.属性4选择_BUFF)
        self.属性描述 += 属性.被动增加(转职被动Lv = 6 - self.属性4选择_BUFF)

class 装备98(装备):
    名称 = '浪漫旋律华尔兹'
    模式 = 0
    所属套装 = '天堂舞姬'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '布甲'

    属性1描述 = '百分比三攻：'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '最终伤害：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '伤害增加：'
    属性3范围 = [8, 1, 1]
    属性3选择 = 0
    属性4描述 = '所有属性强化 +'
    属性4范围 = [24, 12, 4]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.14) 
        self.属性描述 += 属性.伤害增加加成(0.09)     
        self.属性描述 += 属性.技能攻击力加成(0.1)  
        self.属性描述 += 属性.技能冷却缩减(1, 45, 0.10)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.百分比三攻加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]) / 100)
        self.属性描述 += 属性.最终伤害加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.伤害增加加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        self.属性描述 += 属性.所有属性强化加成(self.属性4范围[0]-self.属性4选择*self.属性4范围[2])
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    属性1描述_BUFF = '一觉被动(120/100)+'
    属性1范围_BUFF = [40, 0, 20]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = '一觉力智：'
    属性2范围_BUFF = [100, 10, 10]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = 'BUFF三攻：'
    属性3范围_BUFF = [8, 1, 1]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '转职被动：'
    属性4范围_BUFF = [140, 80, 20]  # 最大值 最小值 间隔
    属性4选择_BUFF = 0

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=200)
        self.属性描述 += 属性.被动增加(转职被动智力=100)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.被动增加(一觉被动力智=140 - self.属性1选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(信念光环体精=160 - self.属性1选择_BUFF * 20)
        self.属性描述 += 属性.觉醒增加(一觉力智=100 - self.属性2选择_BUFF * 10)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.08 - self.属性3选择_BUFF / 100, BUFF魔攻per=1.08 - self.属性3选择_BUFF / 100, BUFF独立per=1.08 - self.属性3选择_BUFF / 100)
        self.属性描述 += 属性.被动增加(守护恩赐体精=140 - self.属性4选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(转职被动智力=140 - self.属性4选择_BUFF * 20)
    

class 装备99(装备):
    名称 = '皇家裁决者审判外套'
    模式 = 0
    所属套装 = '皇家裁决者宣言'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '皮甲'

    属性1描述 = '暴击伤害：'
    属性1范围 = [7, 1, 1]
    属性1选择 = 0
    属性2描述 = '伤害增加：'
    属性2范围 = [5, 1, 1]
    属性2选择 = 0
    属性3描述 = '附加伤害：'
    属性3范围 = [6, 1, 1]
    属性3选择 = 0
    属性4描述 = '最终伤害：'
    属性4范围 = [5, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.19)
        self.属性描述 += 属性.技能攻击力加成(0.14)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>' 
        self.属性描述 += 属性.暴击伤害加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]) / 100)
        self.属性描述 += 属性.伤害增加加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.附加伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        self.属性描述 += 属性.最终伤害加成((self.属性4范围[0]-self.属性4选择*self.属性4范围[2]) / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    # 专属属性
    属性1描述_BUFF = 'BUFF力智：'
    属性1范围_BUFF = [8, 2, 1]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = 'BUFF三攻：'
    属性2范围_BUFF = [5, 1, 1]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = '一觉力智：'
    属性3范围_BUFF = [60, 10, 10]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '一觉被动(220/200)+'
    属性4范围_BUFF = [80, 0, 20]  # 最大值 最小值 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>' 
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08 - self.属性1选择_BUFF / 100, BUFF智力per=1.08 - self.属性1选择_BUFF / 100)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.05 - self.属性2选择_BUFF / 100, BUFF魔攻per=1.05 - self.属性2选择_BUFF / 100, BUFF独立per=1.05 - self.属性2选择_BUFF / 100)
        self.属性描述 += 属性.被动增加(信念光环体精=300 - self.属性4选择_BUFF * 20)
        self.属性描述 += 属性.觉醒增加(一觉力智=60 - self.属性3选择_BUFF * 10)
        self.属性描述 += 属性.被动增加(一觉被动力智=280 - self.属性4选择_BUFF * 20)
     
class 装备100(装备):
    名称 = '炙炎：霸王树'
    模式 = 0
    所属套装 = '炙炎之盛宴'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '轻甲'

    属性1描述 = '最终伤害：'
    属性1范围 = [10, 1, 1]
    属性1选择 = 0
    属性2描述 = '暴击伤害：'
    属性2范围 = [8, 1, 1]
    属性2选择 = 0
    属性3描述 = '伤害增加：'
    属性3范围 = [4, 1, 1]
    属性3选择 = 0
    属性4描述 = '百分比力智：'
    属性4范围 = [3, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.16)
        self.属性描述 += 属性.暴击伤害加成(0.08)
        self.属性描述 += 属性.技能攻击力加成(0.09)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>' 
        self.属性描述 += 属性.最终伤害加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]) / 100)
        self.属性描述 += 属性.暴击伤害加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.伤害增加加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        self.属性描述 += 属性.百分比力智加成((self.属性4范围[0]-self.属性4选择*self.属性4范围[2]) / 100)        
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.15)
        pass  
    # 专属属性
    属性1描述_BUFF = 'BUFF力智：'
    属性1范围_BUFF = [10, 1, 1]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = '一觉力智：'
    属性2范围_BUFF = [80, 10, 10]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = 'BUFF三攻：'
    属性3范围_BUFF = [4, 1, 1]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '一觉被动(180/160)+'
    属性4范围_BUFF = [40, 0, 20]  # 最大值 最小值 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=200)
        self.属性描述 += 属性.被动增加(转职被动智力=100)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.02, BUFF智力per=1.02)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>' 
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.10 - self.属性1选择_BUFF / 100, BUFF智力per=1.10 - self.属性1选择_BUFF / 100)
        self.属性描述 += 属性.觉醒增加(一觉力智=80 - self.属性2选择_BUFF * 10)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.04 - self.属性3选择_BUFF / 100, BUFF魔攻per=1.04 - self.属性3选择_BUFF / 100, BUFF独立per=1.04 - self.属性3选择_BUFF / 100)
        self.属性描述 += 属性.被动增加(一觉被动力智=200 - self.属性4选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(信念光环体精=220 - self.属性4选择_BUFF * 20)
 
    

class 装备101(装备):
    名称 = '天堂之翼'
    模式 = 0
    所属套装 = '传奇铁匠-封神'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '重甲'

    属性1描述 = '附加伤害：'
    属性1范围 = [9, 1, 1]
    属性1选择 = 0
    属性2描述 = '百分比力智：'
    属性2范围 = [4, 1, 1]
    属性2选择 = 0
    属性3描述 = '最终伤害：'
    属性3范围 = [4, 1, 1]
    属性3选择 = 0
    属性4描述 = '百分比三攻：'
    属性4范围 = [7, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.34)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>' 
        self.属性描述 += 属性.附加伤害加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]) / 100)
        self.属性描述 += 属性.百分比力智加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.最终伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        self.属性描述 += 属性.百分比三攻加成((self.属性4范围[0]-self.属性4选择*self.属性4范围[2]) / 100)   
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.5)
        pass   
    # 专属属性
    属性1描述_BUFF = '一觉力智'
    属性1范围_BUFF = [90, 10, 20]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = '转职被动：'
    属性2范围_BUFF = [200, 140, 20]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = '一觉被动(140/120)+'
    属性3范围_BUFF = [60, 0, 20]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = 'BUFF力智：'
    属性4范围_BUFF = [7, 1, 1]  # 最大值 最小值 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=241)
        self.属性描述 += 属性.被动增加(转职被动智力=141)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>' 
        self.属性描述 += 属性.觉醒增加(一觉力智=90 - self.属性1选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(转职被动智力=200 - self.属性2选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(守护恩赐体精=200 - self.属性2选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(信念光环体精=200 - self.属性3选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(一觉被动力智=180 - self.属性3选择_BUFF * 20)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.07 - self.属性4选择_BUFF / 100, BUFF智力per=1.07 - self.属性4选择_BUFF / 100)    

class 装备102(装备):
    名称 = '神赐的抉择'
    模式 = 0
    所属套装 = '命运歧路'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '板甲'

    属性1描述 = '伤害增加：'
    属性1范围 = [5, 1, 1]
    属性1选择 = 0
    属性2描述 = '暴击伤害：'
    属性2范围 = [7, 1, 1]
    属性2选择 = 0
    属性3描述 = '最终伤害：'
    属性3范围 = [6, 1, 1]
    属性3选择 = 0
    属性4描述 = '附加伤害：'
    属性4范围 = [5, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.21)
        self.属性描述 += 属性.百分比三攻加成(0.06)
        self.属性描述 += 属性.技能攻击力加成(0.05)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>' 
        self.属性描述 += 属性.伤害增加加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]) / 100)
        self.属性描述 += 属性.暴击伤害加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.最终伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        self.属性描述 += 属性.附加伤害加成((self.属性4范围[0]-self.属性4选择*self.属性4范围[2]) / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass

    # 专属属性
    属性1描述_BUFF = 'BUFF力智：'
    属性1范围_BUFF = [5, 1, 1]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = 'BUFF三攻：'
    属性2范围_BUFF = [7, 1, 1]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = '转职被动：'
    属性3范围_BUFF = [200, 100, 20]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '一觉被动(140/120)+'
    属性4范围_BUFF = [80, 0, 20]  # 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=280)
        self.属性描述 += 属性.被动增加(转职被动智力=180)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>' 
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.05 - self.属性1选择_BUFF / 100, BUFF智力per=1.05 - self.属性1选择_BUFF / 100)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.07 - self.属性2选择_BUFF / 100, BUFF魔攻per=1.07 - self.属性2选择_BUFF / 100, BUFF独立per=1.07 - self.属性2选择_BUFF / 100)
        self.属性描述 += 属性.被动增加(守护恩赐体精=200 - self.属性3选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(转职被动智力=200 - self.属性3选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(一觉被动力智=200 - self.属性4选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(信念光环体精=220 - self.属性4选择_BUFF * 20)

class 装备103(装备):
    名称 = '大祭司的神启礼服'
    模式 = 0
    所属套装 = '古代祭祀的神圣仪式'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '布甲'

    属性1描述 = '附加伤害：'
    属性1范围 = [10, 2, 1]
    属性1选择 = 0
    属性2描述 = '百分比力智：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比三攻：'
    属性3范围 = [11, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.1)
        self.属性描述 += 属性.百分比三攻加成(0.1)
        self.属性描述 += 属性.最终伤害加成(0.06)
        self.属性描述 += 属性.技能攻击力加成(0.06)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>' 
        self.属性描述 += 属性.附加伤害加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]) / 100)
        self.属性描述 += 属性.百分比力智加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.百分比三攻加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass   
    # 专属属性
    属性1描述_BUFF = 'BUFF三攻：'
    属性1范围_BUFF = [10, 2, 1]# 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = '转职被动Lv+'
    属性2范围_BUFF = [12, 3, 1]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = '一觉力智：'
    属性3范围_BUFF = [150, 50, 10]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '无'
    属性4范围_BUFF = [0, 0, 0]  # 最大值 最小值 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>' 
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.10 - self.属性1选择_BUFF / 100, BUFF魔攻per=1.10 - self.属性1选择_BUFF / 100, BUFF独立per=1.10 - self.属性1选择_BUFF / 100)
        self.属性描述 += 属性.被动增加(转职被动Lv=12 - self.属性2选择_BUFF)
        self.属性描述 += 属性.被动增加(守护恩赐Lv=12 - self.属性2选择_BUFF)
        self.属性描述 += 属性.觉醒增加(一觉力智=150 - self.属性3选择_BUFF * 10)

class 装备104(装备):
    名称 = '战无不胜上衣'
    模式 = 0
    所属套装 = '龙血玄黄'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '皮甲'

    属性1描述 = '伤害增加：'
    属性1范围 = [4, 1, 1]
    属性1选择 = 0
    属性2描述 = '百分比三攻：'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '暴击伤害：'
    属性3范围 = [10, 1, 1]
    属性3选择 = 0
    属性4描述 = '百分比力智：'
    属性4范围 = [8, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.28)
        self.属性描述 += 属性.技能攻击力加成(0.06)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.伤害增加加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]) / 100)
        self.属性描述 += 属性.百分比三攻加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.暴击伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        self.属性描述 += 属性.百分比力智加成((self.属性4范围[0]-self.属性4选择*self.属性4范围[2]) / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    # 专属属性
    属性1描述_BUFF = '一觉力智：'
    属性1范围_BUFF = [4, 1, 1]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = '一觉被动(120/100)+'
    属性2范围_BUFF = [40, 0, 20]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = 'BUFF三攻：'
    属性3范围_BUFF = [10, 1, 1]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '转职被动：'
    属性4范围_BUFF = [200, 60, 20]  # 最大值 最小值 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=263)
        self.属性描述 += 属性.被动增加(转职被动智力=163)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.觉醒增加(一觉力智per=1.04 - self.属性1选择_BUFF / 100)
        self.属性描述 += 属性.被动增加(信念光环体精=160 - self.属性2选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(一觉被动力智=140 - self.属性2选择_BUFF * 20)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.10 - self.属性3选择_BUFF / 100, BUFF魔攻per=1.10 - self.属性3选择_BUFF / 100, BUFF独立per=1.10 - self.属性3选择_BUFF / 100)
        self.属性描述 += 属性.被动增加(守护恩赐体精=200 - self.属性4选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(转职被动智力=200 - self.属性4选择_BUFF * 20)
     
class 装备105(装备):
    名称 = '摧枯拉朽胸甲'
    模式 = 0
    所属套装 = '擎天战甲'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '轻甲'

    属性1描述 = '技能攻击力：'
    属性1范围 = [4, 1, 1]
    属性1选择 = 0
    属性2描述 = '最终伤害：'
    属性2范围 = [4, 1, 1]
    属性2选择 = 0
    属性3描述 = '伤害增加：'
    属性3范围 = [9, 1, 1]
    属性3选择 = 0
    属性4描述 = '暴击伤害：'
    属性4范围 = [7, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        # self.属性描述 += 属性.伤害增加加成(0.34)
        self.属性描述 += 属性.伤害增加加成(0.28)
        self.属性描述 += 属性.技能攻击力加成(0.06)
        if 属性.职业 == '缔造者':
            self.属性描述 += 属性.技能等级加成('所有', 50, 50, 2)
        else:
            self.属性描述 += 属性.技能等级加成('所有', 45, 45, 2)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.技能攻击力加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]) / 100)
        self.属性描述 += 属性.最终伤害加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.伤害增加加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        self.属性描述 += 属性.暴击伤害加成((self.属性4范围[0]-self.属性4选择*self.属性4范围[2]) / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    # 专属属性
    属性1描述_BUFF = '一觉力智：'
    属性1范围_BUFF = [4, 1, 1]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = 'BUFF三攻：'
    属性2范围_BUFF = [4, 1, 1]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = '一觉被动(100/80)+'
    属性3范围_BUFF = [160, 0, 20]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = 'BUFF力智：'
    属性4范围_BUFF = [7, 1, 1]  # 最大值 最小值 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 45, 45, 2)
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=263)
        self.属性描述 += 属性.被动增加(转职被动智力=163)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.觉醒增加(一觉力智per=1.04 - self.属性1选择_BUFF / 100)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.04 - self.属性2选择_BUFF / 100, BUFF魔攻per=1.04 - self.属性2选择_BUFF / 100, BUFF独立per=1.04 - self.属性2选择_BUFF / 100)
        self.属性描述 += 属性.被动增加(信念光环体精=260 - self.属性3选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(一觉被动力智=240 - self.属性3选择_BUFF * 20)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.07 - self.属性4选择_BUFF / 100, BUFF智力per=1.07 - self.属性4选择_BUFF / 100)

class 装备106(装备):
    名称 = '千链万化战甲'
    模式 = 0
    所属套装 = '荆棘漫天'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '重甲'

    属性1描述 = '暴击伤害：'
    属性1范围 = [10, 1, 1]
    属性1选择 = 0
    属性2描述 = '百分比三攻：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '附加伤害：'
    属性3范围 = [10, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.35)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.暴击伤害加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]) / 100)
        self.属性描述 += 属性.百分比三攻加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.附加伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    # 专属属性
    属性1描述_BUFF = 'BUFF力智：'
    属性1范围_BUFF = [11, 2, 1]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = '转职被动Lv+'
    属性2范围_BUFF = [10, 1, 1]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = '一觉力智'
    属性3范围_BUFF = [12, 3, 1]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '无'
    属性4范围_BUFF = [0, 0, 0]  # 最大值 最小值 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)

        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.11 - self.属性1选择_BUFF / 100, BUFF智力per=1.11 - self.属性1选择_BUFF / 100)
        self.属性描述 += 属性.被动增加(转职被动Lv=10 - self.属性2选择_BUFF)
        self.属性描述 += 属性.被动增加(守护恩赐Lv=10 - self.属性2选择_BUFF)
        self.属性描述 += 属性.觉醒增加(一觉力智per=1.12 - self.属性3选择_BUFF / 100)
    

class 装备107(装备):
    名称 = '生命脉动之地'
    模式 = 0
    所属套装 = '大自然的呼吸'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '板甲'

    属性1描述 = '百分比力智：'
    属性1范围 = [12, 1, 1]
    属性1选择 = 0
    属性2描述 = '伤害增加：'
    属性2范围 = [9, 1, 1]
    属性2选择 = 0
    属性3描述 = '最终伤害：'
    属性3范围 = [9, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.32)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.百分比力智加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]) / 100)
        self.属性描述 += 属性.伤害增加加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.最终伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(24)
        pass
    def 其它属性(self, 属性):
        pass
    # 专属属性
    属性1描述_BUFF = 'BUFF力智：'
    属性1范围_BUFF = [13, 2, 1]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = 'BUFF三攻：'
    属性2范围_BUFF = [10, 2, 1]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = '转职被动Lv+'
    属性3范围_BUFF = [10, 2, 1]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '无'
    属性4范围_BUFF = [0, 0, 0]  # 最大值 最小值 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=242)
        self.属性描述 += 属性.被动增加(转职被动智力=142)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.13 - self.属性1选择_BUFF / 100, BUFF智力per=1.13 - self.属性1选择_BUFF / 100)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.1 - self.属性2选择_BUFF / 100, BUFF魔攻per=1.1 - self.属性2选择_BUFF / 100, BUFF独立per=1.1 - self.属性2选择_BUFF / 100)
        self.属性描述 += 属性.被动增加(转职被动Lv=10 - self.属性3选择_BUFF)
        self.属性描述 += 属性.被动增加(守护恩赐Lv=10 - self.属性3选择_BUFF)
    

class 装备108(装备):
    名称 = '深渊囚禁者长袍'
    模式 = 0
    所属套装 = '深渊窥视者'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '布甲'

    属性1描述 = '技能等级Lv5 -'
    属性1范围 = [100, 10, 5]
    属性1选择 = 0
    属性2描述 = '百分比三攻：'
    属性2范围 = [7, 1, 1]
    属性2选择 = 0
    属性3描述 = '物攻/魔攻/独立 +'
    属性3范围 = [80, 10, 10]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.35)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.技能等级加成('所有', 5, (self.属性1范围[0]-self.属性1选择*self.属性1范围[2]), 1)
        self.属性描述 += 属性.百分比三攻加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.三攻固定加成(x=(self.属性3范围[0]-self.属性3选择*self.属性3范围[2]))
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass     
    # 专属属性
    属性1描述_BUFF = '转职被动Lv+'
    属性1范围_BUFF = [17, 1, 1]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = '一觉被动(40/20)+'
    属性2范围_BUFF = [120, 0, 20]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = '转职被动：'
    属性3范围_BUFF = [200, 60, 20]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '无'
    属性4范围_BUFF = [0, 0, 0]  # 最大值 最小值 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=173)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.技能等级加成('所有', 5, 100 - self.属性1选择_BUFF * 5, 1)
        self.属性描述 += 属性.被动增加(转职被动Lv=17 - self.属性1选择_BUFF)
        self.属性描述 += 属性.被动增加(守护恩赐Lv=17 - self.属性1选择_BUFF)
        self.属性描述 += 属性.被动增加(信念光环体精=160 - self.属性2选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(一觉被动力智=140 - self.属性2选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(守护恩赐体精=200 - self.属性3选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(转职被动智力=200 - self.属性3选择_BUFF * 20)

class 装备109(装备):
    名称 = '圣者的黄昏披风'
    模式 = 0
    所属套装 = '圣者的黄昏'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '皮甲'

    属性1描述 = '所有属性强化 +'
    属性1范围 = [40, 4, 4]
    属性1选择 = 0
    属性2描述 = '伤害增加：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '附加伤害：'
    属性3范围 = [10, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.2)
        self.属性描述 += 属性.百分比三攻加成(0.12)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.所有属性强化加成(self.属性1范围[0]-self.属性1选择*self.属性1范围[2])
        self.属性描述 += 属性.伤害增加加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.附加伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100) 
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass     
    # 专属属性
    属性1描述_BUFF = '一觉被动(40/20)+'
    属性1范围_BUFF = [180, 0, 20]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = 'BUFF三攻：'
    属性2范围_BUFF = [10, 1, 1]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = '转职被动：'
    属性3范围_BUFF = [240, 60, 20]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '无'
    属性4范围_BUFF = [0, 0, 0]  # 最大值 最小值 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=236)
        self.属性描述 += 属性.被动增加(转职被动智力=136)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.被动增加(信念光环体精=220 - self.属性1选择_BUFF)
        self.属性描述 += 属性.被动增加(一觉被动力智=200 - self.属性1选择_BUFF * 20)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.1 - self.属性2选择_BUFF / 100, BUFF魔攻per=1.1 - self.属性2选择_BUFF / 100, BUFF独立per=1.1 - self.属性2选择_BUFF / 100)
        self.属性描述 += 属性.被动增加(守护恩赐体精=240 - self.属性3选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(转职被动智力=240 - self.属性3选择_BUFF * 20)

class 装备110(装备):
    名称 = '逆转结局'
    模式 = 0
    所属套装 = '坎坷命运'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '轻甲'

    属性1描述 = '技能等级Lv1 -'
    属性1范围 = [48, 35, 5]
    属性1选择 = 0
    属性2描述 = '物攻/魔攻/独立 +'
    属性2范围 = [70, 10, 10]
    属性2选择 = 0
    属性3描述 = '最终伤害：'
    属性3范围 = [5, 1, 1]
    属性3选择 = 0
    属性4描述 = '力量/智力 +'
    属性4范围 = [160, 40, 20]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.35)
        if 属性.装备检查('悲痛者项链'):
            self.属性描述 += '<font color="#00A2E8">装备悲痛者项链时</font><br>'
            self.属性描述 += 属性.百分比三攻加成(-0.10)
            self.属性描述 += 属性.附加伤害加成(0.10)
        if 属性.装备检查('悲情者遗物'):
            self.属性描述 += '<font color="#00A2E8">装备悲情者遗物时</font><br>'
            self.属性描述 += 属性.百分比三攻加成(-0.10)
            self.属性描述 += 属性.附加伤害加成(0.10)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'  
        self.属性描述 += 属性.技能等级加成('所有', 1, min(self.属性1范围[0], (50-self.属性1选择*self.属性1范围[2])), 1)
        self.属性描述 += 属性.三攻固定加成(x=(self.属性2范围[0]-self.属性2选择*self.属性2范围[2]))
        self.属性描述 += 属性.最终伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        self.属性描述 += 属性.力智固定加成(x=(self.属性4范围[0]-self.属性4选择*self.属性4范围[2]))
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.06)
        self.属性描述 += 属性.移动速度增加(0.06)
        self.属性描述 += 属性.释放速度增加(0.09)
        pass      
    # 专属属性
    属性1描述_BUFF = '一觉力智：'
    属性1范围_BUFF = [4, 1, 1]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = '转职被动Lv+'
    属性2范围_BUFF = [7, 1, 1]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = 'BUFF三攻：'
    属性3范围_BUFF = [5, 1, 1]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '转职被动：'
    属性4范围_BUFF = [160, 40, 20]  # 最大值 最小值 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>' 
        self.属性描述 += 属性.技能等级加成('所有', 1, min(48, 50 - self.属性1选择_BUFF * 5), 1)
        self.属性描述 += 属性.觉醒增加(一觉力智per=1.04 - self.属性1选择_BUFF / 100)
        self.属性描述 += 属性.被动增加(转职被动Lv=7 - self.属性2选择_BUFF)
        self.属性描述 += 属性.被动增加(守护恩赐Lv=7 - self.属性2选择_BUFF)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.05 - self.属性3选择_BUFF / 100, BUFF魔攻per=1.05 - self.属性3选择_BUFF / 100, BUFF独立per=1.05 - self.属性3选择_BUFF / 100)
        self.属性描述 += 属性.被动增加(守护恩赐体精=160 - self.属性4选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(转职被动智力=160 - self.属性4选择_BUFF * 20)
    
class 装备111(装备):
    名称 = '灭世之怒'
    模式 = 0
    所属套装 = '吞噬愤怒'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '重甲'

    属性1描述 = '最终伤害：'
    属性1范围 = [4, 1, 1]
    属性1选择 = 0
    属性2描述 = '百分比三攻：'
    属性2范围 = [13, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比力智：'
    属性3范围 = [4, 1, 1]
    属性3选择 = 0
    属性4描述 = '技能攻击力：'
    属性4范围 = [5, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.23)
        self.属性描述 += 属性.持续伤害加成(0.1)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.最终伤害加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]) / 100)
        self.属性描述 += 属性.百分比三攻加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.百分比力智加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        self.属性描述 += 属性.技能攻击力加成((self.属性4范围[0]-self.属性4选择*self.属性4范围[2]) / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass     
    # 专属属性
    属性1描述_BUFF = '一觉被动(100/80)+'
    属性1范围_BUFF = [60, 0, 20]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = 'BUFF力智：'
    属性2范围_BUFF = [13, 1, 1]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = '转职被动：'
    属性3范围_BUFF = [200, 140, 20]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '一觉力智：'
    属性4范围_BUFF = [50, 10, 10]  # 最大值 最小值 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.25)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>' 
        self.属性描述 += 属性.被动增加(信念光环体精=160 - self.属性1选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(一觉被动力智=140 - self.属性1选择_BUFF * 20)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.13 - self.属性2选择_BUFF / 100, BUFF智力per=1.13 - self.属性2选择_BUFF / 100)
        self.属性描述 += 属性.被动增加(守护恩赐体精=200 - self.属性3选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(转职被动智力=200 - self.属性3选择_BUFF * 20)
        self.属性描述 += 属性.觉醒增加(一觉力智=50 - self.属性4选择_BUFF * 10)
    

class 装备112(装备):
    名称 = '魔法师[???]的护腿'
    模式 = 0
    所属套装 = '遗忘魔法师的馈赠'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.05)
        self.属性描述 += 属性.百分比三攻加成(0.1)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(18)
        pass
    def 其它属性(self, 属性):
        pass  
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.25)
    def 变换属性(self,属性):
        self.属性描述 += 属性.伤害增加加成(0.12,4)
        pass  

class 装备113(装备):
    名称 = '死亡阴影短裤'
    模式 = 0
    所属套装 = '死亡阴影'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.04)
        
        self.属性描述 += 属性.暴击伤害加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass   
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=180)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFFLv=1)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.25)
    def 变换属性(self,属性):
        self.属性描述 += 属性.伤害增加加成(0.18,4)
        pass      

class 装备114(装备):
    名称 = '肆虐狂风之意志'
    模式 = 0
    所属套装 = '贫瘠沙漠的遗产'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(属性.技能栏空位 / 100)
        self.属性描述 += 属性.附加伤害加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.25)
    def 变换属性(self,属性):
        self.属性描述 += 属性.暴击伤害加成(0.16,4)
        pass      

class 装备115(装备):
    名称 = '亚蒙：谎言之力'
    模式 = 0
    所属套装 = '噩梦：地狱之路'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '重甲'
    def 城镇属性(self, 属性): 
        self.属性描述 += 属性.最终伤害加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.25)
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比力智加成(0.16,4)
        pass         
        
class 装备116(装备):
    名称 = '奔流不息之伽蓝'
    模式 = 0
    所属套装 = '永恒不息之路'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能倍率加成(40, -0.3)
        self.属性描述 += 属性.技能恢复加成(40, 40, 1.0)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass     
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.25)
    def 变换属性(self,属性):
        self.属性描述 += 属性.暴击伤害加成(0.32,4)
        pass         
            

class 装备117(装备):
    名称 = '魅惑律动伦巴'
    模式 = 0
    所属套装 = '天堂舞姬'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.17)
        self.属性描述 += 属性.技能冷却缩减(35, 45, 0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass  
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=200)
        self.属性描述 += 属性.被动增加(转职被动智力=100)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.25)
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比力智加成(0.14,4)
        pass     

class 装备118(装备):
    名称 = '首席执行官裁决短裤'
    模式 = 0
    所属套装 = '皇家裁决者宣言'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass     
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.25)
    def 变换属性(self,属性):
        self.属性描述 += 属性.最终伤害加成(0.17,4)
        pass     

class 装备119(装备):
    名称 = '炙炎：荔枝'
    模式 = 0
    所属套装 = '炙炎之盛宴'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=200)
        self.属性描述 += 属性.被动增加(转职被动智力=100)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.02)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.02)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.25)
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比力智加成(0.33,4)
        pass          

class 装备120(装备):
    名称 = '邪恶之角'
    模式 = 0
    所属套装 = '传奇铁匠-封神'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass     
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=241)
        self.属性描述 += 属性.被动增加(转职被动智力=141)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.25)
    def 变换属性(self,属性):
        self.属性描述 += 属性.附加伤害加成(0.34,4)
        pass              

class 装备121(装备):
    名称 = '命运的抉择'
    模式 = 0
    所属套装 = '命运歧路'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        
        if 属性.命运的抉择 == 0:
            self.属性描述 += '<font color="#00A2E8">期望属性:</font><br>'
            self.属性描述 += 属性.伤害增加加成(0.02)
            self.属性描述 += 属性.暴击伤害加成(0.02)
            self.属性描述 += 属性.最终伤害加成(0.02)
            self.属性描述 += 属性.百分比三攻加成(0.02)
            self.属性描述 += 属性.技能攻击力加成(0.02)
        if 属性.命运的抉择 == 1:
            self.属性描述 += 属性.伤害增加加成(0.1)
        if 属性.命运的抉择 == 2:
            self.属性描述 += 属性.暴击伤害加成(0.1)
        if 属性.命运的抉择 == 3:
            self.属性描述 += 属性.最终伤害加成(0.1)
        if 属性.命运的抉择 == 4:
            self.属性描述 += 属性.百分比三攻加成(0.1)
        if 属性.命运的抉择 == 5:
            self.属性描述 += 属性.技能攻击力加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass    
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=280)
        self.属性描述 += 属性.被动增加(转职被动智力=180)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.25)
    def 变换属性(self,属性):
        self.属性描述 += 属性.附加伤害加成(0.25,4)
        pass           

class 装备122(装备):
    名称 = '大祭司的星祈长裙'
    模式 = 0
    所属套装 = '古代祭祀的神圣仪式'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.1)
        self.属性描述 += 属性.百分比三攻加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass   
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.25)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.伤害增加加成(0.12,4)
        pass          


class 装备123(装备):
    名称 = '破釜沉舟护腿'
    模式 = 0
    所属套装 = '龙血玄黄'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass  
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=263)
        self.属性描述 += 属性.被动增加(转职被动智力=163)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.25)
    def 变换属性(self,属性):
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            self.属性描述 += 属性.暴击伤害加成(0.35,4)
        else:
            self.属性描述 += 属性.暴击伤害加成(0.34,4)
        pass     

class 装备124(装备):
    名称 = '雷霆万钧护腿'
    模式 = 0
    所属套装 = '擎天战甲'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        
        self.属性描述 += 属性.技能等级加成('所有', 35, 35, 2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass 
    def 城镇属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 35, 35, 2)
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=263)
        self.属性描述 += 属性.被动增加(转职被动智力=163)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.25)
    def 变换属性(self,属性):
        self.属性描述 += 属性.暴击伤害加成(0.34,4)
        pass    

class 装备125(装备):
    名称 = '千链锁灵护腿'
    模式 = 0
    所属套装 = '荆棘漫天'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass 
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.25)
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比三攻加成(0.35,4)
        pass      

class 装备126(装备):
    名称 = '蚕食新绿之息'
    模式 = 0
    所属套装 = '大自然的呼吸'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.暗属性强化加成(24)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.物理暴击率增加(0.1)
        self.属性描述 += 属性.魔法暴击率增加(0.1)
        pass 
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=242)
        self.属性描述 += 属性.被动增加(转职被动智力=142)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.25)
    def 变换属性(self,属性):
        self.属性描述 += 属性.最终伤害加成(0.32,4)
        pass          


class 装备127(装备):
    名称 = '驱散黑暗短裤'
    模式 = 0
    所属套装 = '黑魔法探求者'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass      
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=275)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.25)
    def 变换属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.21,4)
        pass    

class 装备128(装备):
    名称 = '时空漩涡护腿'
    模式 = 0
    所属套装 = '时空旅行者'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        
        self.属性描述 += 属性.技能冷却缩减(60, 80, 0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.1)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=242)
        self.属性描述 += 属性.被动增加(转职被动智力=142)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.25)
    def 变换属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.32,4)
        pass        

class 装备129(装备):
    名称 = '灵魂的呐喊'
    模式 = 0
    所属套装 = '穿透命运的呐喊'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.17)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass   
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.25)
    def 变换属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.14,4)
        pass        

class 装备130(装备):
    名称 = '疯狂之如影随形'
    模式 = 0
    所属套装 = '狂乱追随者'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.25)
    def 变换属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.22,4)
        pass        

class 装备131(装备):
    名称 = '魔法师[???]的披风'
    模式 = 0
    所属套装 = '遗忘魔法师的馈赠'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.05)
        self.属性描述 += 属性.百分比三攻加成(0.1)
        self.属性描述 += 属性.技能攻击力加成(0.13)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.物理暴击率增加(0.05)
        self.属性描述 += 属性.魔法暴击率增加(0.05)
        pass  
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=300)
        self.属性描述 += 属性.被动增加(转职被动智力=200)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)   


        
class 装备132(装备):
    名称 = '死亡阴影护肩'
    模式 = 0
    所属套装 = '死亡阴影'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.04)
        self.属性描述 += 属性.暴击伤害加成(0.10)
        self.属性描述 += 属性.技能攻击力加成(0.18)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass     
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=300)
        self.属性描述 += 属性.被动增加(转职被动智力=200)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
    


class 装备133(装备):
    名称 = '艰难求生之斗志'
    模式 = 0
    所属套装 = '贫瘠沙漠的遗产'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(属性.技能栏空位 / 100)
        self.属性描述 += 属性.附加伤害加成(0.16)
        self.属性描述 += 属性.技能攻击力加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.物理暴击率增加(0.05)
        self.属性描述 += 属性.魔法暴击率增加(0.05)
        pass     
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=300)
        self.属性描述 += 属性.被动增加(转职被动智力=200)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
    

class 装备134(装备):
    名称 = '贝利亚尔：毁灭之种'
    模式 = 0
    所属套装 = '噩梦：地狱之路'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.16)
        self.属性描述 += 属性.技能攻击力加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass    
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=300)
        self.属性描述 += 属性.被动增加(转职被动智力=200)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
    

class 装备135(装备):
    名称 = '奔流不息之山川'
    模式 = 0
    所属套装 = '永恒不息之路'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.29)
        self.属性描述 += 属性.技能倍率加成(35, -0.3)
        self.属性描述 += 属性.技能恢复加成(35, 35, 1.0)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=300)
        self.属性描述 += 属性.被动增加(转职被动智力=200)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
    

class 装备136(装备):
    名称 = '性感洒脱探戈'
    模式 = 0
    所属套装 = '天堂舞姬'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.17)
        self.属性描述 += 属性.技能攻击力加成(0.14)
        self.属性描述 += 属性.技能冷却缩减(75, 80, 0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass  
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=260)
        self.属性描述 += 属性.被动增加(转职被动智力=160)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
    

class 装备137(装备):
    名称 = '首席执行官裁决肩甲'
    模式 = 0
    所属套装 = '皇家裁决者宣言'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.12)
        self.属性描述 += 属性.技能攻击力加成(0.2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass    
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=300)
        self.属性描述 += 属性.被动增加(转职被动智力=200)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
    
class 装备138(装备):
    名称 = '炙炎：榴莲'
    模式 = 0
    所属套装 = '炙炎之盛宴'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.33)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass  
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=300)
        self.属性描述 += 属性.被动增加(转职被动智力=200)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.05)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.05)
    
class 装备139(装备):
    名称 = '魔龙之心'
    模式 = 0
    所属套装 = '传奇铁匠-封神'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.12)
        self.属性描述 += 属性.技能攻击力加成(0.2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.释放速度增加(0.16)
        pass
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=312)
        self.属性描述 += 属性.被动增加(转职被动智力=212)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.03)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.03)
    
class 装备140(装备):
    名称 = '矛盾的抉择'
    模式 = 0
    所属套装 = '命运歧路'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=320)
        self.属性描述 += 属性.被动增加(转职被动智力=220)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
    
class 装备141(装备):
    名称 = '大祭司的星祈披肩'
    模式 = 0
    所属套装 = '古代祭祀的神圣仪式'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.1)
        self.属性描述 += 属性.百分比三攻加成(0.1)
        self.属性描述 += 属性.技能攻击力加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('大祭司的神启礼服'):
            self.属性描述 += 属性.释放速度增加(0.24)
        else:
            self.属性描述 += 属性.释放速度增加(0.18)
        pass
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=300)
        self.属性描述 += 属性.被动增加(转职被动智力=200)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
    
class 装备142(装备):
    名称 = '枪林弹雨护肩'
    模式 = 0
    所属套装 = '龙血玄黄'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            self.属性描述 += 属性.技能攻击力加成(0.35)
        else:
            self.属性描述 += 属性.技能攻击力加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=300)
        self.属性描述 += 属性.被动增加(转职被动智力=200)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.05)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.05)
       
class 装备143(装备):
    名称 = '排山倒海护肩'
    模式 = 0
    所属套装 = '擎天战甲'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.34)
        self.属性描述 += 属性.技能等级加成('所有', 60, 60, 2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 城镇属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 60, 60, 2)
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=300)
        self.属性描述 += 属性.被动增加(转职被动智力=200)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
    
class 装备144(装备):
    名称 = '千链锁灵肩甲'
    模式 = 0
    所属套装 = '荆棘漫天'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(-0.1)
        pass   
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=300)
        self.属性描述 += 属性.被动增加(转职被动智力=200)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
    
class 装备145(装备):
    名称 = '猛烈燃烧之炎'
    模式 = 0
    所属套装 = '大自然的呼吸'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.32)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.火属性强化加成(24)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.1)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=270)
        self.属性描述 += 属性.被动增加(转职被动智力=170)
        self.属性描述 += 属性.BUFF增加(BUFFLv=1)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.02)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.02)
    

class 装备146(装备):
    名称 = '魔法师[???]的长靴'
    模式 = 0
    所属套装 = '遗忘魔法师的馈赠'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.05)
        self.属性描述 += 属性.百分比三攻加成(0.1)
        self.属性描述 += 属性.暴击伤害加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.1)
        self.属性描述 += 属性.移动速度增加(0.14)
        self.属性描述 += 属性.释放速度增加(0.15)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=300)
        self.属性描述 += 属性.被动增加(转职被动智力=200)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
    
class 装备147(装备):
    名称 = '死亡阴影长靴'
    模式 = 0
    所属套装 = '死亡阴影'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.04)
        self.属性描述 += 属性.最终伤害加成(0.1)
        self.属性描述 += 属性.附加伤害加成(0.18)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.04)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=230)
        self.属性描述 += 属性.被动增加(转职被动智力=130)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
        self.属性描述 += 属性.被动增加(一觉被动Lv=2)
    
class 装备148(装备):
    名称 = '寂静寒夜之忍耐'
    模式 = 0
    所属套装 = '贫瘠沙漠的遗产'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.28)
        self.属性描述 += 属性.伤害增加加成(属性.技能栏空位 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.04)
        pass  
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=268)
        self.属性描述 += 属性.被动增加(转职被动智力=168)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
    
class 装备149(装备):
    名称 = '巴尔：堕落之魂'
    模式 = 0
    所属套装 = '噩梦：地狱之路'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.16)
        self.属性描述 += 属性.伤害增加加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.04)
        pass 
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=230)
        self.属性描述 += 属性.被动增加(转职被动智力=130)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
    
class 装备150(装备):
    名称 = '奔流不息之银河'
    模式 = 0
    所属套装 = '永恒不息之路'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.32)
        self.属性描述 += 属性.技能倍率加成(25, -0.3)
        self.属性描述 += 属性.技能恢复加成(25, 25, 1.0)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.04)
        self.属性描述 += 属性.物理暴击率增加(0.05)
        self.属性描述 += 属性.魔法暴击率增加(0.05)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=230)
        self.属性描述 += 属性.被动增加(转职被动智力=130)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.06)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.06)
    
class 装备151(装备):
    名称 = '激烈欢动踢踏'
    模式 = 0
    所属套装 = '天堂舞姬'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.17)
        self.属性描述 += 属性.附加伤害加成(0.14)
        self.属性描述 += 属性.技能冷却缩减(1, 35, 0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.04)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=180)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
        self.属性描述 += 属性.被动增加(一觉被动Lv=2)
    
class 装备152(装备):
    名称 = '首席执行官裁决长靴'
    模式 = 0
    所属套装 = '皇家裁决者宣言'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.11)
        self.属性描述 += 属性.最终伤害加成(0.21)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.04)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=230)
        self.属性描述 += 属性.被动增加(转职被动智力=130)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
    
class 装备153(装备):
    名称 = '炙炎：木瓜'
    模式 = 0
    所属套装 = '炙炎之盛宴'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.3)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.19)
        self.属性描述 += 属性.物理暴击率增加(0.05)
        self.属性描述 += 属性.魔法暴击率增加(0.05)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=230)
        self.属性描述 += 属性.被动增加(转职被动智力=130)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.05)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.05)
    
class 装备154(装备):
    名称 = '自然之核'
    模式 = 0
    所属套装 = '传奇铁匠-封神'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(70)
        self.属性描述 += 属性.技能等级加成('所有', 1, 85, 1)
        self.属性描述 += 属性.技能等级加成('所有', 100, 100, 1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.04)
        pass
    def 城镇属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 1, 85, 1)
        self.属性描述 += 属性.技能等级加成('所有', 100, 100, 1)
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=180)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.05)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.05)
    
class 装备155(装备):
    名称 = '守护的抉择'
    模式 = 0
    所属套装 = '命运歧路'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.17)
        if 属性.护石第一栏 != '无':
            self.属性描述 += 属性.单技能修改(属性.护石第一栏, 1.55, 0.7)
        if 属性.护石第二栏 != '无':
            self.属性描述 += 属性.单技能修改(属性.护石第二栏, 1.45, 0.75)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.04)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=280)
        self.属性描述 += 属性.被动增加(转职被动智力=180)
        if 属性.护石第一栏 != '无':
            self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
            self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
        if 属性.护石第二栏 != '无':
            self.属性描述 += 属性.BUFF增加(BUFF力量per=1.02)
            self.属性描述 += 属性.BUFF增加(BUFF智力per=1.02)
    
class 装备156(装备):
    名称 = '大祭司的星祈凉鞋'
    模式 = 0
    所属套装 = '古代祭祀的神圣仪式'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.1)
        self.属性描述 += 属性.百分比三攻加成(0.1)
        self.属性描述 += 属性.附加伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('大祭司的神启礼服'):
            self.属性描述 += 属性.移动速度增加(0.18)
        else:
            self.属性描述 += 属性.移动速度增加(0.12)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=230)
        self.属性描述 += 属性.被动增加(转职被动智力=130)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
    

class 装备157(装备):
    名称 = '赤地千里战靴'
    模式 = 0
    所属套装 = '龙血玄黄'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            self.属性描述 += 属性.百分比力智加成(0.35)
        else:
            self.属性描述 += 属性.百分比力智加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.04)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=230)
        self.属性描述 += 属性.被动增加(转职被动智力=130)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.05)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.05)
    
class 装备158(装备):
    名称 = '遮天蔽日长靴'
    模式 = 0
    所属套装 = '擎天战甲'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.34)
        self.属性描述 += 属性.技能等级加成('所有', 70, 70, 2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.04)
        pass
    def 城镇属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 70, 70, 2)
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=230)
        self.属性描述 += 属性.被动增加(转职被动智力=130)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.05)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.05)
    
class 装备159(装备):
    名称 = '千链锁灵战靴'
    模式 = 0
    所属套装 = '荆棘漫天'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(-0.06)
        pass 
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=230)
        self.属性描述 += 属性.被动增加(转职被动智力=130)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
    
class 装备160(装备):
    名称 = '交织烈日之风'
    模式 = 0
    所属套装 = '大自然的呼吸'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.32)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.光属性强化加成(24)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.14)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 30, 48, 1)
        self.属性描述 += 属性.被动增加(守护恩赐体精=200)
        self.属性描述 += 属性.被动增加(转职被动智力=100)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
    
class 装备161(装备):
    名称 = '堕入地狱之脚'
    模式 = 0
    所属套装 = '地狱求道者'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(70)
        self.属性描述 += 属性.技能等级加成('所有', 1, 90, 1)
        self.属性描述 += 属性.技能等级加成('所有', 100, 100, 1)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.04)
        pass
    def 进图属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 1, 90, 1)
        self.属性描述 += 属性.技能等级加成('所有', 100, 100, 1)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=263)
        self.属性描述 += 属性.被动增加(转职被动智力=163)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
        self.属性描述 += 属性.被动增加(一觉被动Lv=2)
    
class 装备162(装备):
    名称 = '次元漫步者长靴'
    模式 = 0
    所属套装 = '次元旅行者'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.1)
        self.属性描述 += 属性.伤害增加加成(0.19)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 1, 45, 1)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.14)
        pass
    def 进图属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 1, 45, 1)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=200)
        self.属性描述 += 属性.被动增加(转职被动智力=100)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.02)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.02)
    
class 装备163(装备):
    名称 = '悲喜交加'
    模式 = 0
    所属套装 = '天命无常'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.29)
        pass
    def 进图属性(self, 属性):
        if '天命无常[2]' in 属性.套装栏:
            if 属性.天命无常 == 0:
                if 属性.装备检查('命运反抗者'):
                    self.属性描述 += 属性.所有属性强化加成(22)
                else :
                    self.属性描述 += 属性.所有属性强化加成(20)
            else:
                if 属性.天命无常 % 2 == 0:
                    self.属性描述 += 属性.所有属性强化加成(30)
                else:
                    self.属性描述 += 属性.所有属性强化加成(10)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.04)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=270)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
    
class 装备164(装备):
    名称 = '崩溃世界的忧伤'
    模式 = 0
    所属套装 = '悲剧的残骸'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.17)
        if 属性.悲剧的残骸 == 0:
            self.属性描述 += '<font color="#00A2E8">期望属性:</font><br>'
            if 属性.装备检查('心痛如绞的诀别'):
                self.属性描述 += 属性.附加伤害加成(0.106)
            else:
                self.属性描述 += 属性.附加伤害加成(0.10)
        elif 属性.悲剧的残骸 == 1:
            if 属性.装备检查('心痛如绞的诀别'):
                self.属性描述 += 属性.附加伤害加成(0.10)
            else:
                self.属性描述 += 属性.附加伤害加成(0.08)
        elif 属性.悲剧的残骸 == 2:
            self.属性描述 += 属性.附加伤害加成(0.10)
        elif 属性.悲剧的残骸 == 3:
            self.属性描述 += 属性.附加伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.悲剧的残骸 == 0:
            self.属性描述 += 属性.攻击速度增加(0.021)
        elif 属性.悲剧的残骸 >= 2:
            self.属性描述 += 属性.攻击速度增加(0.03)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=230)
        self.属性描述 += 属性.被动增加(转职被动智力=130)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
        self.属性描述 += 属性.被动增加(一觉被动Lv=2)
    
class 装备165(装备):
    名称 = '魔法师[???]的腰带'
    模式 = 0
    所属套装 = '遗忘魔法师的馈赠'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.05)
        self.属性描述 += 属性.百分比三攻加成(0.1)
        self.属性描述 += 属性.附加伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.25)
    
class 装备166(装备):
    名称 = '死亡阴影腰带'
    模式 = 0
    所属套装 = '死亡阴影'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.04)
        self.属性描述 += 属性.最终伤害加成(0.10)
        self.属性描述 += 属性.附加伤害加成(0.18)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=180)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFFLv=1)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.25)
    
class 装备167(装备):
    名称 = '守护战士之苦难'
    模式 = 0
    所属套装 = '贫瘠沙漠的遗产'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.16)
        self.属性描述 += 属性.伤害增加加成(属性.技能栏空位 / 100)
        self.属性描述 += 属性.附加伤害加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass 
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.25)
    
class 装备168(装备):
    名称 = '亚巴顿：绝望地狱'
    模式 = 0
    所属套装 = '噩梦：地狱之路'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.16)
        self.属性描述 += 属性.暴击伤害加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.25)
    
class 装备169(装备):
    名称 = '奔流不息之狂风'
    模式 = 0
    所属套装 = '永恒不息之路'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.32)
        self.属性描述 += 属性.技能倍率加成(30, -0.3)
        self.属性描述 += 属性.技能恢复加成(30, 30, 1.0)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.25)
    
class 装备170(装备):
    名称 = '热情舞动桑巴'
    模式 = 0
    所属套装 = '天堂舞姬'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.17)
        self.属性描述 += 属性.最终伤害加成(0.14)
        self.属性描述 += 属性.技能冷却缩减(60, 70, 0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=200)
        self.属性描述 += 属性.被动增加(转职被动智力=100)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.25)
    
class 装备171(装备):
    名称 = '首席执行官裁决腰带'
    模式 = 0
    所属套装 = '皇家裁决者宣言'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.18)
        self.属性描述 += 属性.暴击伤害加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.25)
    
class 装备172(装备):
    名称 = '炙炎：山竹'
    模式 = 0
    所属套装 = '炙炎之盛宴'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(60)
        self.属性描述 += 属性.百分比三攻加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.释放速度增加(0.15)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=200)
        self.属性描述 += 属性.被动增加(转职被动智力=100)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.02)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.02)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.25)
    
class 装备173(装备):
    名称 = '碎钢之牙'
    模式 = 0
    所属套装 = '传奇铁匠-封神'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.1)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=241)
        self.属性描述 += 属性.被动增加(转职被动智力=141)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.25)
    
class 装备174(装备):
    名称 = '正义的抉择'
    模式 = 0
    所属套装 = '命运歧路'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.2)
        self.属性描述 += 属性.技能倍率加成(50, 0.25)
        self.属性描述 += 属性.技能倍率加成(85, 0.45)
        self.属性描述 += 属性.技能冷却缩减(85, 85, 0.20)
        self.属性描述 += 属性.技能倍率加成(100, 0.13)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=280)
        self.属性描述 += 属性.被动增加(转职被动智力=180)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.25)
    
class 装备175(装备):
    名称 = '大祭司的星祈腰带'
    模式 = 0
    所属套装 = '古代祭祀的神圣仪式'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.1)
        self.属性描述 += 属性.百分比三攻加成(0.1)
        self.属性描述 += 属性.暴击伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('大祭司的神启礼服'):
            self.属性描述 += 属性.攻击速度增加(0.18)
        else:
            self.属性描述 += 属性.攻击速度增加(0.12)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.25)
    
class 装备176(装备):
    名称 = '浴血奋战腰带'
    模式 = 0
    所属套装 = '龙血玄黄'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 1, 85, 1)
        self.属性描述 += 属性.技能等级加成('所有', 100, 100, 1)
        pass
    def 进图属性(self, 属性):
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            self.属性描述 += 属性.所有属性强化加成(72)
        else:
            self.属性描述 += 属性.所有属性强化加成(68)
        pass
    def 其它属性(self, 属性):
        pass
    def 城镇属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 1, 85, 1)
        self.属性描述 += 属性.技能等级加成('所有', 100, 100, 1)
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=180)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.25)
    

class 装备177(装备):
    名称 = '风起云涌腰带'
    模式 = 0
    所属套装 = '擎天战甲'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.34)
        self.属性描述 += 属性.技能等级加成('所有', 40, 40, 2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 城镇属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 40, 40, 2)
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=263)
        self.属性描述 += 属性.被动增加(转职被动智力=163)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.25)
    

class 装备178(装备):
    名称 = '千链锁灵腰带'
    模式 = 0
    所属套装 = '荆棘漫天'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.释放速度增加(-0.15)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=250)
        self.属性描述 += 属性.被动增加(转职被动智力=150)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.25)
    
class 装备179(装备):
    名称 = '宁静苍翠之水'
    模式 = 0
    所属套装 = '大自然的呼吸'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.32)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.冰属性强化加成(24)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.释放速度增加(0.15)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=242)
        self.属性描述 += 属性.被动增加(转职被动智力=142)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.25)
    
#endregion

# region 智慧产物
class 装备244(装备):
    名称 = '完美掌控'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '轻甲'
    属性1描述 = '所有属性强化:'
    属性1范围 = [12, 4, 4]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '所有属性强化:'
    属性3范围 = [12, 4, 4]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.所有属性强化加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]))
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2])/100)
        if 改造等级 >= 7:
            self.属性描述 += 属性.所有属性强化加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]))
    def 城镇属性(self, 属性):
        if 属性.获取改造(self.部位) >= 5:
            for i in range(20):
                self.属性描述 += 属性.技能攻击力加成(0.01)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 1, 85, 1)
        self.属性描述 += 属性.技能等级加成('所有', 100, 100, 1)
        self.属性描述 += 属性.所有属性强化加成(20 * 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        if 属性.获取改造(self.部位) >= 5:
            self.属性描述 += 属性.攻击速度增加(0.15)
            self.属性描述 += 属性.移动速度增加(0.15)
            self.属性描述 += 属性.释放速度增加(0.225)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += 'Lv1-85 技能等级+1<br>'
        temp += 'Lv100  技能等级+1<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '所有属性强化 +%d x 20<br>' % (改造等级)
        if 改造等级 >= 5:
            temp += '技能攻击力 +1% x 20 <br>'
            temp += '攻击速度 +15%<br>'
            temp += '移动速度 +15%<br>'
            temp += '释放速度 +22.5%<br>'
        if 属性.产物升级 == 1:
            属性.装备描述 = 1
            self.产物升级(属性)
            temp += self.属性描述
            属性.装备描述 = 0
        return temp  
    def 进图属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 1, 85, 1)
        self.属性描述 += 属性.技能等级加成('所有', 100, 100, 1)
        pass

class 装备252(装备):
    名称 = '无念之仪服'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    属性1描述 = '伤害增加:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '伤害增加:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.伤害增加加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2])/100)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2])/100)
        if 改造等级 >= 7:
            self.属性描述 += 属性.伤害增加加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2])/100)
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += 属性.技能等级加成('所有', 50, 50, 2)
            self.属性描述 += 属性.技能等级加成('所有', 85, 85, 2)
            self.属性描述 += 属性.技能等级加成('所有', 100, 100, 2)
            self.属性描述 += 属性.属性附加加成(0.04)
        if 属性.获取改造(self.部位) >= 5:
            self.属性描述 += 属性.伤害增加加成(0.10)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.12)
        self.属性描述 += 属性.移动速度增加(0.12)
        self.属性描述 += 属性.释放速度增加(0.18)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '攻击速度 +12%<br>'
        temp += '移动速度 +12%<br>'
        temp += '释放速度 +18%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '伤害增加 +{}%<br>'.format(4 * 改造等级)
        if 改造等级 >= 1:
            temp += 'Lv50  技能等级+2<br>'
            temp += 'Lv85  技能等级+2<br>'
            temp += 'Lv100 技能等级+2<br>'
            temp += '属性附加 +4%<br>'
        if 改造等级 >= 5:
            temp += '伤害增加 +10%<br>'
        if 属性.产物升级 == 1:
            属性.装备描述 = 1
            self.产物升级(属性)
            temp += self.属性描述
            属性.装备描述 = 0
        return temp       
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += 属性.技能等级加成('所有', 50, 50, 2)
            self.属性描述 += 属性.技能等级加成('所有', 85, 85, 2)
            self.属性描述 += 属性.技能等级加成('所有', 100, 100, 2)
        pass
    def BUFF属性(self, 属性):
        pass
    

class 装备253(装备):
    名称 = '无欲之花'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '布甲'
    属性1描述 = '附加伤害:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '附加伤害:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.附加伤害加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2])/100)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2])/100)
        if 改造等级 >= 7:
            self.属性描述 += 属性.附加伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2])/100)  
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.0 + 0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += 属性.技能倍率加成(50, 0.30)
            self.属性描述 += 属性.技能倍率加成(85, 0.25)
            self.属性描述 += 属性.技能倍率加成(100, 0.16)
            self.属性描述 += 属性.伤害增加加成(0.07)
        if 属性.获取改造(self.部位) >= 5:
            self.属性描述 += 属性.技能攻击力加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 +=0.05
        属性.魔法暴击率 +=0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '技能攻击力 +{}%<br>'.format(4*改造等级)
        if 改造等级 >= 1:
            temp += 'Lv50 技能攻击力+30%<br>'
            temp += 'Lv85 技能攻击力+25%<br>'
            temp += 'Lv100 (主动)技能攻击力+16%<br>'
            temp += '伤害增加 +7%<br>'
        if 改造等级 >= 5:
            temp += '技能攻击力 +12%<br>'
        if 属性.产物升级 == 1:
            属性.装备描述 = 1
            self.产物升级(属性)
            temp += self.属性描述
            属性.装备描述 = 0
        return temp       

class 装备254(装备):
    名称 = '无形之气韵'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    属性1描述 = '暴击伤害:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '暴击伤害:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.暴击伤害加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2])/100)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2])/100)
        if 改造等级 >= 7:
            self.属性描述 += 属性.暴击伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2])/100)
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += 属性.暴击伤害加成(0.05)
            self.属性描述 += 属性.所有属性强化加成(30)
            self.属性描述 += 属性.技能等级加成('所有',50,85,1)
            self.属性描述 += 属性.技能等级加成('所有',100,100,1)
        if 属性.获取改造(self.部位) >= 5:
            self.属性描述 += 属性.暴击伤害加成(0.10)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '暴击伤害 +{}%<br>'.format(4 * 改造等级)
        if 改造等级 >= 1:
            temp += '暴击伤害 +5%<br>'
            temp += '所有属性强化 +30<br>'
            temp += 'Lv50-85 技能等级+1<br>'
            temp += 'Lv100   技能等级+1<br>'
        if 改造等级 >= 5:
            temp += '暴击伤害 +10%<br>'
        if 属性.产物升级 == 1:
            属性.装备描述 = 1
            self.产物升级(属性)
            temp += self.属性描述
            属性.装备描述 = 0
        return temp       
    def 城镇属性_BUFF(self, 属性):
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += 属性.技能等级加成('所有',50,85,1)
            self.属性描述 += 属性.技能等级加成('所有',100,100,1)
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        pass
    
class 装备255(装备):
    名称 = '无言之罪恶'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '板甲'
    属性1描述 = '最终伤害:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '最终伤害:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.最终伤害加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2])/100)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2])/100)
        if 改造等级 >= 7:
            self.属性描述 += 属性.最终伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2])/100)   
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += 属性.百分比力智加成(0.22)
        if 属性.获取改造(self.部位) >= 5:
            self.属性描述 += 属性.最终伤害加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 +=0.20
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '移动速度 +20%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '最终伤害 +{}%<br>'.format(4 *改造等级)
        if 改造等级 >= 1:
            temp += '百分比力智 +22%<br>'
        if 改造等级 >= 5:
            temp += '最终伤害 +10%<br>'
        if 属性.产物升级 == 1:
            属性.装备描述 = 1
            self.产物升级(属性)
            temp += self.属性描述
            属性.装备描述 = 0
        return temp               

class 装备256(装备):
    名称 = '无我之轮回'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '重甲'
    属性1描述 = '百分比三攻:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比三攻:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.百分比三攻加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2])/100)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2])/100)
        if 改造等级 >= 7:
            self.属性描述 += 属性.百分比三攻加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2])/100)  
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += 属性.百分比力智加成(0.22)
        if 属性.获取改造(self.部位) >= 5:
            self.属性描述 += 属性.最终伤害加成(0.10)
        pass
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += 属性.最终伤害加成(0.10)
            self.属性描述 += 属性.百分比三攻加成(0.11)
        if 属性.获取改造(self.部位) >= 5:
            self.属性描述 += 属性.附加伤害加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.05)
        self.属性描述 += 属性.移动速度增加(0.05)
        self.属性描述 += 属性.释放速度增加(0.075)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +5%<br>'
        temp += '释放速度 +7.5%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '百分比三攻 +{}%<br>'.format(4 *改造等级)
        if 改造等级 >= 1:
            temp += '最终伤害 +10%<br>'
            temp += '百分比三攻 +11%<br>'
        if 改造等级 >= 5:
            temp += '附加伤害 +10%<br>'
        if 属性.产物升级 == 1:
            属性.装备描述 = 1
            self.产物升级(属性)
            temp += self.属性描述
            属性.装备描述 = 0
        return temp        
        return temp        

# endregion

#region  超界
class 装备311(装备):
    名称 = '超界·苍天之幕：卷层云'
    所属套装 = '超界·苍穹之云'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.21)
        self.属性描述 += 属性.最终伤害加成(0.05)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +21%<br>'
        temp += '最终伤害 +5%<br>'
        return temp     
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=80)
        self.属性描述 += 属性.被动增加(转职被动智力=100)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.22)
    

class 装备312(装备):
    名称 = '超界·苍天之碧：卷云'
    所属套装 = '超界·苍穹之云'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':37, '轻甲':45, '重甲':41, '板甲':37}
    智力 = {'布甲':45, '皮甲':37, '轻甲':30, '重甲':30, '板甲':37}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.20)
        self.属性描述 += 属性.最终伤害加成(0.05)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '技能攻击力 +20%<br>'
        temp += '最终伤害 +5%<br>'
        return temp   
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=270)
        self.属性描述 += 属性.被动增加(转职被动智力=270)
    
class 装备313(装备):
    名称 = '超界·苍天之流：层云'
    所属套装 = '超界·苍穹之云'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.21)
        self.属性描述 += 属性.最终伤害加成(0.05)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +21%<br>'
        temp += '最终伤害 +5%<br>'
        return temp     
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=80)
        self.属性描述 += 属性.被动增加(转职被动智力=100)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.22)
    

class 装备314(装备):
    名称 = '超界·苍天之岭：积云'
    所属套装 = '超界·苍穹之云'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.20)
        self.属性描述 += 属性.最终伤害加成(0.05)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +20%<br>'
        temp += '最终伤害 +5%<br>'
        return temp    
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=80)
        self.属性描述 += 属性.被动增加(转职被动智力=100)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.22)
    
class 装备315(装备):
    名称 = '超界·苍天之隙：高积云'
    所属套装 = '超界·苍穹之云'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.20)
        self.属性描述 += 属性.最终伤害加成(0.05)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.04)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +20%<br>'
        temp += '最终伤害 +5%<br>'
        temp += '移动速度 +4%<br>'
        return temp     
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=200)
        self.属性描述 += 属性.被动增加(转职被动智力=200)
    
class 装备316(装备):
    名称 = '超界·芒种：绵延的生命'
    所属套装 = '超界·永恒的季节'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.20)
        self.属性描述 += 属性.技能等级加成('所有', 1, 45, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +20%<br>'
        temp += 'Lv1-45 技能等级+1<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 1, 45, 1)

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=30)
        self.属性描述 += 属性.被动增加(转职被动智力=30)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.22)
    

class 装备317(装备):
    名称 = '超界·雨水：长青的群山'
    所属套装 = '超界·永恒的季节'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':37, '轻甲':45, '重甲':41, '板甲':37}
    智力 = {'布甲':45, '皮甲':37, '轻甲':30, '重甲':30, '板甲':37}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.20)
        self.属性描述 += 属性.技能等级加成('所有', 1, 45, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +20%<br>'
        temp += 'Lv1-45 技能等级+1<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 1, 45, 1)

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=200)
        self.属性描述 += 属性.被动增加(转职被动智力=200)
    

class 装备318(装备):
    名称 = '超界·白露：不熄的光明'
    所属套装 = '超界·永恒的季节'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.21)
        self.属性描述 += 属性.技能等级加成('所有', 35, 48, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +21%<br>'
        temp += 'Lv35-48 技能等级+1<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 35, 48, 1)

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=90)
        self.属性描述 += 属性.被动增加(转职被动智力=90)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.22)
    

class 装备319(装备):
    名称 = '超界·霜降：凝结的冰霜'
    所属套装 = '超界·永恒的季节'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.21)
        self.属性描述 += 属性.技能等级加成('所有', 35, 48, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +21%<br>'
        temp += 'Lv35-48 技能等级+1<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 35, 48, 1)

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=90)
        self.属性描述 += 属性.被动增加(转职被动智力=90)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.22)
    

class 装备320(装备):
    名称 = '超界·小寒：澄净的心灵'
    所属套装 = '超界·永恒的季节'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.10)
        self.属性描述 += 属性.暴击伤害加成(0.11)
        self.属性描述 += 属性.技能等级加成('所有', 1, 85, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '移动速度 +10%<br>'
        temp += '暴击伤害 +11%<br>'
        temp += 'Lv1-85 技能等级+1<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 1, 85, 1)

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=40)
        self.属性描述 += 属性.被动增加(转职被动智力=40)
    

class 装备321(装备):
    名称 = '超界·海豚座的羞涩'
    所属套装 = '超界·亿万年的星光'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.20)
        self.属性描述 += 属性.技能等级加成('所有', 85, 85, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +20%<br>'
        temp += 'Lv85 技能等级+1<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 85, 85, 1)

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.22)

    

class 装备322(装备):
    名称 = '超界·北极星的魅力'
    所属套装 = '超界·亿万年的星光'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':37, '轻甲':45, '重甲':41, '板甲':37}
    智力 = {'布甲':45, '皮甲':37, '轻甲':30, '重甲':30, '板甲':37}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.18)
        self.属性描述 += 属性.物理暴击率增加(0.12)
        self.属性描述 += 属性.魔法暴击率增加(0.12)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass

    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '技能攻击力 +18%<br>'
        temp += '物理暴击率 +12%<br>'
        temp += '魔法暴击率 +12%<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=270)
        self.属性描述 += 属性.被动增加(转职被动智力=270)
    

class 装备323(装备):
    名称 = '超界·织女星的凝望'
    所属套装 = '超界·亿万年的星光'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.20)
        self.属性描述 += 属性.技能等级加成('所有', 50, 50, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +20%<br>'
        temp += 'Lv50 技能等级+1<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 50, 50, 1)

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.22)
    

class 装备324(装备):
    名称 = '超界·天琴座的高洁'
    所属套装 = '超界·亿万年的星光'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.21)
        self.属性描述 += 属性.技能等级加成('所有', 50, 50, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +21%<br>'
        temp += 'Lv50 技能等级+1<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 50, 50, 1)

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.22)
    

class 装备325(装备):
    名称 = '超界·天鹅座的朦胧'
    所属套装 = '超界·亿万年的星光'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(40)
        self.属性描述 += 属性.技能等级加成('所有', 85, 85, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.物理暴击率增加(0.02)
        self.属性描述 += 属性.魔法暴击率增加(0.02)
        self.属性描述 += 属性.移动速度增加(0.04)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '所有属性强化 +40<br>'
        temp += 'Lv85 技能等级+1<br>'
        temp += '物理暴击率 +2%<br>'
        temp += '魔法暴击率 +2%<br>'
        temp += '移动速度 +4%<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 85, 85, 1)

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=140)
        self.属性描述 += 属性.被动增加(转职被动智力=200)
    

class 装备326(装备):
    名称 = '超界·费诺的愤怒之勇'
    所属套装 = '超界·精灵的荣耀'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.25)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +25%<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=100)
        self.属性描述 += 属性.被动增加(转职被动智力=100)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.22)
    

class 装备327(装备):
    名称 = '超界·维拉的光明净化'
    所属套装 = '超界·精灵的荣耀'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':37, '轻甲':45, '重甲':41, '板甲':37}
    智力 = {'布甲':45, '皮甲':37, '轻甲':30, '重甲':30, '板甲':37}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.23)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.06)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '技能攻击力 +23%<br>'
        temp += '攻击速度 +6%<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=270)
        self.属性描述 += 属性.被动增加(转职被动智力=270)
    

class 装备328(装备):
    名称 = '超界·凯兰崔尔的决断'
    所属套装 = '超界·精灵的荣耀'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.25)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '最终伤害 +25%<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=100)
        self.属性描述 += 属性.被动增加(转职被动智力=100)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.22)
    

class 装备329(装备):
    名称 = '超界·梵雅的绝世容颜'
    所属套装 = '超界·精灵的荣耀'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.24)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +24%<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=100)
        self.属性描述 += 属性.被动增加(转职被动智力=100)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.22)
    

class 装备330(装备):
    名称 = '超界·伊露维塔的创生'
    所属套装 = '超界·精灵的荣耀'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.24)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.10)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +24%<br>'
        temp += '移动速度 +10%<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=200)
        self.属性描述 += 属性.被动增加(转职被动智力=200)
    

class 装备331(装备):
    名称 = '超界·梦纤石的牵绊'
    所属套装 = '超界·幸运的五彩石'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.18)
        self.属性描述 += 属性.冰属性强化加成(20)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +18%<br>'
        temp += '冰属性强化 +20<br>'
        return temp
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=100)
        self.属性描述 += 属性.被动增加(转职被动智力=100)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.22)
    

class 装备332(装备):
    名称 = '超界·君清石的思念'
    所属套装 = '超界·幸运的五彩石'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':37, '轻甲':45, '重甲':41, '板甲':37}
    智力 = {'布甲':45, '皮甲':37, '轻甲':30, '重甲':30, '板甲':37}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.17)
        self.属性描述 += 属性.火属性强化加成(20)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '技能攻击力 +17%<br>'
        temp += '火属性强化 +20<br>'
        return temp
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=270)
        self.属性描述 += 属性.被动增加(转职被动智力=270)
    

class 装备333(装备):
    名称 = '超界·凤瞳石的轻鸣'
    所属套装 = '超界·幸运的五彩石'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.17)
        self.属性描述 += 属性.光属性强化加成(20)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +17%<br>'
        temp += '光属性强化 +20<br>'
        return temp
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=100)
        self.属性描述 += 属性.被动增加(转职被动智力=100)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.22)
    

class 装备334(装备):
    名称 = '超界·琥冥石的乖戾'
    所属套装 = '超界·幸运的五彩石'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.18)
        self.属性描述 += 属性.所有属性强化加成(20)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +18%<br>'
        temp += '所有属性强化 +20<br>'
        return temp
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=100)
        self.属性描述 += 属性.被动增加(转职被动智力=100)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.22)
    

class 装备335(装备):
    名称 = '超界·诛璃石的断杀'
    所属套装 = '超界·幸运的五彩石'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.18)
        self.属性描述 += 属性.暗属性强化加成(20)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.04)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +18%<br>'
        temp += '暗属性强化 +20<br>'
        temp += '移动速度 +4%<br>'
        return temp

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=200)
        self.属性描述 += 属性.被动增加(转职被动智力=200)
    
#endregion

#region  100改造&传说
class 装备362(装备):
    名称 = '轮回·黑暗幽灵紫杉胸甲'
    模式 = 1
    所属套装 = '智慧产物'
    所属套装2 = '堕落的暗黑之力'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    属性1描述 = '附加伤害:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '附加伤害:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.附加伤害加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2])/100)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2])/100)
        if 改造等级 >= 7:
            self.属性描述 += 属性.附加伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2])/100)
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.15)
        self.属性描述 += 属性.百分比力智加成(0.08)
        self.属性描述 += 属性.伤害增加加成(0.11)
        pass
    def 进图属性(self, 属性):
        属性.力量 += 25 * 属性.获取改造(self.部位)
        属性.智力 += 25 * 属性.获取改造(self.部位)
        self.属性描述 += 属性.技能攻击力加成(0.02 * 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +15%<br>'
        temp += '百分比力智 +8%<br>'
        temp += '伤害增加 +11%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '力量 +' + str(25 * 改造等级) + '<br>'
            temp += '智力 +' + str(25 * 改造等级) + '<br>'
            temp += '技能攻击力 +' + str(2 * 改造等级) + '%<br>'
        if 属性.产物升级 == 1:
            属性.装备描述 = 1
            self.产物升级(属性)
            temp += self.属性描述
            属性.装备描述 = 0
        return temp
    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        属性.体精固定加成(25 * 属性.获取改造(self.部位))
        属性.力智固定加成(25 * 属性.获取改造(self.部位))
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.03)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.03)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.2)
        self.属性描述 += 属性.被动增加(守护恩赐体精=145)
        self.属性描述 += 属性.被动增加(转职被动智力=45)

    

class 装备363(装备):
    名称 = '时空：黑暗幽灵紫杉胸甲'
    模式 = 1
    所属套装 = '堕落的暗黑之力'
    等级 = 100
    品质 = '传说'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':47, '轻甲':57, '重甲':52, '板甲':47}
    智力 = {'布甲':57, '皮甲':47, '轻甲':37, '重甲':37, '板甲':47}
    类型 = '轻甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.15)
        self.属性描述 += 属性.百分比力智加成(0.08)
        self.属性描述 += 属性.伤害增加加成(0.06)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +15%<br>'
        temp += '百分比力智 +8%<br>'
        temp += '伤害增加 +6%<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.03)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.03)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.2)
        self.属性描述 += 属性.被动增加(守护恩赐体精=105)
        self.属性描述 += 属性.被动增加(转职被动智力=105)
    
class 装备364(装备):
    名称 = '黑暗幽灵紫杉护肩'
    模式 = 1
    所属套装 = '堕落的暗黑之力'
    等级 = 100
    品质 = '传说'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':39, '轻甲':45, '重甲':42, '板甲':39}
    智力 = {'布甲':45, '皮甲':39, '轻甲':31, '重甲':31, '板甲':39}
    类型 = '轻甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.12)
        self.属性描述 += 属性.百分比力智加成(0.10)
        self.属性描述 += 属性.所有属性强化加成(24)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +12%<br>'
        temp += '百分比力智 +10%<br>'
        temp += '所有属性强化 +24<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass


    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=216)
        self.属性描述 += 属性.被动增加(转职被动智力=216)
    

class 装备365(装备):
    名称 = '黑暗幽灵紫杉护腿'
    模式 = 1
    所属套装 = '堕落的暗黑之力'
    等级 = 100
    品质 = '传说'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':47, '轻甲':57, '重甲':52, '板甲':47}
    智力 = {'布甲':57, '皮甲':47, '轻甲':37, '重甲':37, '板甲':47}
    类型 = '轻甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.15)
        self.属性描述 += 属性.百分比力智加成(0.08)
        self.属性描述 += 属性.所有属性强化加成(22)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +15%<br>'
        temp += '百分比力智 +8%<br>'
        temp += '所有属性强化 +22<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.2)
        self.属性描述 += 属性.被动增加(守护恩赐体精=80)
        self.属性描述 += 属性.被动增加(转职被动智力=80)

    
class 装备366(装备):
    名称 = '黑暗幽灵紫杉腰带'
    模式 = 1
    所属套装 = '堕落的暗黑之力'
    等级 = 100
    品质 = '传说'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':29, '轻甲':34, '重甲':31, '板甲':29}
    智力 = {'布甲':34, '皮甲':29, '轻甲':23, '重甲':23, '板甲':29}
    类型 = '轻甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.12)
        self.属性描述 += 属性.百分比力智加成(0.10)
        self.属性描述 += 属性.所有属性强化加成(24)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +12%<br>'
        temp += '百分比力智 +10%<br>'
        temp += '所有属性强化 +24<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.2)
        self.属性描述 += 属性.被动增加(守护恩赐体精=80)
        self.属性描述 += 属性.被动增加(转职被动智力=80)

    

class 装备367(装备):
    名称 = '黑暗幽灵紫杉长靴'
    模式 = 1
    所属套装 = '堕落的暗黑之力'
    等级 = 100
    品质 = '传说'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':29, '轻甲':34, '重甲':31, '板甲':29}
    智力 = {'布甲':34, '皮甲':29, '轻甲':23, '重甲':23, '板甲':29}
    类型 = '轻甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.05)
        self.属性描述 += 属性.暴击伤害加成(0.08)
        self.属性描述 += 属性.百分比力智加成(0.10)
        self.属性描述 += 属性.所有属性强化加成(24)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.04)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +5%<br>'
        temp += '暴击伤害 +8%<br>'
        temp += '百分比力智 +10%<br>'
        temp += '所有属性强化 +24<br>'
        temp += '移动速度 +4%<br>'
        return temp
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=160)
        self.属性描述 += 属性.被动增加(转职被动智力=160)
    

class 装备370(装备):
    名称 = '黑暗幽灵紫杉胸甲'
    模式 = 1
    所属套装 = '堕落的暗黑之力'
    等级 = 100
    品质 = '传说'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':47, '轻甲':57, '重甲':52, '板甲':47}
    智力 = {'布甲':57, '皮甲':47, '轻甲':37, '重甲':37, '板甲':47}
    类型 = '轻甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.15)
        self.属性描述 += 属性.百分比力智加成(0.08)
        self.属性描述 += 属性.所有属性强化加成(22)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +15%<br>'
        temp += '百分比力智 +8%<br>'
        temp += '所有属性强化 +22<br>'
        return temp
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.03)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.03)
        self.属性描述 += 属性.被动增加(守护恩赐体精=162)
        self.属性描述 += 属性.被动增加(转职被动智力=285)
    

#endregion

#region 改造低级SS
class 装备398(装备):
    名称 = '刻印：文韬妙策上衣'
    所属套装 = '兵法之神'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.08)
        属性.物理攻击力 += 100
        属性.魔法攻击力 += 100
        属性.独立攻击力 += 100
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +8%<br>'
        return temp

class 装备399(装备):
    名称 = '刻印：龙韬秘法护肩'
    所属套装 = '兵法之神'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':37, '轻甲':45, '重甲':41, '板甲':37}
    智力 = {'布甲':45, '皮甲':37, '轻甲':30, '重甲':30, '板甲':37}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.08)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +8%<br>'
        return temp 

class 装备400(装备):
    名称 = '刻印：虎韬妙计下装'
    所属套装 = '兵法之神'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.08)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.05)
        self.属性描述 += 属性.释放速度增加(0.075)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +8%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '释放速度 +7.5%<br>'
        return temp      

class 装备401(装备):
    名称 = '刻印：豹韬飞跃战靴'
    所属套装 = '兵法之神'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.08)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.14)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '最终伤害 +8%<br>'
        temp += '移动速度 +14%<br>'
        return temp
     

class 装备402(装备):
    名称 = '刻印：武韬秘典腰带'
    所属套装 = '兵法之神'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.08)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.物理暴击率增加(0.05)
        self.属性描述 += 属性.魔法暴击率增加(0.05)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +8%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp 

class 装备410(装备):
    名称 = '魔战无双胸甲'
    所属套装 = '魔战无双'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.黄字 = max(属性.黄字, 0.10)
        属性.加算冷却缩减 += 0.12
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.释放速度增加(0.05)
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'            
        temp += '黄字 +10%(取最高值)<br>'
        temp += '技能冷却 -12%(加算)<br>'
        temp += '释放速度 +5%<br>'
        return temp     

class 装备411(装备):
    名称 = '魔战无双肩甲'
    所属套装 = '魔战无双'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':34, '轻甲':41, '重甲':37, '板甲':34}	
    智力 = {'布甲':41, '皮甲':34, '轻甲':28, '重甲':28, '板甲':34}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 30, 48, 2)
        try:
            属性.技能栏[属性.技能序号['基础精通']].倍率 *= 2.5
        except:
            pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.12)
        self.属性描述 += 属性.释放速度增加(0.12)
        self.属性描述 += 属性.移动速度增加(0.15)
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'     
        temp += 'Lv30-48 技能等级+2<br>'
        temp += '基础精通效果 +150%<br>'
        temp += '攻击速度 +12%<br>'
        temp += '释放速度 +12%<br>'
        temp += '移动速度 +15%<br>'
        return temp     

class 装备412(装备):
    名称 = '魔战无双腿甲'
    所属套装 = '魔战无双'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.加算冷却缩减 += 0.10
        self.属性描述 += 属性.技能等级加成('所有', 85, 85, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.05)
        self.属性描述 += 属性.释放速度增加(0.05)
        self.属性描述 += 属性.移动速度增加(0.05)
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '技能冷却 -10%(加算)<br>'
        temp += 'Lv85 技能等级+1<br>'
        temp += '攻击速度 +5%<br>'
        temp += '释放速度 +5%<br>'
        temp += '移动速度 +5%<br>'
        return temp   

class 装备413(装备):
    名称 = '魔战无双腰带'
    所属套装 = '魔战无双'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.加算冷却缩减 += 0.10
        self.属性描述 += 属性.技能等级加成('所有', 80, 80, 2)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '技能冷却 -10%(加算)<br>'
        temp += 'Lv80 技能等级+2<br>'
        return temp     

class 装备414(装备):
    名称 = '魔战无双短靴'
    所属套装 = '魔战无双'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':88, '皮甲':113, '轻甲':119, '重甲':116, '板甲':113}	
    智力 = {'布甲':119, '皮甲':113, '轻甲':108, '重甲':108, '板甲':113}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.08)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.06)
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '百分比三攻 +8%<br>'
        temp += '移动速度 +6%<br>'
        return temp     

class 装备416(装备):
    名称 = '霸域英豪胸甲'
    所属套装 = '霸域英豪'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':55, '皮甲':98, '轻甲':106, '重甲':101, '板甲':98}	
    智力 = {'布甲':106, '皮甲':98, '轻甲':89, '重甲':89, '板甲':98}	
    类型 = '板甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.物理攻击力 += 100
        属性.魔法攻击力 += 100
        属性.独立攻击力 += 100
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '物理攻击力 +100<br>'
        temp += '魔法攻击力 +100<br>'
        temp += '独立攻击力 +100<br>'
        return temp   

class 装备417(装备):
    名称 = '霸域英豪护肩'
    所属套装 = '霸域英豪'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':34, '轻甲':41, '重甲':37, '板甲':34}	
    智力 = {'布甲':41, '皮甲':34, '轻甲':28, '重甲':28, '板甲':34}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.爆伤 = max(属性.爆伤, 0.15)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.物理暴击率增加(0.07)
        self.属性描述 += 属性.魔法暴击率增加(0.07)
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '爆伤 +15%(取最高值)<br>'
        temp += '物理暴击率 +7%<br>'
        temp += '魔法暴击率 +7%<br>'
        return temp        

class 装备418(装备):
    名称 = '霸域英豪护腿'
    所属套装 = '霸域英豪'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':55, '皮甲':98, '轻甲':106, '重甲':101, '板甲':98}	
    智力 = {'布甲':106, '皮甲':98, '轻甲':89, '重甲':89, '板甲':98}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.物理攻击力 += 100
        属性.魔法攻击力 += 100
        属性.独立攻击力 += 100
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '物理攻击力 +100<br>'
        temp += '魔法攻击力 +100<br>'
        temp += '独立攻击力 +100<br>'
        return temp       

class 装备419(装备):
    名称 = '霸域英豪腰带'
    所属套装 = '霸域英豪'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':165, '皮甲':190, '轻甲':196, '重甲':193, '板甲':190}	
    智力 = {'布甲':196, '皮甲':190, '轻甲':185, '重甲':185, '板甲':190}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        return temp       

class 装备420(装备):
    名称 = '霸域英豪战靴'
    所属套装 = '霸域英豪'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.3)
        self.属性描述 += 属性.移动速度增加(0.3)
        self.属性描述 += 属性.释放速度增加(0.3)
        self.属性描述 += 属性.攻击速度增加(0.02)
        self.属性描述 += 属性.移动速度增加(0.06)
        self.属性描述 += 属性.释放速度增加(0.03)
        self.属性描述 += 属性.物理暴击率增加(0.1)
        self.属性描述 += 属性.魔法暴击率增加(0.1)
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '攻击速度 +30%<br>'
        temp += '移动速度 +30%<br>'
        temp += '释放速度 +30%<br>'
        temp += '攻击速度 +2%<br>'
        temp += '移动速度 +6%<br>'
        temp += '释放速度 +3%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp    

class 装备422(装备):
    名称 = '千蛛碎影之毒牙胸甲'
    所属套装 = '千蛛碎影'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':154, '皮甲':197, '轻甲':205, '重甲':200, '板甲':197}	
    智力 = {'布甲':205, '皮甲':197, '轻甲':188, '重甲':188, '板甲':197}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.固定减防 = 36000 * 千蛛减防
        pass
    def 进图属性(self, 属性):
        if 属性.职业 == '街霸':
            for i in 属性.技能栏:
                if i.是否有伤害 == 1:
                    i.中毒倍率 += 0.2
                    if 属性.角色 == '格斗家(女)':
                        i.涂毒倍率 += 0.2
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '中毒、涂毒伤害 +20%<br>'
        if 千蛛减防 == 1:
            temp += '固定减防 +36000(最多叠加1次)<br>'
        return temp      

class 装备423(装备):
    名称 = '千蛛碎影之蛛丝肩甲'
    所属套装 = '千蛛碎影'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':110, '皮甲':144, '轻甲':151, '重甲':147, '板甲':144}	
    智力 = {'布甲':151, '皮甲':144, '轻甲':138, '重甲':138, '板甲':144}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.固定减防 = 36000 * 千蛛减防
        self.属性描述 += 属性.技能等级加成('所有', 48, 48, 1)
        if 属性.职业 == '街霸' and 属性.角色 == '格斗家(男)':
            for i in 属性.技能栏:
                if i.是否有伤害 == 1:
                    i.感电倍率 += 0.2
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += 'Lv48 技能等级+1<br>'
        temp += '感电伤害 +20%<br>'
        if 千蛛减防 == 1:
            temp += '固定减防 +36000(最多叠加1次)<br>'
        return temp      

class 装备424(装备):
    名称 = '千蛛碎影之蛛网护腿'
    所属套装 = '千蛛碎影'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':154, '皮甲':197, '轻甲':205, '重甲':200, '板甲':197}	
    智力 = {'布甲':205, '皮甲':197, '轻甲':188, '重甲':188, '板甲':197}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.固定减防 = 36000 * 千蛛减防
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        if 千蛛减防 == 1:
            temp += '固定减防 +36000(最多叠加1次)<br>'
        return temp

class 装备425(装备):
    名称 = '千蛛碎影之蛛刺腰带'
    所属套装 = '千蛛碎影'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':110, '皮甲':135, '轻甲':141, '重甲':138, '板甲':135}	
    智力 = {'布甲':141, '皮甲':135, '轻甲':130, '重甲':130, '板甲':135}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 48, 48, 1)
        属性.固定减防 = 36000 * 千蛛减防
        pass
    def 进图属性(self, 属性):
        if 属性.职业 == '街霸':
            for i in 属性.技能栏:
                if i.是否有伤害 == 1:
                    i.灼伤倍率 += 0.2
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += 'Lv48 技能等级+1<br>'
        temp += '灼伤伤害 +20%<br>'
        if 千蛛减防 == 1:
            temp += '固定减防 +36000(最多叠加1次)<br>'
        return temp    

class 装备426(装备):
    名称 = '千蛛碎影之利齿战靴'
    所属套装 = '千蛛碎影'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':110, '皮甲':135, '轻甲':141, '重甲':138, '板甲':135}	
    智力 = {'布甲':141, '皮甲':135, '轻甲':130, '重甲':130, '板甲':135}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 48, 48, 1)
        属性.固定减防 = 36000 * 千蛛减防
        pass
    def 进图属性(self, 属性):
        if 属性.职业 == '街霸':
            for i in 属性.技能栏:
                if i.是否有伤害 == 1:
                    i.出血倍率 += 1.2
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += 'Lv48 技能等级+1<br>'
        temp += '出血伤害 +20%<br>'
        if 千蛛减防 == 1:
            temp += '固定减防 +36000(最多叠加1次)<br>'
        return temp       

class 装备428(装备):
    名称 = '誓血之盟铠甲'
    所属套装 = '誓血之盟'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':220, '皮甲':263, '轻甲':271, '重甲':266, '板甲':263}	
    智力 = {'布甲':271, '皮甲':263, '轻甲':254, '重甲':254, '板甲':263}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.力量 += 200
        属性.智力 += 200
        self.属性描述 += 属性.攻击速度增加(0.14)
        self.属性描述 += 属性.释放速度增加(0.22)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '攻击速度 +14%<br>'
        temp += '释放速度 +22%<br>'
        temp += '力量 +200<br>'
        temp += '智力 +200<br>'
        return temp       

class 装备429(装备):
    名称 = '誓血之盟肩甲'
    所属套装 = '誓血之盟'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':83, '皮甲':117, '轻甲':123, '重甲':120, '板甲':117}	
    智力 = {'布甲':123, '皮甲':117, '轻甲':110, '重甲':110, '板甲':117}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.物理攻击力 += 116
        属性.魔法攻击力 += 116
        属性.独立攻击力 += 116
        self.属性描述 += 属性.伤害增加加成(0.04)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '伤害增加 +4%<br>'
        temp += '物理攻击 +116<br>'
        temp += '魔法攻击 +116<br>'
        temp += '独立攻击 +116<br>'
        return temp
    

class 装备430(装备):
    名称 = '誓血之盟腿甲'
    所属套装 = '誓血之盟'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.物理攻击力 += 138
        属性.魔法攻击力 += 138
        属性.独立攻击力 += 138
        pass
    def 进图属性(self, 属性):#mp<85%
        self.属性描述 += 属性.物理暴击率增加(0.15)
        self.属性描述 += 属性.魔法暴击率增加(0.15)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '物理暴击率 +15%<br>'
        temp += '魔法暴击率 +15%<br>'
        temp += '物理攻击 +138<br>'
        temp += '魔法攻击 +138<br>'
        temp += '独立攻击 +138<br>'
        return temp     

class 装备431(装备):
    名称 = '誓血之盟腰带'
    所属套装 = '誓血之盟'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.05)
        pass
    def 进图属性(self, 属性):
        属性.物理攻击力 += 100
        属性.魔法攻击力 += 100
        属性.独立攻击力 += 100
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '百分比三攻 +5%<br>'
        temp += '物理攻击 +100<br>'
        temp += '魔法攻击 +100<br>'
        temp += '独立攻击 +100<br>'
        return temp       

class 装备432(装备):
    名称 = '誓血之盟战靴'
    所属套装 = '誓血之盟'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(14)
        属性.物理攻击力 += 100
        属性.魔法攻击力 += 100
        属性.独立攻击力 += 100
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.05)
        self.属性描述 += 属性.移动速度增加(0.09)
        self.属性描述 += 属性.释放速度增加(0.07)
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '所有属性强化 +14<br>'
        temp += '物理攻击 +100<br>'
        temp += '魔法攻击 +100<br>'
        temp += '独立攻击 +100<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +9%<br>'
        temp += '释放速度 +7%<br>'
        return temp       



class 装备434(装备):
    名称 = '天御雷罚战甲'
    所属套装 = '天御之灾'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.光属性强化加成(24)
        属性.物理攻击力 += 74
        属性.魔法攻击力 += 74
        属性.独立攻击力 += 74
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.物理暴击率增加(0.03)
        self.属性描述 += 属性.魔法暴击率增加(0.03)
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '光属性强化 +24<br>'
        temp += '物理暴击率 +3%<br>'
        temp += '魔法暴击率 +3%<br>'
        return temp     

class 装备435(装备):
    名称 = '天御虫噬战甲'
    所属套装 = '天御之灾'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':34, '轻甲':41, '重甲':37, '板甲':34}	
    智力 = {'布甲':41, '皮甲':34, '轻甲':28, '重甲':28, '板甲':34}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暗属性强化加成(24)
        属性.物理攻击力 += 74
        属性.魔法攻击力 += 74
        属性.独立攻击力 += 74
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.物理暴击率增加(0.03)
        self.属性描述 += 属性.魔法暴击率增加(0.03)
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '暗属性强化 +24<br>'
        temp += '物理攻击力 +74<br>'
        temp += '魔法攻击力 +74<br>'
        temp += '独立攻击力 +74<br>'
        temp += '物理暴击率 +3%<br>'
        temp += '魔法暴击率 +3%<br>'
        return temp      

class 装备436(装备):
    名称 = '天御火袭战甲'
    所属套装 = '天御之灾'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.火属性强化加成(24)
        属性.物理攻击力 += 74
        属性.魔法攻击力 += 74
        属性.独立攻击力 += 74
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.物理暴击率增加(0.03)
        self.属性描述 += 属性.魔法暴击率增加(0.03)
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '火属性强化 +24<br>'
        temp += '物理攻击力 +74<br>'
        temp += '魔法攻击力 +74<br>'
        temp += '独立攻击力 +74<br>'
        temp += '物理暴击率 +3%<br>'
        temp += '魔法暴击率 +3%<br>'
        return temp      

class 装备437(装备):
    名称 = '天御凝霜战甲'
    所属套装 = '天御之灾'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.冰属性强化加成(24)
        属性.物理攻击力 += 74
        属性.魔法攻击力 += 74
        属性.独立攻击力 += 74
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.物理暴击率增加(0.03)
        self.属性描述 += 属性.魔法暴击率增加(0.03)
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '冰属性强化 +24<br>'
        temp += '物理攻击力 +74<br>'
        temp += '魔法攻击力 +74<br>'
        temp += '独立攻击力 +74<br>'
        temp += '物理暴击率 +3%<br>'
        temp += '魔法暴击率 +3%<br>'
        return temp      

class 装备438(装备):
    名称 = '天御风行战甲'
    所属套装 = '天御之灾'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成 (14)
        属性.物理攻击力 += 74
        属性.魔法攻击力 += 74
        属性.独立攻击力 += 74
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.物理暴击率增加(0.03)
        self.属性描述 += 属性.魔法暴击率增加(0.03)
        self.属性描述 += 属性.攻击速度增加(0.08)
        self.属性描述 += 属性.移动速度增加(0.12)
        self.属性描述 += 属性.释放速度增加(0.12)
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '所有属性强化 +14<br>'
        temp += '物理攻击力 +74<br>'
        temp += '魔法攻击力 +74<br>'
        temp += '独立攻击力 +74<br>'
        temp += '物理暴击率 +3%<br>'
        temp += '魔法暴击率 +3%<br>'
        temp += '攻击速度 +8%<br>'
        temp += '移动速度 +12%<br>'
        temp += '释放速度 +12%<br>'
        return temp       

 

class 装备440(装备):
    名称 = '最佳球手的暴走战衣'
    所属套装 = '最佳球手的绝杀'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':94, '皮甲':136, '轻甲':144, '重甲':140, '板甲':136}	
    智力 = {'布甲':144, '皮甲':136, '轻甲':128, '重甲':128, '板甲':136}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.物理攻击力 += 149
        属性.魔法攻击力 += 149
        属性.独立攻击力 += 149
        self.属性描述 += 属性.伤害增加加成(0.04)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '伤害增加 +4%<br>'
        temp += '物理攻击力 +149<br>'
        temp += '魔法攻击力 +149<br>'
        temp += '独立攻击力 +149<br>'
        return temp      

class 装备441(装备):
    名称 = '最佳球手的反击护具'
    所属套装 = '最佳球手的绝杀'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':330, '皮甲':364, '轻甲':371, '重甲':367, '板甲':364}	
    智力 = {'布甲':371, '皮甲':364, '轻甲':358, '重甲':358, '板甲':364}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        return temp      

class 装备442(装备):
    名称 = '最佳球手的奇袭长裤'
    所属套装 = '最佳球手的绝杀'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.爆伤 = max(属性.爆伤, 0.18)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '暴伤 +18%(取最大值)<br>'
        return temp  

class 装备443(装备):
    名称 = '最佳球手的冲锋腰带'
    所属套装 = '最佳球手的绝杀'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.物理攻击力 += 138
        属性.魔法攻击力 += 138
        属性.独立攻击力 += 138
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.回避率 += 0.05
        self.属性描述 += 属性.物理暴击率增加(0.15)
        self.属性描述 += 属性.魔法暴击率增加(0.15)
        self.属性描述 += 属性.命中率增加(0.05)
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '物理攻击力 +138<br>'
        temp += '魔法攻击力 +138<br>'
        temp += '独立攻击力 +138<br>'
        temp += '物理暴击率 +15%<br>'
        temp += '魔法暴击率 +15%<br>'
        temp += '命中率 +5%<br>'
        temp += '回避率 +5%<br>'
        return temp     

class 装备444(装备):
    名称 = '最佳球手的逆袭跑鞋'
    所属套装 = '最佳球手的绝杀'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.06)
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '移动速度 +6%<br>'
        return temp      



class 装备446(装备):
    名称 = '战术之王的御敌胸甲'
    所属套装 = '战术之王的御敌'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':33, '皮甲':76, '轻甲':84, '重甲':79, '板甲':76}	
    智力 = {'布甲':84, '皮甲':76, '轻甲':67, '重甲':67, '板甲':76}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.物理攻击力 += 80
        属性.魔法攻击力 += 80
        属性.独立攻击力 += 80
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.命中率增加(0.02)
        属性.回避率 += 0.02
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '物理攻击力 +80<br>'
        temp += '魔法攻击力 +80<br>'
        temp += '独立攻击力 +80<br>'
        temp += '命中率 +2%<br>'
        temp += '回避率 +2%<br>'
        return temp   

class 装备447(装备):
    名称 = '战术之王的御敌肩甲'
    所属套装 = '战术之王的御敌'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':33, '皮甲':67, '轻甲':74, '重甲':70, '板甲':67}	
    智力 = {'布甲':74, '皮甲':67, '轻甲':61, '重甲':61, '板甲':67}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.10)
        self.属性描述 += 属性.移动速度增加(0.10)
        self.属性描述 += 属性.释放速度增加(0.15)
        self.属性描述 += 属性.命中率增加(0.10)
        属性.回避率 += 0.01
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        temp += '命中率 +10%<br>'
        temp += '回避率 +1%<br>'
        return temp      

class 装备448(装备):
    名称 = '战术之王的御敌护腿'
    所属套装 = '战术之王的御敌'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':33, '皮甲':76, '轻甲':84, '重甲':79, '板甲':76}	
    智力 = {'布甲':84, '皮甲':76, '轻甲':67, '重甲':67, '板甲':76}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.物理暴击率增加(0.12)
        self.属性描述 += 属性.魔法暴击率增加(0.12)
        self.属性描述 += 属性.命中率增加(0.02)
        属性.回避率 += 0.02
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '物理暴击率 +12%<br>'
        temp += '魔法暴击率 +12%<br>'
        temp += '命中率 +2%<br>'
        temp += '回避率 +2%<br>'
        return temp     

class 装备449(装备):
    名称 = '战术之王的御敌腰带'
    所属套装 = '战术之王的御敌'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':33, '皮甲':58, '轻甲':64, '重甲':61, '板甲':58}	
    智力 = {'布甲':64, '皮甲':58, '轻甲':53, '重甲':53, '板甲':58}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(20)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.命中率增加(0.01)
        属性.回避率 += 0.01
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '所有属性强化 +20<br>'
        temp += '命中率 +1%<br>'
        temp += '回避率 +1%<br>'
        return temp    

class 装备450(装备):
    名称 = '战术之王的御敌长靴'
    所属套装 = '战术之王的御敌'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':33, '皮甲':58, '轻甲':64, '重甲':61, '板甲':58}	
    智力 = {'布甲':64, '皮甲':58, '轻甲':53, '重甲':53, '板甲':58}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.力量 += 120
        属性.智力 += 120
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.04)
        self.属性描述 += 属性.命中率增加(0.01)
        属性.回避率 += 0.01
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '力量 +120<br>'
        temp += '智力 +120<br>'
        temp += '移动速度 +4%<br>'
        temp += '命中率 +1%<br>'
        temp += '回避率 +1%<br>'
        return temp     


class 装备452(装备):
    名称 = '暗魅之影上衣'
    所属套装 = '杀意决'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':50, '皮甲':92, '轻甲':100, '重甲':96, '板甲':92}	
    智力 = {'布甲':100, '皮甲':92, '轻甲':84, '重甲':84, '板甲':92}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.黄字 = max(属性.黄字, 0.18)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '黄字 +18%(取最高值)<br>'
        return temp      

class 装备453(装备):
    名称 = '冥殇之刃肩甲'
    所属套装 = '杀意决'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':33, '皮甲':67, '轻甲':74, '重甲':70, '板甲':67}	
    智力 = {'布甲':74, '皮甲':67, '轻甲':61, '重甲':61, '板甲':67}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.物理攻击力 += 66
        属性.魔法攻击力 += 66
        属性.独立攻击力 += 66
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.15)
        self.属性描述 += 属性.物理暴击率增加(0.10)
        self.属性描述 += 属性.魔法暴击率增加(0.10)
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '物理攻击力 +66<br>'
        temp += '魔法攻击力 +66<br>'
        temp += '独立攻击力 +66<br>'
        temp += '攻击速度 +15%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp       

class 装备454(装备):
    名称 = '血舞之牙护腿'
    所属套装 = '杀意决'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':50, '皮甲':92, '轻甲':100, '重甲':96, '板甲':92}	
    智力 = {'布甲':100, '皮甲':92, '轻甲':84, '重甲':84, '板甲':92}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.04)
        属性.物理攻击力 += 121
        属性.魔法攻击力 += 121
        属性.独立攻击力 += 121
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '暴击伤害 +4%<br>'
        temp += '物理攻击力 +121<br>'
        temp += '魔法攻击力 +121<br>'
        temp += '独立攻击力 +121<br>'
        return temp       

class 装备455(装备):
    名称 = '亡灵之帐腰带'
    所属套装 = '杀意决'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':33, '皮甲':58, '轻甲':64, '重甲':61, '板甲':58}	
    智力 = {'布甲':64, '皮甲':58, '轻甲':53, '重甲':53, '板甲':58}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.物理攻击力 += 116
        属性.魔法攻击力 += 116
        属性.独立攻击力 += 116
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '物理攻击力 +116<br>'
        temp += '魔法攻击力 +116<br>'
        temp += '独立攻击力 +116<br>'
        return temp      

class 装备456(装备):
    名称 = '黄泉之风战靴'
    所属套装 = '杀意决'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':33, '皮甲':58, '轻甲':64, '重甲':61, '板甲':58}	
    智力 = {'布甲':64, '皮甲':58, '轻甲':53, '重甲':53, '板甲':58}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(20)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.15)
        self.属性描述 += 属性.移动速度增加(0.22)
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '所有属性强化 +20<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +22%<br>'
        return temp      


class 装备458(装备):
    名称 = '逝魔之疾咒长袍'
    所属套装 = '逝魔之力'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.15)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '百分比三攻 +15%<br>'
        return temp      

class 装备459(装备):
    名称 = '逝魔之灵悟肩甲'
    所属套装 = '逝魔之力'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':34, '轻甲':41, '重甲':37, '板甲':34}	
    智力 = {'布甲':41, '皮甲':34, '轻甲':28, '重甲':28, '板甲':34}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.12)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '百分比三攻 +12%<br>'
        return temp

class 装备460(装备):
    名称 = '逝魔之爆裂长裤'
    所属套装 = '逝魔之力'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.爆伤 = max(属性.爆伤, 0.15)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '爆伤 +15%(取最大值)<br>'
        return temp     

class 装备461(装备):
    名称 = '逝魔之灵心腰带'
    所属套装 = '逝魔之力'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.魔法暴击率增加(0.20)
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '魔法暴击率 +20%<br>'
        return temp      

class 装备462(装备):
    名称 = '逝魔之风速短靴'
    所属套装 = '逝魔之力'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(20)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.16)
        self.属性描述 += 属性.释放速度增加(0.25)
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '所有属性强化 +20<br>'
        temp += '移动速度 +16%<br>'
        temp += '释放速度 +25%<br>'
        return temp   


class 装备464(装备):
    名称 = '封霜雪影长袍'
    所属套装 = '天劫'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.冰属性强化加成(12)
    def 进图属性(self, 属性):
        self.属性描述 += 属性.冰属性强化加成(44 * 天劫减抗)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.魔法暴击率增加(0.05)
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '冰属性强化 +12<br>'
        if 天劫减抗 == 1:
            temp += '冰属性强化 +44<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp      

class 装备465(装备):
    名称 = '蚀日无辉肩甲'
    所属套装 = '天劫'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':34, '轻甲':41, '重甲':37, '板甲':34}	
    智力 = {'布甲':85, '皮甲':78, '轻甲':72, '重甲':72, '板甲':78}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.光属性强化加成(12)
    def 进图属性(self, 属性):
        self.属性描述 += 属性.光属性强化加成(44 * 天劫减抗)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '光属性强化 +12<br>'
        if 天劫减抗 == 1:
            temp += '光属性强化 +44<br>'
        return temp      

class 装备466(装备):
    名称 = '火殒灭炎长裤'
    所属套装 = '天劫'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.火属性强化加成(12)
    def 进图属性(self, 属性):
        self.属性描述 += 属性.火属性强化加成(44 * 天劫减抗)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.魔法暴击率增加(0.05)
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '火属性强化 +12<br>'
        if 天劫减抗 == 1:
            temp += '火属性强化 +44<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp     

class 装备467(装备):
    名称 = '暗殇绝影腰带'
    所属套装 = '天劫'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':75, '皮甲':69, '轻甲':64, '重甲':64, '板甲':69}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暗属性强化加成(12)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.暗属性强化加成(44 * 天劫减抗)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '暗属性强化 +12<br>'
        if 天劫减抗 == 1:
            temp += '暗属性强化 +44<br>'
        return temp      

class 装备468(装备):
    名称 = '闲云碎步短靴'
    所属套装 = '天劫'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':75, '皮甲':69, '轻甲':64, '重甲':64, '板甲':69}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(30)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.06)
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '所有属性强化 +30<br>'
        temp += '移动速度 +6%<br>'
        return temp      
#endregion

#region 100光环传说
class 装备483(装备):
    名称 = '轮回·鲜红血纹皮甲胸铠'
    模式 = 1
    所属套装 = '智慧产物'
    所属套装2 = '鲜红血纹'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    属性1描述 = '附加伤害:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '附加伤害:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.附加伤害加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2])/100)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2])/100)
        if 改造等级 >= 7:
            self.属性描述 += 属性.附加伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2])/100) 
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.20)
        self.属性描述 += 属性.暴击伤害加成(0.15)
        pass
    def 进图属性(self, 属性):
        属性.力量 += 25 * 属性.获取改造(self.部位)
        属性.智力 += 25 * 属性.获取改造(self.部位)
        self.属性描述 += 属性.技能攻击力加成(0.02 * 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +20%<br>'
        temp += '暴击伤害 +15%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '力量 +' + str(25 * 改造等级) + '<br>'
            temp += '智力 +' + str(25 * 改造等级) + '<br>'
            temp += '技能攻击力 +' + str(2 * 改造等级) + '%<br>'
        if 属性.产物升级 == 1:
            属性.装备描述 = 1
            self.产物升级(属性)
            temp += self.属性描述
            属性.装备描述 = 0
        return temp      
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        属性.体精固定加成(25 * 属性.获取改造(self.部位))
        属性.力智固定加成(25 * 属性.获取改造(self.部位))
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.03)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.03)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.2)
        self.属性描述 += 属性.被动增加(守护恩赐体精=145)
        self.属性描述 += 属性.被动增加(转职被动智力=45)

class 装备484(装备):
    名称 = '时空：鲜红血纹皮甲胸铠'
    模式 = 1
    所属套装 = '鲜红血纹'
    等级 = 100
    品质 = '传说'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':47, '轻甲':57, '重甲':52, '板甲':47}
    智力 = {'布甲':57, '皮甲':47, '轻甲':37, '重甲':37, '板甲':47}
    类型 = '皮甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.14)
        self.属性描述 += 属性.暴击伤害加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +14%<br>'
        temp += '暴击伤害 +15%<br>'
        return temp  

class 装备485(装备):
    名称 = '鲜红血纹皮甲护肩'
    模式 = 1
    所属套装 = '鲜红血纹'
    等级 = 100
    品质 = '传说'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':39, '轻甲':45, '重甲':42, '板甲':39}
    智力 = {'布甲':45, '皮甲':39, '轻甲':31, '重甲':31, '板甲':39}
    类型 = '皮甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.05)
        self.属性描述 += 属性.百分比三攻加成(0.04)
        self.属性描述 += 属性.百分比力智加成(0.12)
        self.属性描述 += 属性.所有属性强化加成(10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +5%<br>'
        temp += '百分比三攻 +4%<br>'
        temp += '百分比力智 +12%<br>'
        temp += '所有属性强化 +10<br>'
        return temp    

class 装备486(装备):
    名称 = '鲜红血纹皮甲护腿'
    模式 = 1
    所属套装 = '鲜红血纹'
    等级 = 100
    品质 = '传说'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':47, '轻甲':57, '重甲':52, '板甲':47}
    智力 = {'布甲':57, '皮甲':47, '轻甲':37, '重甲':37, '板甲':47}
    类型 = '皮甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.09)
        self.属性描述 += 属性.暴击伤害加成(0.15)
        self.属性描述 += 属性.所有属性强化加成(14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +9%<br>'
        temp += '暴击伤害 +15%<br>'
        temp += '所有属性强化 +14<br>'
        return temp    

class 装备487(装备):
    名称 = '鲜红血纹皮甲腰带'
    模式 = 1
    所属套装 = '鲜红血纹'
    等级 = 100
    品质 = '传说'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':29, '轻甲':34, '重甲':31, '板甲':29}
    智力 = {'布甲':34, '皮甲':29, '轻甲':23, '重甲':23, '板甲':29}
    类型 = '皮甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.05)
        self.属性描述 += 属性.百分比三攻加成(0.04)
        self.属性描述 += 属性.百分比力智加成(0.12)
        self.属性描述 += 属性.所有属性强化加成(10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +5%<br>'
        temp += '百分比三攻 +4%<br>'
        temp += '百分比力智 +12%<br>'
        temp += '所有属性强化 +10<br>'
        return temp   

class 装备488(装备):
    名称 = '鲜红血纹皮甲战靴'
    模式 = 1
    所属套装 = '鲜红血纹'
    等级 = 100
    品质 = '传说'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':29, '轻甲':34, '重甲':31, '板甲':29}
    智力 = {'布甲':34, '皮甲':29, '轻甲':23, '重甲':23, '板甲':29}
    类型 = '皮甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.05)
        self.属性描述 += 属性.百分比三攻加成(0.04)
        self.属性描述 += 属性.百分比力智加成(0.12)
        self.属性描述 += 属性.所有属性强化加成(10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.04)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +5%<br>'
        temp += '百分比三攻 +4%<br>'
        temp += '百分比力智 +12%<br>'
        temp += '所有属性强化 +10<br>'
        temp += '移动速度 +4%<br>'
        return temp

class 装备490(装备):
    名称 = '鲜红血纹皮甲胸铠'
    模式 = 1
    所属套装 = '鲜红血纹'
    等级 = 100
    品质 = '传说'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':47, '轻甲':57, '重甲':52, '板甲':47}
    智力 = {'布甲':57, '皮甲':47, '轻甲':37, '重甲':37, '板甲':47}
    类型 = '皮甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.09)
        self.属性描述 += 属性.暴击伤害加成(0.15)
        self.属性描述 += 属性.所有属性强化加成(14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +9%<br>'
        temp += '暴击伤害 +15%<br>'
        temp += '所有属性强化 +14<br>'
        return temp
#endregion