from PublicReference.utils.config import *
from .basic_equ import *
#region  100SS武器

class 飘零之花武器(装备):
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    物攻成长 = 0
    魔攻成长 = 0
    独立成长 = 115
    力智成长 = 20
    属性1描述 = '最终伤害:'
    属性1范围 = [15, 5, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '最终伤害:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 城镇属性(self, 属性):
        改造等级 = 属性.获取改造(self.部位)
        属性.技能攻击力加成(0.37)
        属性.附加伤害加成(0.50)
        属性.百分比力智加成(0.20)
        属性.三攻固定加成(self.物攻成长 * 改造等级,self.魔攻成长 * 改造等级,self.独立成长 * 改造等级)
        属性.力智固定加成(self.力智成长 * 改造等级)
        # 属性.物理攻击力 += self.物攻成长 * 改造等级
        # 属性.魔法攻击力 += self.魔攻成长 * 改造等级
        # 属性.独立攻击力 += self.独立成长 * 改造等级
        # 属性.力量 += self.力智成长 * 改造等级
        # 属性.智力 += self.力智成长 * 改造等级
        pass
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.最终伤害加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2])/100)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2])/100)
        if 改造等级 >= 7:
            self.属性描述 += 属性.最终伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2])/100)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if self.力量 != 0:
            temp += '力量 +' + str(self.力量) + '<br>'
        if self.智力 != 0:
            temp += '智力 +' + str(self.智力) + '<br>'
        temp += '物理攻击力 +' + str(self.物理攻击力) + '<br>'
        temp += '魔法攻击力 +' + str(self.魔法攻击力) + '<br>'
        temp += '独立攻击力 +' + str(self.独立攻击力) + '<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 5:
            temp += '技能攻击力 +37%<br>'
            temp += '附加伤害 +50%<br>'
            temp += '百分比力智 +20%<br>'
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '力量 +' + str(self.力智成长 * 改造等级) + '<br>'
            temp += '智力 +' + str(self.力智成长 * 改造等级) + '<br>'
            temp += '物理攻击力 +' + str(self.物攻成长 * 改造等级) + '<br>'
            temp += '魔法攻击力 +' + str(self.魔攻成长 * 改造等级) + '<br>'
            temp += '独立攻击力 +' + str(self.独立成长 * 改造等级) + '<br>'
        if 属性.产物升级 == 1:
            属性.装备描述 = 1
            self.产物升级(属性)
            temp += self.属性描述
            属性.装备描述 = 0
        return temp        


class 装备0(装备):
    名称 = '信念徽章：自由'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '短剑'
    力量 = 0
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        # self.属性描述 += 属性.百分比三攻加成(0.14)
        self.属性描述 += 属性.技能攻击力加成(0.4)
        self.属性描述 += 属性.百分比力智加成(0.18)
        self.属性描述 += 属性.伤害增加加成(0.10)
        self.属性描述 += 属性.附加伤害加成(0.23)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.1)
        self.属性描述 += 属性.移动速度增加(0.1)
        self.属性描述 += 属性.释放速度增加(0.15)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比三攻加成(0.14,1)
        pass

class 装备1(装备):
    名称 = '太极天帝剑'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '太刀'
    力量 = 81
    智力 = 122
    物理攻击力 = 1167
    魔法攻击力 = 1290
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.百分比力智加成(0.14)
        self.属性描述 += 属性.技能攻击力加成(0.3)
        self.属性描述 += 属性.百分比三攻加成(0.38)
        if 属性.太极天帝剑 == 0:
            self.属性描述 += '<font color="#00A2E8">阳之气息：</font><br>'
            self.属性描述 += 属性.技能攻击力加成(0.23)
        if 属性.太极天帝剑 == 1:
            self.属性描述 += '<font color="#00A2E8">阴之气息：</font><br>'
            self.属性描述 += 属性.最终伤害加成(0.21)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.太极天帝剑 == 0:
            self.属性描述 += 属性.攻击速度增加(-0.5)
            self.属性描述 += 属性.移动速度增加(-0.5)
            self.属性描述 += 属性.释放速度增加(-0.5)
        if 属性.太极天帝剑 == 1:
            self.属性描述 += 属性.攻击速度增加(0.2)
            self.属性描述 += 属性.移动速度增加(0.2)
            self.属性描述 += 属性.释放速度增加(0.35)
        pass 
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比力智加成(0.14,1)
        pass

class 装备2(装备):
    名称 = '哈蒂-赎月者'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '钝器'
    力量 = 122
    智力 = 0
    物理攻击力 = 1352
    魔法攻击力 = 1167
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.伤害增加加成(0.14)
        self.属性描述 += 属性.暴击伤害加成(0.30)
        self.属性描述 += 属性.技能攻击力加成(0.40)
        self.属性描述 += 属性.附加伤害加成(0.19)
        
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.15)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.伤害增加加成(0.14,1)
        pass

class 装备3(装备):
    名称 = '卡西姆的大剑'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '巨剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.百分比力智加成(0.14)
        self.属性描述 += 属性.附加伤害加成(0.22)
        self.属性描述 += 属性.最终伤害加成(0.28)
        self.属性描述 += 属性.技能攻击力加成(0.3)
        self.属性描述 += 属性.技能冷却缩减(1, 45, 0.20)
        self.属性描述 += 属性.技能冷却缩减(60, 80, 0.20)
        self.属性描述 += 属性.技能冷却缩减(90, 95, 0.20)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.15)
        self.属性描述 += 属性.移动速度增加(0.15)
        self.属性描述 += 属性.释放速度增加(0.225)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比力智加成(0.14,1)
        pass

class 装备4(装备):
    名称 = '星之海：巴德纳尔'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '光剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1143
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(25)
        #self.属性描述 += 属性.伤害增加加成(0.14)
        self.属性描述 += 属性.技能攻击力加成(0.22)
        self.属性描述 += 属性.最终伤害加成(0.17)
        self.属性描述 += 属性.属性附加加成(0.2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.15)
        self.属性描述 += 属性.移动速度增加(0.15)
        self.属性描述 += 属性.释放速度增加(0.225)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.伤害增加加成(0.14,1)
        pass

class 装备5(装备):
    名称 = '白虎啸魂手套'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '手套'
    力量 = 0
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.附加伤害加成(0.14)
        self.属性描述 += 属性.百分比力智加成(0.33)
        if 属性.职业 == '气功师':
           self.属性描述 += 属性.单技能修改('狮子吼',1.20,0.70)
        pass
    def 进图属性(self, 属性):
        if 属性.职业 == '气功师':
           self.属性描述 += 属性.所有属性强化加成(56)
           self.属性描述 += 属性.技能攻击力加成(0.4)
        pass
    def 其它属性(self, 属性):
        if 属性.职业 == '气功师':
           self.属性描述 += 属性.攻击速度增加(0.1)
           self.属性描述 += 属性.移动速度增加(0.1)
           self.属性描述 += 属性.释放速度增加(0.15)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.附加伤害加成(0.14,1)
        pass

class 装备6(装备):
    名称 = '太阴神：灵龟'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '臂铠'
    力量 = 122
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        # self.属性描述+=属性.附加伤害加成(0.14)
        self.属性描述 += 属性.最终伤害加成(0.10)
        self.属性描述 += 属性.技能攻击力加成(0.35)
        self.属性描述 += 属性.伤害增加加成(0.22)     
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.25)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.15)
        self.属性描述 += 属性.移动速度增加(0.15)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.附加伤害加成(0.14,1)
        pass

class 装备7(装备):
    名称 = '疯狂飓风'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '爪'
    力量 = 81
    智力 = 41
    物理攻击力 = 1229
    魔法攻击力 = 1229
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.单技能等级加成('爪精通', 3)
        self.属性描述 += 属性.单技能等级加成('万毒噬心诀', 1)
        self.属性描述 += 属性.单技能等级加成('燃火轰天炮', 1)
        self.属性描述 += 属性.伤害增加加成(0.40)
        self.属性描述 += 属性.百分比三攻加成(0.15)
        #self.属性描述 += 属性.百分比力智加成(0.14)
        self.属性描述 += 属性.技能攻击力加成(0.22)
        self.属性描述 += 属性.持续伤害加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.15)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比力智加成(0.14,1)
        pass

class 装备8(装备):
    名称 = '猎焰追魂拳套'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '拳套'
    力量 = 81
    智力 = 0
    物理攻击力 = 1290
    魔法攻击力 = 1167
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.最终伤害加成(0.14)
        self.属性描述 += 属性.百分比三攻加成(0.23)
        self.属性描述 += 属性.技能攻击力加成(0.40)
        self.属性描述 += 属性.百分比力智加成(0.10)   
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.25)
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.最终伤害加成(0.14,1)
        pass

class 装备9(装备):
    名称 = '青沙棍'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '东方棍'
    力量 = 81
    智力 = 122
    物理攻击力 = 1167
    魔法攻击力 = 1229
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.伤害增加加成(0.14)
        self.属性描述 += 属性.技能攻击力加成(0.33)
        self.属性描述 += 属性.暴击伤害加成(0.26)
        self.属性描述 += 属性.附加伤害加成(0.34)
        
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.物理暴击率增加(0.06)
        self.属性描述 += 属性.魔法暴击率增加(0.06)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.伤害增加加成(0.14,1)
        pass

class 装备10(装备):
    名称 = '午夜生死轮盘'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '左轮枪'
    力量 = 81
    智力 = 0
    物理攻击力 = 1238
    魔法攻击力 = 1042
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.百分比三攻加成(0.14)
        self.属性描述 += 属性.暴击伤害加成(0.33)
        self.属性描述 += 属性.技能攻击力加成(0.40)
        self.属性描述 += 属性.伤害增加加成(0.08)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.16)
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比三攻加成(0.14,1)
        pass

class 装备11(装备):
    名称 = '雷霆怒啸手枪'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '自动手枪'
    力量 = 0
    智力 = 81
    物理攻击力 = 868
    魔法攻击力 = 1273
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(40)
        self.属性描述 += 属性.单技能等级加成('TN80终结者',3)
        self.属性描述 += 属性.单技能等级加成('GSP猎鹰捕食者形态',3)
        self.属性描述 += 属性.单技能等级加成('GSP猎鹰科罗纳形态',3)
        self.属性描述 += 属性.单技能等级加成('GSP猎鹰旋雷者形态',3)
        #self.属性描述 += 属性.最终伤害加成(0.14)
        self.属性描述 += 属性.附加伤害加成(0.37)
        self.属性描述 += 属性.技能攻击力加成(0.38)
        self.属性描述 += 属性.单技能修改('光反应能量模块',1.2,1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.最终伤害加成(0.14,1)
        pass

class 装备12(装备):
    名称 = '强力打击-X'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '步枪'
    力量 = 81
    智力 = 122
    物理攻击力 = 1331
    魔法攻击力 = 1157
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.单技能等级加成('战地勋章',2)
        self.属性描述 += 属性.单技能等级加成('重火力支援',2)
        self.属性描述 += 属性.单技能等级加成('制空掌握',2)
        self.属性描述 += 属性.单技能等级加成('开火',2)
        #self.属性描述 += 属性.暴击伤害加成(0.14)
        self.属性描述 += 属性.技能攻击力加成(0.36)
        self.属性描述 += 属性.伤害增加加成(0.22)
        self.属性描述 += 属性.百分比力智加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.暴击伤害加成(0.14,1)
        pass

class 装备13(装备):
    名称 = '绝杀：无人生还'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '手炮'
    力量 = 122
    智力 = 0
    物理攻击力 = 1447
    魔法攻击力 = 868
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(40)
        #self.属性描述 += 属性.技能等级加成('所有',50,50,2,1)
        #self.属性描述 += 属性.技能等级加成('所有',85,85,2,1)
        #self.属性描述 += 属性.技能等级加成('所有',100,100,2,1)
        self.属性描述 += 属性.百分比力智加成(0.12)
        self.属性描述 += 属性.技能攻击力加成(0.31)
        self.属性描述 += 属性.百分比三攻加成(0.16)
        self.属性描述 += 属性.伤害增加加成(0.23)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.技能等级加成('所有',50,50,2,1)
        self.属性描述 += 属性.技能等级加成('所有',85,85,2,1)
        self.属性描述 += 属性.技能等级加成('所有',100,100,2,1)
        pass
    
class 装备14(装备):
    名称 = '激光流星弓'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '手弩'
    力量 = 81
    智力 = 81
    物理攻击力 = 1042
    魔法攻击力 = 1157
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.单技能等级加成('弹夹改装',1)
        self.属性描述 += 属性.单技能等级加成('单兵推进器',1)
        #self.属性描述 += 属性.伤害增加加成(0.14)
        self.属性描述 += 属性.技能攻击力加成(0.40)
        self.属性描述 += 属性.百分比三攻加成(0.18)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.28)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.1)
        self.属性描述 += 属性.命中率增加(0.03)
        self.属性描述 += 属性.物理暴击率增加(0.05)
        self.属性描述 += 属性.魔法暴击率增加(0.05)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.伤害增加加成(0.14,1)
        pass

class 装备15(装备):
    名称 = '歼灵灭魂矛'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '矛'
    力量 = 122
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1045
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.35)
        #self.属性描述 += 属性.最终伤害加成(0.14)
        self.属性描述 += 属性.属性附加加成(0.15)
        self.属性描述 += 属性.百分比三攻加成(0.17)
        if 属性.职业 == '战斗法师':
            属性.技能栏[属性.技能序号['碎霸']].额外倍率 = 5
        elif 属性.职业 == '血法师':
            属性.技能栏[属性.技能序号['狱血之牙']].额外倍率 = 5
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.最终伤害加成(0.14,1)
        pass

class 装备16(装备):
    名称 = '混沌之种'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '棍棒'
    力量 = 110
    智力 = 110
    物理攻击力 = 1328
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.伤害增加加成(0.14)
        self.属性描述 += 属性.技能攻击力加成(0.35)
        self.属性描述 += 属性.附加伤害加成(0.30)
        self.属性描述 += 属性.百分比力智加成(0.30)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.伤害增加加成(0.14,1)
        pass

class 装备17(装备):
    名称 = '火焰地狱'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '魔杖'
    力量 = 0
    智力 = 122
    物理攻击力 = 1106
    魔法攻击力 = 1352
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.百分比三攻加成(0.14)
        self.属性描述 += 属性.技能攻击力加成(0.35)
        self.属性描述 += 属性.最终伤害加成(0.17)
        self.属性描述 += 属性.属性附加加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比三攻加成(0.14,1)
        pass

class 装备18(装备):
    名称 = '世界树的根须'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '法杖'
    力量 = 0
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1475
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        # self.属性描述 += 属性.百分比力智加成(0.24)
        self.属性描述 += 属性.技能攻击力加成(0.40)
        self.属性描述 += 属性.附加伤害加成(0.24)
        self.属性描述 += 属性.百分比三攻加成(0.20)
        #self.属性描述 += 属性.暴击伤害加成(0.14)
        self.属性描述 += 属性.技能冷却缩减(1,100,0.1)     
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.释放速度增加(0.2)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.暴击伤害加成(0.14,1)
        pass

class 装备19(装备):
    名称 = '纯白的祈祷'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '扫把'
    力量 = 0
    智力 = 81
    物理攻击力 = 1229
    魔法攻击力 = 1352
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.暴击伤害加成(0.14)
        self.属性描述 += 属性.百分比力智加成(0.31)
        self.属性描述 += 属性.百分比三攻加成(0.15)
        self.属性描述 += 属性.技能攻击力加成(0.40)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(26)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.15)
        self.属性描述 += 属性.移动速度增加(0.15)
        self.属性描述 += 属性.释放速度增加(0.225)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.暴击伤害加成(0.14,1)
        pass

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(转职被动智力=127)
        self.属性描述 += 属性.BUFF增加(BUFFLv=5)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.12, BUFF智力per=1.12)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.2, BUFF魔攻per=1.2, BUFF独立per=1.2)
        self.属性描述 += 属性.觉醒增加(一觉Lv=2)
        self.属性描述 += 属性.觉醒增加(一觉力智=68)
        pass
        
class 装备20(装备):
    名称 = '圣者的慈悲'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '十字架'
    力量 = 0
    智力 = 81
    体力 = 97
    精神 = 97
    物理攻击力 = 1229
    魔法攻击力 = 1167
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.伤害增加加成(0.14)
        self.属性描述 += 属性.技能攻击力加成(0.36)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.24)
        self.属性描述 += 属性.百分比三攻加成(0.36)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.16)
        self.属性描述 += 属性.移动速度增加(0.16)
        self.属性描述 += 属性.释放速度增加(0.24)
        self.属性描述 += 属性.物理暴击率增加(0.08)
        self.属性描述 += 属性.魔法暴击率增加(0.08)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.伤害增加加成(0.14,1)
        pass

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=152)
        self.属性描述 += 属性.被动增加(转职被动智力=152)
        self.属性描述 += 属性.BUFF增加(BUFFLv=5)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.12, BUFF智力per=1.12)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.2, BUFF魔攻per=1.2, BUFF独立per=1.2)
        self.属性描述 += 属性.觉醒增加(一觉Lv=3)
        self.属性描述 += 属性.觉醒增加(一觉力智=26)
        pass
    

class 装备21(装备):
    名称 = '轮回之环：桓龙'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '念珠'
    力量 = 0
    智力 = 122
    物理攻击力 = 1106
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.百分比三攻加成(0.14)
        self.属性描述 += 属性.技能攻击力加成(0.40)
        self.属性描述 += 属性.百分比力智加成(0.25)
        self.属性描述 += 属性.伤害增加加成(0.15)
        self.属性描述 += 属性.技能冷却缩减(1,100,0.1)
        pass
    def 进图属性(self, 属性):
        if 属性.职业 in ['驱魔师', '巫女']:
            self.属性描述 += '驱魔师、巫女装备时：</font><br>'
            self.属性描述 += 属性.技能等级加成('所有',48,80,1)
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比三攻加成(0.14,1)
        pass

class 装备22(装备):
    名称 = '暗战终结者'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '图腾'
    力量 = 122
    智力 = 0
    物理攻击力 = 1290
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.伤害增加加成(0.14)
        self.属性描述 += 属性.技能攻击力加成(0.38)  
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.40)
        self.属性描述 += 属性.暴击伤害加成(0.12)
        pass
    def 其它属性(self, 属性):
        pass 
    def 变换属性(self,属性):
        self.属性描述 += 属性.伤害增加加成(0.14,1)
        pass

class 装备23(装备):
    名称 = '泯灭之灵'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '镰刀'
    力量 = 81
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1229
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.最终伤害加成(0.14)
        self.属性描述 += 属性.百分比三攻加成(0.23)
        self.属性描述 += 属性.附加伤害加成(0.17)
        self.属性描述 += 属性.技能攻击力加成(0.38)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.08)
        self.属性描述 += 属性.附加伤害加成(0.08)
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.最终伤害加成(0.14,1)
        pass

class 装备24(装备):
    名称 = '弗卡奴斯的第二个痕迹'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '战斧'
    力量 = 81
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1045
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.单技能等级加成('苍龙逐日',3)
        self.属性描述 += 属性.单技能等级加成('火刑',3)
        self.属性描述 += 属性.单技能修改('无双击',1.40,1)
        self.属性描述 += 属性.单技能修改('行刑',1.40,1)
        self.属性描述 += 属性.附加伤害加成(0.45)
        #self.属性描述 += 属性.最终伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.持续伤害加成(0.1)
        self.属性描述 += 属性.技能攻击力加成(0.28)
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.最终伤害加成(0.14,1)
        pass

class 装备25(装备):
    名称 = '匿影'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '匕首'
    力量 = 122
    智力 = 0
    物理攻击力 = 1167
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.附加伤害加成(0.14)
        self.属性描述 += 属性.最终伤害加成(0.12)
        self.属性描述 += 属性.技能攻击力加成(0.34)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.属性附加加成(0.18)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.15)
        self.属性描述 += 属性.移动速度增加(0.15)
        self.属性描述 += 属性.释放速度增加(0.225)
        self.属性描述 += 属性.命中率增加(0.15)
        属性.回避率 += 0.15
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.附加伤害加成(0.14,1)
        pass

class 装备26(装备):
    名称 = '一叶障目'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '双剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1343
    魔法攻击力 = 983
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.附加伤害加成(0.14)
        self.属性描述 += 属性.百分比三攻加成(0.28)
        self.属性描述 += 属性.最终伤害加成(0.28)
        self.属性描述 += 属性.技能攻击力加成(0.32)
        self.属性描述 += 属性.技能倍率加成(40,0.32)
        self.属性描述 += 属性.技能倍率加成(45,0.32)
        self.属性描述 += 属性.技能倍率加成(70,0.32)
        self.属性描述 += 属性.单技能修改('忍法：影分身',0.68,0.68)
        self.属性描述 += 属性.单技能修改('弧光闪',0.68,0.68)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.附加伤害加成(0.14,1)
        pass

class 装备27(装备):
    名称 = '绿色生命的面容'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '手杖'
    力量 = 0
    智力 = 81
    物理攻击力 = 1086
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.百分比力智加成(0.14)
        self.属性描述 += 属性.附加伤害加成(0.25)
        self.属性描述 += 属性.最终伤害加成(0.20)
        self.属性描述 += 属性.技能攻击力加成(0.40)
        pass
    def 进图属性(self, 属性):
        if 属性.绿色生命的面容 == 1:
            self.属性描述 += '<font color="#00A2E8">绿色生命的阴暗面：</font><br>'
            self.属性描述 += 属性.最终伤害加成(0.1)
        pass
    def 其它属性(self, 属性):
        if 属性.绿色生命的面容 == 1:
            self.属性描述 += 属性.释放速度增加(0.21)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比力智加成(0.14,1)
        pass

class 装备28(装备):
    名称 = '血腥红宝石之眼'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '苦无'
    力量 = 0
    智力 = 122
    物理攻击力 = 1029
    魔法攻击力 = 1352
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.火属性强化加成(40)
        self.属性描述 += 属性.单技能等级加成('火遁·蟾蜍油炎弹',5)
        self.属性描述 += 属性.单技能等级加成('八岐大蛇',5)
        self.属性描述 += 属性.单技能等级加成('天照',5)
        self.属性描述 += 属性.技能攻击力加成(0.40)
        #self.属性描述 += 属性.暴击伤害加成(0.14)
        self.属性描述 += 属性.伤害增加加成(0.37)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.暴击伤害加成(0.14,1)
        pass

class 装备29(装备):
    名称 = '幻影狂欢长枪'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '长枪'
    力量 = 122
    智力 = 0
    物理攻击力 = 1290
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.单技能等级加成('行云：沐',2)
        self.属性描述 += 属性.单技能等级加成('行云：启',2)
        self.属性描述 += 属性.单技能等级加成('行云：冥',2)
        self.属性描述 += 属性.技能攻击力加成(0.28)
        self.属性描述 += 属性.最终伤害加成(0.12)
        #self.属性描述 += 属性.附加伤害加成(0.14)
        self.属性描述 += 属性.伤害增加加成(0.20)
        # self.属性描述 += 属性.单机能修改("行云诀",1,0.5)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.22)
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.附加伤害加成(0.14,1)
        pass

class 装备30(装备):
    名称 = '万夫之勇'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '战戟'
    力量 = 81
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1045
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.单技能等级加成('战戟之魂',3)
        self.属性描述 += 属性.单技能等级加成('战神之力',3)
        self.属性描述 += 属性.最终伤害加成(0.29)
        self.属性描述 += 属性.技能攻击力加成(0.16)
    def 进图属性(self, 属性):
        self.属性描述 += 属性.属性附加加成(0.14)
        pass
    def 其它属性(self, 属性):
        pass 
    def 变换属性(self,属性):
        self.属性描述 += 属性.技能等级加成('所有',50,50,2,1)
        self.属性描述 += 属性.技能等级加成('所有',85,85,2,1)
        self.属性描述 += 属性.技能等级加成('所有',100,100,2,1)
        pass

class 装备31(装备):
    名称 = '千芒闪爆枪'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '光枪'
    力量 = 81
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.34)
        self.属性描述 += 属性.技能攻击力加成(0.38)
        #self.属性描述 += 属性.百分比力智加成(0.14)
        self.属性描述 += 属性.百分比三攻加成(0.20)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比力智加成(0.14,1)
        pass

class 装备32(装备):
    名称 = '寂灭剧毒矛'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '暗矛'
    力量 = 81
    智力 = 122
    物理攻击力 = 1167
    魔法攻击力 = 1290
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.单技能等级加成('黑暗本源',3)
        self.属性描述 += 属性.单技能等级加成('坠蚀之雨',2)
        self.属性描述 += 属性.单技能等级加成('冥夜裂空',2)
        self.属性描述 += 属性.单技能等级加成('冥蚀脉冲',2)
        self.属性描述 += 属性.技能攻击力加成(0.34)
        self.属性描述 += 属性.最终伤害加成(0.20)
        #self.属性描述 += 属性.百分比三攻加成(0.14)
        self.属性描述 += 属性.暴击伤害加成(0.25)
        self.属性描述 += 属性.附加伤害加成(0.10)
        self.属性描述 += 属性.单技能修改('幽影暗蚀：寂灭',1.114000616,1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比三攻加成(0.14,1)
        pass

class 装备33(装备):
    名称 = '金刚密藏刀'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '长刀'
    力量 = 81
    智力 = 81
    物理攻击力 = 1328
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(50)
        self.属性描述 += 属性.技能等级加成('所有',1,48,1)
        self.属性描述 += 属性.技能等级加成('所有',60,80,1)
        self.属性描述 += 属性.伤害增加加成(0.12)
        #self.属性描述 += 属性.暴击伤害加成(0.14)
        self.属性描述 += 属性.百分比力智加成(0.12)
        self.属性描述 += 属性.百分比三攻加成(0.12)
        self.属性描述 += 属性.技能攻击力加成(0.32)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.15)
        self.属性描述 += 属性.移动速度增加(0.15)
        self.属性描述 += 属性.释放速度增加(0.225)
        self.属性描述 += 属性.物理暴击率增加(0.05)
        self.属性描述 += 属性.魔法暴击率增加(0.05)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.暴击伤害加成(0.14,1)
        pass

class 装备34(装备):
    名称 = '冰洁的红焰'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '小太刀'
    力量 = 81
    智力 = 41
    物理攻击力 = 1229
    魔法攻击力 = 1229
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.40)
        #self.属性描述 += 属性.百分比力智加成(0.14)
        self.属性描述 += 属性.伤害增加加成(0.35)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.23)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.15)
        self.属性描述 += 属性.移动速度增加(0.15)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比力智加成(0.14,1)
        pass

class 装备35(装备):
    名称 = '聚能擎天剑'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '重剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(22)
        self.属性描述 += 属性.百分比力智加成(0.18)
        self.属性描述 += 属性.暴击伤害加成(0.31)
        #self.属性描述 += 属性.百分比三攻加成(0.14)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.40)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.40)
        self.属性描述 += 属性.移动速度增加(0.3)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比三攻加成(0.14,1)
        pass

class 装备36(装备):
    名称 = '远古御神战剑'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '源力剑'
    力量 = 0
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.2)
        #self.属性描述 += 属性.百分比力智加成(0.14)
        self.属性描述 += 属性.附加伤害加成(0.33)
        self.属性描述 += 属性.技能攻击力加成(0.40)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.15)
        self.属性描述 += 属性.移动速度增加(0.15)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比力智加成(0.14,1)
        pass

class 装备37(装备):
    名称 = '战场的热血：安格巴迪'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '短剑'
    力量 = 0
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.伤害增加加成(0.14)
        self.属性描述 += 属性.技能攻击力加成(0.4)
        self.属性描述 += 属性.附加伤害加成(0.5)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.05)
        self.属性描述 += 属性.移动速度增加(0.05)
        self.属性描述 += 属性.释放速度增加(0.1)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.伤害增加加成(0.14,1)
        pass

class 装备38(装备):
    名称 = '前瞻守卫者'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '太刀'
    力量 = 81
    智力 = 122
    物理攻击力 = 1167
    魔法攻击力 = 1290
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.百分比力智加成(0.14)
        self.属性描述 += 属性.技能攻击力加成(0.40)
        self.属性描述 += 属性.附加伤害加成(0.21)
        self.属性描述 += 属性.暴击伤害加成(0.20)
        self.属性描述 += 属性.百分比三攻加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.1)
        self.属性描述 += 属性.移动速度增加(0.3)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比力智加成(0.14,1)
        pass

class 装备39(装备):
    名称 = '骚动的冥焰'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '钝器'
    力量 = 122
    智力 = 0
    物理攻击力 = 1352
    魔法攻击力 = 1167
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(55)
        #self.属性描述 += 属性.百分比三攻加成(0.14)
        self.属性描述 += 属性.附加伤害加成(0.30)
        self.属性描述 += 属性.伤害增加加成(0.08)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.36)
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比三攻加成(0.14,1)
        pass

class 装备40(装备):
    名称 = '神之意象'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '巨剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(50)
        self.属性描述 += 属性.技能等级加成('所有',1,48,2)
        self.属性描述 += 属性.技能等级加成('所有',60,80,2)
        self.属性描述 += 属性.伤害增加加成(0.35)
        self.属性描述 += 属性.技能攻击力加成(0.24)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.技能等级加成('所有',50,50,2,1)
        self.属性描述 += 属性.技能等级加成('所有',85,85,2,1)
        self.属性描述 += 属性.技能等级加成('所有',100,100,2,1)
        pass

class 装备41(装备):
    名称 = '赤光剑路易纳斯'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '光剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1143
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.附加伤害加成(0.14)
        self.属性描述 += 属性.百分比力智加成(0.10)
        self.属性描述 += 属性.百分比三攻加成(0.20)
        self.属性描述 += 属性.伤害增加加成(0.13)
        self.属性描述 += 属性.技能攻击力加成(0.40)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(31)
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.附加伤害加成(0.14,1)
        pass

class 装备42(装备):
    名称 = '无瑕之意志手套'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '手套'
    力量 = 0
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有',1,48,2)
        self.属性描述 += 属性.技能等级加成('所有',60,80,2)
        #self.属性描述 += 属性.暴击伤害加成(0.14)
        self.属性描述 += 属性.百分比三攻加成(0.12)
        self.属性描述 += 属性.最终伤害加成(0.08)
        self.属性描述 += 属性.技能攻击力加成(0.15)
        self.属性描述 += 属性.属性附加加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.暴击伤害加成(0.14,1)
        pass

class 装备43(装备):
    名称 = '毁灭之碾压'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '臂铠'
    力量 = 122
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.伤害增加加成(0.14)
        self.属性描述 += 属性.技能攻击力加成(0.33)
        self.属性描述 += 属性.暴击伤害加成(0.26)
        self.属性描述 += 属性.附加伤害加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.15)
        self.属性描述 += 属性.命中率增加(0.05)
        self.属性描述 += 属性.物理暴击率增加(0.1)
        self.属性描述 += 属性.魔法暴击率增加(0.1)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.伤害增加加成(0.14,1)
        pass

class 装备44(装备):
    名称 = '痛苦之源'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '爪'
    力量 = 81
    智力 = 41
    物理攻击力 = 1229
    魔法攻击力 = 1229
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.暴击伤害加成(0.14)
        self.属性描述 += 属性.附加伤害加成(0.53)
        self.属性描述 += 属性.技能攻击力加成(0.4)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.暴击伤害加成(0.14,1)
        pass

class 装备45(装备):
    名称 = '幻光绽放拳套'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '拳套'
    力量 = 81
    智力 = 0
    物理攻击力 = 1290
    魔法攻击力 = 1167
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(35)
        #self.属性描述 += 属性.百分比力智加成(0.14)
        self.属性描述 += 属性.附加伤害加成(0.38)
        self.属性描述 += 属性.技能攻击力加成(0.30)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.持续伤害加成(0.1)
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比力智加成(0.14,1)
        pass

class 装备46(装备):
    名称 = '鸣鸿破影棍'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '东方棍'
    力量 = 81
    智力 = 122
    物理攻击力 = 1167
    魔法攻击力 = 1229
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.伤害增加加成(0.14)
        self.属性描述 += 属性.技能攻击力加成(0.40)
        self.属性描述 += 属性.百分比三攻加成(0.40)
        self.属性描述 += 属性.百分比力智加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.1)
        self.属性描述 += 属性.释放速度增加(0.15)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.伤害增加加成(0.14,1)
        pass

class 装备47(装备):
    名称 = '血枪之脉'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '左轮枪'
    力量 = 81
    智力 = 0
    物理攻击力 = 1238
    魔法攻击力 = 1042
    独立攻击力 = 770
    def 城镇属性(self, 属性):
       #self.属性描述 += 属性.最终伤害加成(0.14)
        self.属性描述 += 属性.伤害增加加成(0.28)
        self.属性描述 += 属性.技能攻击力加成(0.32)
        self.属性描述 += 属性.附加伤害加成(0.32)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.2)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.最终伤害加成(0.14,1)
        pass

class 装备48(装备):
    名称 = '寻觅海石竹'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '自动手枪'
    力量 = 0
    智力 = 81
    物理攻击力 = 868
    魔法攻击力 = 1273
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.伤害增加加成(0.14)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.38)
        self.属性描述 += 属性.百分比力智加成(0.23)
        self.属性描述 += 属性.百分比三攻加成(0.35)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.1)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.伤害增加加成(0.14,1)
        pass

class 装备49(装备):
    名称 = '湍流'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '步枪'
    力量 = 81
    智力 = 122
    物理攻击力 = 1331
    魔法攻击力 = 1157
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.附加伤害加成(0.14)
        self.属性描述 += 属性.技能攻击力加成(0.37)
        self.属性描述 += 属性.暴击伤害加成(0.23)
        self.属性描述 += 属性.百分比三攻加成(0.23)
        self.属性描述 += 属性.百分比力智加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.附加伤害加成(0.14,1)
        pass

class 装备50(装备):
    名称 = '乾坤极电炮'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '手炮'
    力量 = 122
    智力 = 0
    物理攻击力 = 1447
    魔法攻击力 = 868
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.暴击伤害加成(0.14)
        self.属性描述 += 属性.技能攻击力加成(0.35)
        self.属性描述 += 属性.单技能修改('激光炮',1.2,0.7)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.2)
        self.属性描述 += 属性.伤害增加加成(0.32)
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.暴击伤害加成(0.14,1)
        pass

class 装备51(装备):
    名称 = '吟游诗人的轻吟'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '手弩'
    力量 = 81
    智力 = 81
    物理攻击力 = 1042
    魔法攻击力 = 1157
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.暴击伤害加成(0.14)
        self.属性描述 += 属性.技能攻击力加成(0.40)
        self.属性描述 += 属性.附加伤害加成(0.17)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.4)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.1)
        self.属性描述 += 属性.移动速度增加(0.1)
        self.属性描述 += 属性.物理暴击率增加(0.05)
        self.属性描述 += 属性.魔法暴击率增加(0.05)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.暴击伤害加成(0.14,1)
        pass

class 装备52(装备):
    名称 = '吟唱：不灭之魂'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '矛'
    力量 = 122
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1045
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.百分比三攻加成(0.14)
        self.属性描述 += 属性.技能攻击力加成(0.40)
        self.属性描述 += 属性.伤害增加加成(0.17)
        self.属性描述 += 属性.暴击伤害加成(0.15)
        self.属性描述 += 属性.百分比力智加成(0.23)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比三攻加成(0.14,1)
        pass

class 装备53(装备):
    名称 = '精灵浮风棍'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '棍棒'
    力量 = 110
    智力 = 110
    物理攻击力 = 1328
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.单技能等级加成('斗神意志',4)
        self.属性描述 += 属性.单技能等级加成('御风之力',4)
        #self.属性描述 += 属性.附加伤害加成(0.14)
        self.属性描述 += 属性.技能攻击力加成(0.33)
        self.属性描述 += 属性.最终伤害加成(0.11)
        self.属性描述 += 属性.百分比三攻加成(0.27)
        self.属性描述 += 属性.伤害增加加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 +=0.10
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.附加伤害加成(0.14,1)
        pass

class 装备54(装备):
    名称 = '魔力之泉：加斯达利亚'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '魔杖'
    力量 = 0
    智力 = 122
    物理攻击力 = 1106
    魔法攻击力 = 1352
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.伤害增加加成(0.14)
        self.属性描述 += 属性.技能攻击力加成(0.40)
        self.属性描述 += 属性.最终伤害加成(0.12)
        self.属性描述 += 属性.百分比三攻加成(0.12)
        self.属性描述 += 属性.百分比力智加成(0.32)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.1)
        self.属性描述 += 属性.移动速度增加(0.1)
        self.属性描述 += 属性.释放速度增加(0.15)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.伤害增加加成(0.14,1)
        pass

class 装备55(装备):
    名称 = '银月的祝福'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '法杖'
    力量 = 0
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1475
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.技能等级加成('所有',50,50,2,1)
        #self.属性描述 += 属性.技能等级加成('所有',85,85,2,1)
        #self.属性描述 += 属性.技能等级加成('所有',100,100,2,1)
        self.属性描述 += 属性.技能攻击力加成(0.36)
        self.属性描述 += 属性.最终伤害加成(0.40)
        self.属性描述 += 属性.百分比三攻加成(0.20)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.释放速度增加(0.1)
        self.属性描述 += 属性.魔法暴击率增加(0.05)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.技能等级加成('所有',50,50,2,1)
        self.属性描述 += 属性.技能等级加成('所有',85,85,2,1)
        self.属性描述 += 属性.技能等级加成('所有',100,100,2,1)
        pass

class 装备56(装备):
    名称 = '世界树之精灵'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '扫把'
    力量 = 0
    智力 = 81
    物理攻击力 = 1229
    魔法攻击力 = 1352
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.技能等级加成('所有',50,50,2,1)
        #self.属性描述 += 属性.技能等级加成('所有',85,85,2,1)
        #self.属性描述 += 属性.技能等级加成('所有',100,100,2,1)
        self.属性描述 += 属性.最终伤害加成(0.26)
        self.属性描述 += 属性.技能攻击力加成(0.26)
        self.属性描述 += 属性.属性附加加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.物理暴击率增加(0.05)
        self.属性描述 += 属性.魔法暴击率增加(0.05)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.技能等级加成('所有',50,50,2,1)
        self.属性描述 += 属性.技能等级加成('所有',85,85,2,1)
        self.属性描述 += 属性.技能等级加成('所有',100,100,2,1)
        pass

    def 城镇属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有',50,50,2,1)
        self.属性描述 += 属性.技能等级加成('所有',85,85,2,1)
        self.属性描述 += 属性.技能等级加成('所有',100,100,2,1)
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(转职被动智力=152)
        self.属性描述 += 属性.BUFF增加(BUFFLv=5)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.12, BUFF智力per=1.12)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.2, BUFF魔攻per=1.2, BUFF独立per=1.2)
        self.属性描述 += 属性.觉醒增加(一觉Lv=1)
        self.属性描述 += 属性.觉醒增加(一觉力智=26)
        pass
    

class 装备57(装备):
    名称 = '闪耀的神威'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '十字架'
    力量 = 0
    智力 = 81
    体力 = 97
    精神 = 97
    物理攻击力 = 1229
    魔法攻击力 = 1167
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(40)
        #self.属性描述 += 属性.附加伤害加成(0.14)
        self.属性描述 += 属性.伤害增加加成(0.17)
        self.属性描述 += 属性.暴击伤害加成(0.3)
        self.属性描述 += 属性.技能攻击力加成(0.35)
        
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.1)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.附加伤害加成(0.14,1)
        pass

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=127)
        self.属性描述 += 属性.被动增加(转职被动智力=127)
        self.属性描述 += 属性.BUFF增加(BUFFLv=5)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.12, BUFF智力per=1.12)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.2, BUFF魔攻per=1.2, BUFF独立per=1.2)
        self.属性描述 += 属性.觉醒增加(一觉Lv=2)
        self.属性描述 += 属性.觉醒增加(一觉力智=68)
        pass
    
class 装备58(装备):
    名称 = '古代神兽的记忆'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '念珠'
    力量 = 0
    智力 = 122
    物理攻击力 = 1106
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.附加伤害加成(0.14)
        self.属性描述 += 属性.技能攻击力加成(0.38)
        self.属性描述 += 属性.暴击伤害加成(0.35)
        self.属性描述 += 属性.百分比力智加成(0.23)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass  
    def 变换属性(self,属性):
        self.属性描述 += 属性.附加伤害加成(0.14,1)
        pass

class 装备59(装备):
    名称 = '拓荒者之路'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '图腾'
    力量 = 122
    智力 = 0
    物理攻击力 = 1290
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.24)
        self.属性描述 += 属性.技能攻击力加成(0.40)
        #self.属性描述 += 属性.暴击伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.32)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.2)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.暴击伤害加成(0.14,1)
        pass

class 装备60(装备):
    名称 = '异教主的审判'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '镰刀'
    力量 = 81
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1229
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.暴击伤害加成(0.14)
        self.属性描述 += 属性.附加伤害加成(0.28)
        self.属性描述 += 属性.技能攻击力加成(0.40)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.22)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.14)
        self.属性描述 += 属性.移动速度增加(0.14)
        self.属性描述 += 属性.释放速度增加(0.21)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.暴击伤害加成(0.14,1)
        pass

class 装备61(装备):
    名称 = '信念之重量'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '战斧'
    力量 = 81
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1045
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.43)
        #self.属性描述 += 属性.暴击伤害加成(0.14)
        self.属性描述 += 属性.附加伤害加成(0.15)
        self.属性描述 += 属性.技能攻击力加成(0.4)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.1)
        self.属性描述 += 属性.移动速度增加(0.1)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.暴击伤害加成(0.14,1)
        pass

class 装备62(装备):
    名称 = '暗杀团长的玉妆刀'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '匕首'
    力量 = 122
    智力 = 0
    物理攻击力 = 1167
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):       
        #self.属性描述 += 属性.最终伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.38)
        self.属性描述 += 属性.百分比三攻加成(0.28)
        self.属性描述 += 属性.百分比力智加成(0.29)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.1)
        self.属性描述 += 属性.移动速度增加(0.1)
        self.属性描述 += 属性.释放速度增加(0.15)
        pass 
    def 变换属性(self,属性):
        self.属性描述 += 属性.最终伤害加成(0.14,1)
        pass

class 装备63(装备):
    名称 = '血色舞会'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '双剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1343
    魔法攻击力 = 983
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.暴击伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.26)
        self.属性描述 += 属性.最终伤害加成(0.20)
        self.属性描述 += 属性.技能攻击力加成(0.20)
        self.属性描述 += '[终结追击]技能每个连击点数攻击力增加比率 +40%<br>'
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.15)
        self.属性描述 += 属性.移动速度增加(0.15)
        self.属性描述 += 属性.命中率增加(0.05)
        属性.回避率 += 0.05
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.暴击伤害加成(0.14,1)
        pass

class 装备64(装备):
    名称 = '圣洁的精灵遗物'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '手杖'
    力量 = 0
    智力 = 81
    物理攻击力 = 1086
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.伤害增加加成(0.14)
        self.属性描述 += 属性.暴击伤害加成(0.20)
        self.属性描述 += 属性.百分比三攻加成(0.30)
        self.属性描述 += 属性.技能攻击力加成(0.38)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.10)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.释放速度增加(0.12)
        self.属性描述 += 属性.命中率增加(0.05)
        pass 
    def 变换属性(self,属性):
        self.属性描述 += 属性.伤害增加加成(0.14,1)
        pass

class 装备65(装备):
    名称 = '天幕道火扇'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '苦无'
    力量 = 0
    智力 = 122
    物理攻击力 = 1029
    魔法攻击力 = 1352
    独立攻击力 = 770
    def 城镇属性(self, 属性): 
        self.属性描述 += 属性.单技能等级加成('烈焰印记',3) 
        self.属性描述 += 属性.技能等级加成('所有',1,45,3)   
        #self.属性描述 += 属性.附加伤害加成(0.14)
        self.属性描述 += 属性.技能攻击力加成(0.28)
        self.属性描述 += 属性.百分比三攻加成(0.44)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.单技能等级加成('火遁·冥炎业火阵',2)
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.附加伤害加成(0.14,1)
        pass

class 装备66(装备):
    名称 = '彪悍冲锋者'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '长枪'
    力量 = 122
    智力 = 0
    物理攻击力 = 1290
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.30)
        self.属性描述 += 属性.百分比力智加成(0.30)
        #self.属性描述 += 属性.百分比三攻加成(0.14)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.38)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.15)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比三攻加成(0.14,1)
        pass
    
class 装备67(装备):
    名称 = '沙岩幻戟'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '战戟'
    力量 = 81
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1045
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        #self.属性描述 += 属性.伤害增加加成(0.14)
        self.属性描述 += 属性.最终伤害加成(0.24)
        self.属性描述 += 属性.技能攻击力加成(0.20)
        self.属性描述 += 属性.百分比三攻加成(0.18)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有',1,48,2)
        self.属性描述 += 属性.技能等级加成('所有',60,80,2)
        self.属性描述 += 属性.技能冷却缩减(1,48,0.10)
        self.属性描述 += 属性.技能冷却缩减(60,80,0.10)
        self.属性描述 += 属性.技能冷却缩减(90,95,0.10)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.2)
        self.属性描述 += 属性.移动速度增加(0.2)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.伤害增加加成(0.14,1)
        pass

class 装备68(装备):
    名称 = '天将军：传承之光'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '光枪'
    力量 = 81
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.40)
        self.属性描述 += 属性.百分比力智加成(0.10)
        #self.属性描述 += 属性.暴击伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.30)
        self.属性描述 += 属性.最终伤害加成(0.18)
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.暴击伤害加成(0.14,1)
        pass

class 装备69(装备):
    名称 = '魅影飞龙'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '暗矛'
    力量 = 81
    智力 = 122
    物理攻击力 = 1167
    魔法攻击力 = 1290
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.单技能修改('暗蚀螺旋枪',1.315316871,1)
        self.属性描述 += 属性.单技能修改('暗蚀爆雷杀',1.144086022,1)
        self.属性描述 += 属性.单技能修改('无尽侵蚀：缚魂',1.134989433,1)
        self.属性描述 += 属性.技能攻击力加成(0.40)
        #self.属性描述 += 属性.最终伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.26)
        self.属性描述 += 属性.暴击伤害加成(0.25)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.1)
        self.属性描述 += 属性.移动速度增加(0.1)
        self.属性描述 += 属性.释放速度增加(0.1)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.最终伤害加成(0.14,1)
        pass

class 装备70(装备):
    名称 = '夜天刀'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '长刀'
    力量 = 81
    智力 = 81
    物理攻击力 = 1328
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.单技能等级加成('B.G枪刃改造',3)
        self.属性描述 += 属性.单技能等级加成('B.C精锐特训',3)
        #self.属性描述 += 属性.技能等级加成('所有',50,50,2,1)
        #self.属性描述 += 属性.技能等级加成('所有',85,85,2,1)
        #self.属性描述 += 属性.技能等级加成('所有',100,100,2,1)
        self.属性描述 += 属性.最终伤害加成(0.29)
        self.属性描述 += 属性.技能攻击力加成(0.16)
        self.属性描述 += 属性.属性附加加成(0.14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.技能等级加成('所有',50,50,2,1)
        self.属性描述 += 属性.技能等级加成('所有',85,85,2,1)
        self.属性描述 += 属性.技能等级加成('所有',100,100,2,1)
        pass

class 装备71(装备):
    名称 = '冥焰黑暗之触'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '小太刀'
    力量 = 81
    智力 = 41
    物理攻击力 = 1229
    魔法攻击力 = 1229
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.40)
        self.属性描述 += 属性.百分比三攻加成(0.23)
        #self.属性描述 += 属性.暴击伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.30)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.物理暴击率增加(0.06)
        self.属性描述 += 属性.魔法暴击率增加(0.06)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.暴击伤害加成(0.14,1)
        pass

class 装备72(装备):
    名称 = '爆烈红焰'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '重剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.18)
        self.属性描述 += 属性.技能攻击力加成(0.28)
        #self.属性描述 += 属性.附加伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.属性附加加成(0.20)
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.附加伤害加成(0.14,1)
        pass

class 装备73(装备):
    名称 = '谍影：超级核心'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '源力剑'
    力量 = 0
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.单技能等级加成('源力剑精通',3)
        #self.属性描述 += 属性.伤害增加加成(0.14)
        self.属性描述 += 属性.百分比力智加成(0.32)
        self.属性描述 += 属性.百分比三攻加成(0.22)
        self.属性描述 += 属性.技能攻击力加成(0.08)
        try:
            属性.技能栏[属性.技能序号['源力剑精通']].谍影专用倍率 = 2
        except:
            pass
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.伤害增加加成(0.14,1)
        pass

#endregion

# region 智慧产物武器

class 装备251(飘零之花武器):
    名称 = '飘零之花手炮'
    类型 = '手炮'
    力量 = 122
    智力 = 0
    物理攻击力 = 1346
    魔法攻击力 = 768
    独立攻击力 = 711
    物攻成长 = 188
    魔攻成长 = 181

class 装备257(飘零之花武器):
    名称 = '飘零之花巨剑'
    类型 = '巨剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1375
    魔法攻击力 = 1005
    独立攻击力 = 711
    物攻成长 = 190
    魔攻成长 = 185

class 装备258(飘零之花武器):
    名称 = '飘零之花手弩'
    类型 = '手弩'
    力量 = 81
    智力 = 81
    物理攻击力 = 942
    魔法攻击力 = 1057
    独立攻击力 = 711
    物攻成长 = 183
    魔攻成长 = 184


class 装备259(飘零之花武器):
    名称 = '飘零之花步枪'
    类型 = '步枪'
    力量 = 81
    智力 = 122
    物理攻击力 = 1231
    魔法攻击力 = 1057
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 184

class 装备260(飘零之花武器):
    名称 = '飘零之花十字架'
    类型 = '十字架'
    力量 = 0
    智力 = 81
    体力 = 97
    精神 = 97
    物理攻击力 = 1129
    魔法攻击力 = 1067
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 186
    def 城镇属性_BUFF(self, 属性):
        属性.体精固定加成(30 * 属性.获取改造(self.部位))
        属性.力智固定加成(30 * 属性.获取改造(self.部位))
        # 属性.智力 += 30 * 属性.获取改造(self.部位)
        # 属性.体力 += 30 * 属性.获取改造(self.部位)
        # 属性.精神 += 30 * 属性.获取改造(self.部位)
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=127)
        self.属性描述 += 属性.被动增加(转职被动智力=127)
        self.属性描述 += 属性.BUFF增加(BUFFLv=5)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.12, BUFF智力per=1.12)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.2, BUFF魔攻per=1.2, BUFF独立per=1.2)
        self.属性描述 += 属性.觉醒增加(一觉Lv=2)
        self.属性描述 += 属性.觉醒增加(一觉力智=68)

class 装备261(飘零之花武器):
    名称 = '飘零之花短剑'
    类型 = '短剑'
    力量 = 0
    智力 = 81
    物理攻击力 = 1067
    魔法攻击力 = 1313
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 189

class 装备262(飘零之花武器):
    名称 = '飘零之花钝器'
    类型 = '钝器'
    力量 = 122
    智力 = 0
    物理攻击力 = 1252
    魔法攻击力 = 1067
    独立攻击力 = 711
    物攻成长 = 188
    魔攻成长 = 186

class 装备263(飘零之花武器):
    名称 = '飘零之花法杖'
    类型 = '法杖'
    力量 = 0
    智力 = 81
    物理攻击力 = 1067
    魔法攻击力 = 1375
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 190

class 装备264(飘零之花武器):
    名称 = '飘零之花光剑'
    类型 = '光剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1043
    魔法攻击力 = 1005
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 185

class 装备265(飘零之花武器):
    名称 = '飘零之花棍棒'
    类型 = '棍棒'
    力量 = 110
    智力 = 110
    物理攻击力 = 1228
    魔法攻击力 = 1005
    独立攻击力 = 711
    物攻成长 = 188
    魔攻成长 = 185
    def 城镇属性(self, 属性):
        super().城镇属性(属性)
        if 属性.职业 == '战斗法师':
            属性.魔法攻击力 += (self.物攻成长 - self.魔攻成长)* 属性.获取改造(self.部位)
        pass     

class 装备266(飘零之花武器):
    名称 = '飘零之花矛'
    类型 = '矛'
    力量 = 122
    智力 = 0
    物理攻击力 = 1375
    魔法攻击力 = 945
    独立攻击力 = 711
    物攻成长 = 190
    魔攻成长 = 184
    def 城镇属性(self, 属性):
        super().城镇属性(属性)
        if 属性.职业 == '战斗法师':
            属性.魔法攻击力 += (self.物攻成长 - self.魔攻成长)* 属性.获取改造(self.部位)
        pass       

class 装备267(飘零之花武器):
    名称 = '飘零之花魔杖'
    类型 = '魔杖'
    力量 = 0
    智力 = 122
    物理攻击力 = 1005
    魔法攻击力 = 1252
    独立攻击力 = 711
    物攻成长 = 185
    魔攻成长 = 188

class 装备268(飘零之花武器):
    名称 = '飘零之花拳套'
    类型 = '拳套'
    力量 = 81
    智力 = 0
    物理攻击力 = 1190
    魔法攻击力 = 1067
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 186

class 装备269(飘零之花武器):
    名称 = '飘零之花扫把'
    类型 = '扫把'
    力量 = 0
    智力 = 81
    物理攻击力 = 1129
    魔法攻击力 = 1252
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 188
    def 城镇属性_BUFF(self, 属性):
        # 属性.智力 += 30 * 属性.获取改造(self.部位)
        # 属性.体力 += 30 * 属性.获取改造(self.部位)
        # 属性.精神 += 30 * 属性.获取改造(self.部位)
        属性.体精固定加成(30 * 属性.获取改造(self.部位))
        属性.力智固定加成(30 * 属性.获取改造(self.部位))
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=127)
        self.属性描述 += 属性.被动增加(转职被动智力=127)
        self.属性描述 += 属性.BUFF增加(BUFFLv=5)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.12, BUFF智力per=1.12)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.2, BUFF魔攻per=1.2, BUFF独立per=1.2)
        self.属性描述 += 属性.觉醒增加(一觉Lv=2)
        self.属性描述 += 属性.觉醒增加(一觉力智=68)

class 装备270(飘零之花武器):
    名称 = '飘零之花手套'
    类型 = '手套'
    力量 = 0
    智力 = 81
    物理攻击力 = 1067
    魔法攻击力 = 1313
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 189

class 装备271(飘零之花武器):
    名称 = '飘零之花太刀'
    类型 = '太刀'
    力量 = 81
    智力 = 122
    物理攻击力 = 1067
    魔法攻击力 = 1190
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 187
    def 城镇属性(self, 属性):
        super().城镇属性(属性)
        if 属性.职业 == '剑影':
            属性.物理攻击力 += (self.魔攻成长 - self.物攻成长)* 属性.获取改造(self.部位)
        pass    

class 装备272(飘零之花武器):
    名称 = '飘零之花爪'
    类型 = '爪'
    力量 = 81
    智力 = 41
    物理攻击力 = 1129
    魔法攻击力 = 1129
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 187    

class 装备273(飘零之花武器):
    名称 = '飘零之花左轮枪'
    类型 = '左轮枪'
    力量 = 81
    智力 = 0
    物理攻击力 = 1137
    魔法攻击力 = 942
    独立攻击力 = 711
    物攻成长 = 185
    魔攻成长 = 183

class 装备371(飘零之花武器):
    名称 = '飘零之花念珠'
    类型 = '念珠'
    力量 = 0
    智力 = 122
    物理攻击力 = 1005
    魔法攻击力 = 1313
    独立攻击力 = 711
    物攻成长 = 185
    魔攻成长 = 189

class 装备372(飘零之花武器):
    名称 = '飘零之花图腾'
    类型 = '图腾'
    力量 = 122
    智力 = 0
    物理攻击力 = 1190
    魔法攻击力 = 1005
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 185

class 装备373(飘零之花武器):
    名称 = '飘零之花镰刀'
    类型 = '镰刀'
    力量 = 81
    智力 = 81
    物理攻击力 = 1067
    魔法攻击力 = 1129
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 187

class 装备374(飘零之花武器):
    名称 = '飘零之花战斧'
    类型 = '战斧'
    力量 = 81
    智力 = 0
    物理攻击力 = 1375
    魔法攻击力 = 945
    独立攻击力 = 711
    物攻成长 = 190
    魔攻成长 = 184

class 装备375(飘零之花武器):
    名称 = '飘零之花暗矛'
    类型 = '暗矛'
    力量 = 81
    智力 = 122
    物理攻击力 = 1067
    魔法攻击力 = 1190
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 187

class 装备376(飘零之花武器):
    名称 = '飘零之花匕首'
    类型 = '匕首'
    力量 = 122
    智力 = 0
    物理攻击力 = 1067
    魔法攻击力 = 1005
    独立攻击力 = 711
    物攻成长 = 185
    魔攻成长 = 185

class 装备377(飘零之花武器):
    名称 = '飘零之花臂铠'
    类型 = '臂铠'
    力量 = 81
    智力 = 0
    物理攻击力 = 1190
    魔法攻击力 = 1067
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 186

class 装备378(飘零之花武器):
    名称 = '飘零之花东方棍'
    类型 = '东方棍'
    力量 = 81
    智力 = 122
    物理攻击力 = 1067
    魔法攻击力 = 1129
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 187

class 装备379(飘零之花武器):
    名称 = '飘零之花光枪'
    类型 = '光枪'
    力量 = 81
    智力 = 81
    物理攻击力 = 1067
    魔法攻击力 = 1313
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 189

class 装备380(飘零之花武器):
    名称 = '飘零之花苦无'
    类型 = '苦无'
    力量 = 0
    智力 = 122
    物理攻击力 = 928
    魔法攻击力 = 1252
    独立攻击力 = 711
    物攻成长 = 185
    魔攻成长 = 188

class 装备381(飘零之花武器):
    名称 = '飘零之花手杖'
    类型 = '手杖'
    力量 = 0
    智力 = 81
    物理攻击力 = 986
    魔法攻击力 = 1313
    独立攻击力 = 711
    物攻成长 = 184
    魔攻成长 = 189

class 装备382(飘零之花武器):
    名称 = '飘零之花双剑'
    类型 = '双剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1243
    魔法攻击力 = 883
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 184

class 装备383(飘零之花武器):
    名称 = '飘零之花小太刀'
    类型 = '小太刀'
    力量 = 81
    智力 = 41
    物理攻击力 = 1129
    魔法攻击力 = 1129
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 187

class 装备384(飘零之花武器):
    名称 = '飘零之花源力剑'
    类型 = '源力剑'
    力量 = 0
    智力 = 81
    物理攻击力 = 1067
    魔法攻击力 = 1313
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 189

class 装备385(飘零之花武器):
    名称 = '飘零之花战戟'
    类型 = '战戟'
    力量 = 81
    智力 = 0
    物理攻击力 = 1375
    魔法攻击力 = 945
    独立攻击力 = 711
    物攻成长 = 190
    魔攻成长 = 184

class 装备386(飘零之花武器):
    名称 = '飘零之花长刀'
    类型 = '长刀'
    力量 = 81
    智力 = 81
    物理攻击力 = 1228
    魔法攻击力 = 1005
    独立攻击力 = 711
    物攻成长 = 188
    魔攻成长 = 185

class 装备387(飘零之花武器):
    名称 = '飘零之花长枪'
    类型 = '长枪'
    力量 = 122
    智力 = 0
    物理攻击力 = 1190
    魔法攻击力 = 1005
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 185

class 装备388(飘零之花武器):
    名称 = '飘零之花重剑'
    类型 = '重剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1375
    魔法攻击力 = 1005
    独立攻击力 = 711
    物攻成长 = 190
    魔攻成长 = 185

class 装备389(飘零之花武器):
    名称 = '飘零之花自动手枪'
    类型 = '自动手枪'
    力量 = 0
    智力 = 81
    物理攻击力 = 768
    魔法攻击力 = 1173
    独立攻击力 = 711
    物攻成长 = 181
    魔攻成长 = 186
# endregion

#region  夜语黑瞳武器

class 夜语黑瞳武器(装备):
    模式 = 普雷武器显示
    所属套装 = '无'
    等级 = 95
    品质 = '史诗'
    部位 = '武器'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.32)
        self.属性描述 += 属性.技能攻击力加成(0.55)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass

class 装备274(夜语黑瞳武器):
    名称 = '界·夜语黑瞳短剑'
    类型 = '短剑'
    力量 = 0
    智力 = 78
    物理攻击力 = 1112
    魔法攻击力 = 1346
    独立攻击力 = 723

class 装备275(夜语黑瞳武器):
    名称 = '界·夜语黑瞳太刀'
    类型 = '太刀'
    力量 = 78
    智力 = 117
    物理攻击力 = 1112
    魔法攻击力 = 1230
    独立攻击力 = 723

class 装备276(夜语黑瞳武器):
    名称 = '界·夜语黑瞳钝器'
    类型 = '钝器'
    力量 = 117
    智力 = 0
    物理攻击力 = 1288
    魔法攻击力 = 1112
    独立攻击力 = 723

class 装备277(夜语黑瞳武器):
    名称 = '界·夜语黑瞳巨剑'
    类型 = '巨剑'
    力量 = 78
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备278(夜语黑瞳武器):
    名称 = '界·夜语黑瞳光剑'
    类型 = '光剑'
    力量 = 78
    智力 = 0
    物理攻击力 = 1089
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备279(夜语黑瞳武器):
    名称 = '界·夜语黑瞳手套'
    类型 = '手套'
    力量 = 0
    智力 = 78
    物理攻击力 = 1112
    魔法攻击力 = 1346
    独立攻击力 = 723

class 装备280(夜语黑瞳武器):
    名称 = '界·夜语黑瞳臂铠'
    类型 = '臂铠'
    力量 = 117
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备281(夜语黑瞳武器):
    名称 = '界·夜语黑瞳利爪'
    类型 = '爪'
    力量 = 78
    智力 = 39
    物理攻击力 = 1172
    魔法攻击力 = 1172
    独立攻击力 = 723

class 装备282(夜语黑瞳武器):
    名称 = '界·夜语黑瞳拳套'
    类型 = '拳套'
    力量 = 78
    智力 = 0
    物理攻击力 = 1230
    魔法攻击力 = 1112
    独立攻击力 = 723

class 装备283(夜语黑瞳武器):
    名称 = '界·夜语黑瞳东方棍'
    类型 = '东方棍'
    力量 = 78
    智力 = 117
    物理攻击力 = 1112
    魔法攻击力 = 1172
    独立攻击力 = 723

class 装备284(夜语黑瞳武器):
    名称 = '界·夜语黑瞳左轮枪'
    类型 = '左轮枪'
    力量 = 78
    智力 = 0
    物理攻击力 = 1176
    魔法攻击力 = 989
    独立攻击力 = 723

class 装备285(夜语黑瞳武器):
    名称 = '界·夜语黑瞳自动手枪'
    类型 = '自动手枪'
    力量 = 0
    智力 = 78
    物理攻击力 = 825
    魔法攻击力 = 1209
    独立攻击力 = 723

class 装备286(夜语黑瞳武器):
    名称 = '界·夜语黑瞳步枪'
    类型 = '步枪'
    力量 = 78
    智力 = 117
    物理攻击力 = 1264
    魔法攻击力 = 1099
    独立攻击力 = 723

class 装备287(夜语黑瞳武器):
    名称 = '界·夜语黑瞳手炮'
    类型 = '手炮'
    力量 = 117
    智力 = 0
    物理攻击力 = 1374
    魔法攻击力 = 825
    独立攻击力 = 723

class 装备288(夜语黑瞳武器):
    名称 = '界·夜语黑瞳手弩'
    类型 = '手弩'
    力量 = 78
    智力 = 39
    物理攻击力 = 989
    魔法攻击力 = 1099
    独立攻击力 = 723

class 装备289(夜语黑瞳武器):
    名称 = '界·夜语黑瞳矛'
    类型 = '矛'
    力量 = 117
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 996
    独立攻击力 = 723

class 装备290(夜语黑瞳武器):
    名称 = '界·夜语黑瞳棍棒'
    类型 = '棍棒'
    力量 = 78
    智力 = 78
    物理攻击力 = 1265
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备291(夜语黑瞳武器):
    名称 = '界·夜语黑瞳魔杖'
    类型 = '魔杖'
    力量 = 0
    智力 = 117
    物理攻击力 = 1054
    魔法攻击力 = 1288
    独立攻击力 = 723

class 装备292(夜语黑瞳武器):
    名称 = '界·夜语黑瞳法杖'
    类型 = '法杖'
    力量 = 0
    智力 = 78
    物理攻击力 = 1112
    魔法攻击力 = 1406
    独立攻击力 = 723

class 装备293(夜语黑瞳武器):
    名称 = '界·夜语黑瞳扫把'
    类型 = '扫把'
    力量 = 0
    智力 = 78
    物理攻击力 = 1172
    魔法攻击力 = 1288
    独立攻击力 = 723
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        属性.智力 += 30 * 属性.获取改造(self.部位)
        属性.体力 += 30 * 属性.获取改造(self.部位)
        属性.精神 += 30 * 属性.获取改造(self.部位)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=127)
        self.属性描述 += 属性.被动增加(转职被动智力=127)
        self.属性描述 += 属性.BUFF增加(BUFFLv=5)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.12)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.12)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.2)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.2)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.2)
        self.属性描述 += 属性.觉醒增加(一觉Lv=2)
        self.属性描述 += 属性.觉醒增加(一觉力智=68)

class 装备294(夜语黑瞳武器):
    名称 = '界·夜语黑瞳十字架'
    类型 = '十字架'
    力量 = 0
    智力 = 78
    体力 = 94
    精神 = 94
    物理攻击力 = 1172
    魔法攻击力 = 1112
    独立攻击力 = 723
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=127)
        self.属性描述 += 属性.被动增加(转职被动智力=127)
        self.属性描述 += 属性.BUFF增加(BUFFLv=5)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.1, BUFF智力per=1.1)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.2, BUFF魔攻per=1.2, BUFF独立per=1.2)
        self.属性描述 += 属性.觉醒增加(一觉Lv=2)
        self.属性描述 += 属性.觉醒增加(一觉力智=44)
        
class 装备295(夜语黑瞳武器):
    名称 = '界·夜语黑瞳念珠'
    类型 = '念珠'
    力量 = 0
    智力 = 117
    物理攻击力 = 1054
    魔法攻击力 = 1346
    独立攻击力 = 723

class 装备296(夜语黑瞳武器):
    名称 = '界·夜语黑瞳图腾'
    类型 = '图腾'
    力量 = 117
    智力 = 0
    物理攻击力 = 1230
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备297(夜语黑瞳武器):
    名称 = '界·夜语黑瞳镰刀'
    类型 = '镰刀'
    力量 = 78
    智力 = 78
    物理攻击力 = 1112
    魔法攻击力 = 1172
    独立攻击力 = 723

class 装备298(夜语黑瞳武器):
    名称 = '界·夜语黑瞳战斧'
    类型 = '战斧'
    力量 = 78
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 996
    独立攻击力 = 723

class 装备299(夜语黑瞳武器):
    名称 = '界·夜语黑瞳匕首'
    类型 = '匕首'
    力量 = 78
    智力 = 0
    物理攻击力 = 1109
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备300(夜语黑瞳武器):
    名称 = '界·夜语黑瞳双剑'
    类型 = '双剑'
    力量 = 78
    智力 = 0
    物理攻击力 = 1278
    魔法攻击力 = 937
    独立攻击力 = 723

class 装备301(夜语黑瞳武器):
    名称 = '界·夜语黑瞳手杖'
    类型 = '手杖'
    力量 = 0
    智力 = 78
    物理攻击力 = 1032
    魔法攻击力 = 1346
    独立攻击力 = 723

class 装备302(夜语黑瞳武器):
    名称 = '界·夜语黑瞳苦无'
    类型 = '苦无'
    力量 = 0
    智力 = 117
    物理攻击力 = 977
    魔法攻击力 = 1288
    独立攻击力 = 723

class 装备303(夜语黑瞳武器):
    名称 = '界·夜语黑瞳长枪'
    类型 = '长枪'
    力量 = 117
    智力 = 0
    物理攻击力 = 1230
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备304(夜语黑瞳武器):
    名称 = '界·夜语黑瞳战戟'
    类型 = '战戟'
    力量 = 78
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 996
    独立攻击力 = 723

class 装备305(夜语黑瞳武器):
    名称 = '界·夜语黑瞳光枪'
    类型 = '光枪'
    力量 = 78
    智力 = 78
    物理攻击力 = 1112
    魔法攻击力 = 1346
    独立攻击力 = 723

class 装备306(夜语黑瞳武器):
    名称 = '界·夜语黑瞳暗矛'
    类型 = '暗矛'
    力量 = 78
    智力 = 117
    物理攻击力 = 1112
    魔法攻击力 = 1230
    独立攻击力 = 723

class 装备307(夜语黑瞳武器):
    名称 = '界·夜语黑瞳长刀'
    类型 = '长刀'
    力量 = 78
    智力 = 78
    物理攻击力 = 1265
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备308(夜语黑瞳武器):
    名称 = '界·夜语黑瞳小太刀'
    类型 = '小太刀'
    力量 = 78
    智力 = 39
    物理攻击力 = 1172
    魔法攻击力 = 1172
    独立攻击力 = 723

class 装备309(夜语黑瞳武器):
    名称 = '界·夜语黑瞳重剑'
    类型 = '重剑'
    力量 = 78
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备310(夜语黑瞳武器):
    名称 = '界·夜语黑瞳源力剑'
    类型 = '源力剑'
    力量 = 0
    智力 = 78
    物理攻击力 = 1112
    魔法攻击力 = 1346
    独立攻击力 = 723
#endregion

#region  暗黑圣战之溯回武器
class 暗黑圣战之溯回武器(装备):
    模式 = 1
    所属套装 = '无'
    等级 = 100
    品质 = '传说'
    部位 = '武器'
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.30)
        self.属性描述 += 属性.技能攻击力加成(0.52)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass

class 装备491(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：短剑'
    类型 = '短剑'
    力量 = 0
    智力 = 78
    物理攻击力 = 1113
    魔法攻击力 = 1348
    独立攻击力 = 719

class 装备492(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：太刀'
    类型 = '太刀'
    力量 = 78
    智力 = 117
    物理攻击力 = 1113
    魔法攻击力 = 1230
    独立攻击力 = 719

class 装备493(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：钝器'
    类型 = '钝器'
    力量 = 117
    智力 = 0
    物理攻击力 = 1289
    魔法攻击力 = 1113
    独立攻击力 = 719

class 装备494(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：巨剑'
    类型 = '巨剑'
    力量 = 78
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备495(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：光剑'
    类型 = '光剑'
    力量 = 78
    智力 = 0
    物理攻击力 = 1089
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备496(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：手套'
    类型 = '手套'
    力量 = 0
    智力 = 78
    物理攻击力 = 1113
    魔法攻击力 = 1348
    独立攻击力 = 719

class 装备497(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：臂铠'
    类型 = '臂铠'
    力量 = 117
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备498(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：爪'
    类型 = '爪'
    力量 = 78
    智力 = 39
    物理攻击力 = 1172
    魔法攻击力 = 1172
    独立攻击力 = 719

class 装备499(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：拳套'
    类型 = '拳套'
    力量 = 78
    智力 = 0
    物理攻击力 = 1230
    魔法攻击力 = 1113
    独立攻击力 = 719

class 装备500(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：东方棍'
    类型 = '东方棍'
    力量 = 78
    智力 = 117
    物理攻击力 = 1113
    魔法攻击力 = 1172
    独立攻击力 = 719

class 装备501(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：左轮枪'
    类型 = '左轮枪'
    力量 = 78
    智力 = 0
    物理攻击力 = 1178
    魔法攻击力 = 991
    独立攻击力 = 719

class 装备502(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：自动手枪'
    类型 = '自动手枪'
    力量 = 0
    智力 = 78
    物理攻击力 = 826
    魔法攻击力 = 1211
    独立攻击力 = 719

class 装备503(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：步枪'
    类型 = '步枪'
    力量 = 78
    智力 = 117
    物理攻击力 = 1266
    魔法攻击力 = 1101
    独立攻击力 = 719

class 装备504(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：手炮'
    类型 = '手炮'
    力量 = 117
    智力 = 0
    物理攻击力 = 1376
    魔法攻击力 = 826
    独立攻击力 = 719

class 装备505(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：手弩'
    类型 = '手弩'
    力量 = 78
    智力 = 39
    物理攻击力 = 991
    魔法攻击力 = 1101
    独立攻击力 = 719

class 装备506(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：矛'
    类型 = '矛'
    力量 = 117
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 996
    独立攻击力 = 719

class 装备507(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：棍棒'
    类型 = '棍棒'
    力量 = 78
    智力 = 78
    物理攻击力 = 1265
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备508(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：魔杖'
    类型 = '魔杖'
    力量 = 0
    智力 = 117
    物理攻击力 = 1055
    魔法攻击力 = 1289
    独立攻击力 = 719

class 装备509(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：法杖'
    类型 = '法杖'
    力量 = 0
    智力 = 78
    物理攻击力 = 1113
    魔法攻击力 = 1406
    独立攻击力 = 719

class 装备510(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：扫把'
    类型 = '扫把'
    力量 = 0
    智力 = 78
    物理攻击力 = 1172
    魔法攻击力 = 1289
    独立攻击力 = 719
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=127)
        self.属性描述 += 属性.被动增加(转职被动智力=127)
        self.属性描述 += 属性.BUFF增加(BUFFLv=5)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.09, BUFF智力per=1.09)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.18, BUFF魔攻per=1.18, BUFF独立per=1.18)
        self.属性描述 += 属性.觉醒增加(一觉Lv=2)
        self.属性描述 += 属性.觉醒增加(一觉力智=40)
        pass

class 装备511(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：十字架'
    类型 = '十字架'
    力量 = 0
    智力 = 78
    体力 = 95
    精神 = 95
    物理攻击力 = 1172
    魔法攻击力 = 1113
    独立攻击力 = 719
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=127)
        self.属性描述 += 属性.被动增加(转职被动智力=127)
        self.属性描述 += 属性.BUFF增加(BUFFLv=5)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.09, BUFF智力per=1.09)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.18, BUFF魔攻per=1.18, BUFF独立per=1.18)
        self.属性描述 += 属性.觉醒增加(一觉Lv=2)
        self.属性描述 += 属性.觉醒增加(一觉力智=40)
        pass

class 装备512(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：念珠'
    类型 = '念珠'
    力量 = 0
    智力 = 117
    物理攻击力 = 1055
    魔法攻击力 = 1348
    独立攻击力 = 719

class 装备513(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：图腾'
    类型 = '图腾'
    力量 = 117
    智力 = 0
    物理攻击力 = 1230
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备514(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：镰刀'
    类型 = '镰刀'
    力量 = 78
    智力 = 78
    物理攻击力 = 1113
    魔法攻击力 = 1172
    独立攻击力 = 719

class 装备515(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：战斧'
    类型 = '战斧'
    力量 = 78
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 996
    独立攻击力 = 719

class 装备516(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：匕首'
    类型 = '匕首'
    力量 = 78
    智力 = 0
    物理攻击力 = 1110
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备517(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：双剑'
    类型 = '双剑'
    力量 = 78
    智力 = 0
    物理攻击力 = 1279
    魔法攻击力 = 937
    独立攻击力 = 719

class 装备518(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：手杖'
    类型 = '手杖'
    力量 = 0
    智力 = 78
    物理攻击力 = 1033
    魔法攻击力 = 1348
    独立攻击力 = 719

class 装备519(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：苦无'
    类型 = '苦无'
    力量 = 0
    智力 = 117
    物理攻击力 = 979
    魔法攻击力 = 1289
    独立攻击力 = 719

class 装备520(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：长枪'
    类型 = '长枪'
    力量 = 117
    智力 = 0
    物理攻击力 = 1230
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备521(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：战戟'
    类型 = '战戟'
    力量 = 78
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 996
    独立攻击力 = 719

class 装备522(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：光枪'
    类型 = '光枪'
    力量 = 78
    智力 = 78
    物理攻击力 = 1113
    魔法攻击力 = 1348
    独立攻击力 = 719

class 装备523(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：暗矛'
    类型 = '暗矛'
    力量 = 78
    智力 = 117
    物理攻击力 = 1113
    魔法攻击力 = 1230
    独立攻击力 = 719

class 装备524(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：长刀'
    类型 = '长刀'
    力量 = 78
    智力 = 78
    物理攻击力 = 1265
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备525(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：小太刀'
    类型 = '小太刀'
    力量 = 78
    智力 = 39
    物理攻击力 = 1172
    魔法攻击力 = 1172
    独立攻击力 = 719

class 装备526(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：重剑'
    类型 = '重剑'
    力量 = 78
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备527(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：源力剑'
    类型 = '源力剑'
    力量 = 0
    智力 = 78
    物理攻击力 = 1113
    魔法攻击力 = 1348
    独立攻击力 = 719
#endregion