#region  超界
class 装备311():
    名称 = '超界·苍天之幕：卷层云'
    所属套装 = '超界·苍穹之云'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.21)
        属性.最终伤害加成(0.05)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +21%<br>'
        temp += '最终伤害 +5%<br>'
        return temp     

class 装备312():
    名称 = '超界·苍天之碧：卷云'
    所属套装 = '超界·苍穹之云'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':37, '轻甲':45, '重甲':41, '板甲':37}
    智力 = {'布甲':45, '皮甲':37, '轻甲':30, '重甲':30, '板甲':37}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.20)
        属性.最终伤害加成(0.05)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '技能攻击力 +20%<br>'
        temp += '最终伤害 +5%<br>'
        return temp   

class 装备313():
    名称 = '超界·苍天之流：层云'
    所属套装 = '超界·苍穹之云'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.21)
        属性.最终伤害加成(0.05)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +21%<br>'
        temp += '最终伤害 +5%<br>'
        return temp     

class 装备314():
    名称 = '超界·苍天之岭：积云'
    所属套装 = '超界·苍穹之云'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.20)
        属性.最终伤害加成(0.05)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +20%<br>'
        temp += '最终伤害 +5%<br>'
        return temp    

class 装备315():
    名称 = '超界·苍天之隙：高积云'
    所属套装 = '超界·苍穹之云'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.20)
        属性.最终伤害加成(0.05)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +20%<br>'
        temp += '最终伤害 +5%<br>'
        temp += '移动速度 +4%<br>'
        return temp     

class 装备316():
    名称 = '超界·芒种：绵延的生命'
    所属套装 = '超界·永恒的季节'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.20)
        属性.技能等级加成('所有', 1, 45, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +20%<br>'
        temp += 'Lv1-45 技能等级+1<br>'
        return temp


class 装备317():
    名称 = '超界·雨水：长青的群山'
    所属套装 = '超界·永恒的季节'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':37, '轻甲':45, '重甲':41, '板甲':37}
    智力 = {'布甲':45, '皮甲':37, '轻甲':30, '重甲':30, '板甲':37}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.20)
        属性.技能等级加成('所有', 1, 45, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +20%<br>'
        temp += 'Lv1-45 技能等级+1<br>'
        return temp

class 装备318():
    名称 = '超界·白露：不熄的光明'
    所属套装 = '超界·永恒的季节'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.21)
        属性.技能等级加成('所有', 35, 48, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +21%<br>'
        temp += 'Lv35-48 技能等级+1<br>'
        return temp

class 装备319():
    名称 = '超界·霜降：凝结的冰霜'
    所属套装 = '超界·永恒的季节'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.21)
        属性.技能等级加成('所有', 35, 48, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +21%<br>'
        temp += 'Lv35-48 技能等级+1<br>'
        return temp

class 装备320():
    名称 = '超界·小寒：澄净的心灵'
    所属套装 = '超界·永恒的季节'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.移动速度 += 0.10
        属性.暴击伤害加成(0.11)
        属性.技能等级加成('所有', 1, 85, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '移动速度 +10%<br>'
        temp += '暴击伤害 +11%<br>'
        temp += 'Lv1-85 技能等级+1<br>'
        return temp

class 装备321():
    名称 = '超界·海豚座的羞涩'
    所属套装 = '超界·亿万年的星光'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.20)
        属性.技能等级加成('所有', 85, 85, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +20%<br>'
        temp += 'Lv85 技能等级+1<br>'
        return temp

class 装备322():
    名称 = '超界·北极星的魅力'
    所属套装 = '超界·亿万年的星光'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':37, '轻甲':45, '重甲':41, '板甲':37}
    智力 = {'布甲':45, '皮甲':37, '轻甲':30, '重甲':30, '板甲':37}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.18)
        属性.物理暴击率 += 0.12
        属性.魔法暴击率 += 0.12
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass

    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '技能攻击力 +18%<br>'
        temp += '物理暴击率 +12%<br>'
        temp += '魔法暴击率 +12%<br>'
        return temp

class 装备323():
    名称 = '超界·织女星的凝望'
    所属套装 = '超界·亿万年的星光'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.20)
        属性.技能等级加成('所有', 50, 50, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +20%<br>'
        temp += 'Lv50 技能等级+1<br>'
        return temp

class 装备324():
    名称 = '超界·天琴座的高洁'
    所属套装 = '超界·亿万年的星光'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.21)
        属性.技能等级加成('所有', 50, 50, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +21%<br>'
        temp += 'Lv50 技能等级+1<br>'
        return temp

class 装备325():
    名称 = '超界·天鹅座的朦胧'
    所属套装 = '超界·亿万年的星光'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(40)
        属性.技能等级加成('所有', 85, 85, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.02
        属性.魔法暴击率 += 0.02
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '所有属性强化 +40<br>'
        temp += 'Lv85 技能等级+1<br>'
        temp += '物理暴击率 +2%<br>'
        temp += '魔法暴击率 +2%<br>'
        temp += '移动速度 +4%<br>'
        return temp

class 装备326():
    名称 = '超界·费诺的愤怒之勇'
    所属套装 = '超界·精灵的荣耀'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.25)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +25%<br>'
        return temp

class 装备327():
    名称 = '超界·维拉的光明净化'
    所属套装 = '超界·精灵的荣耀'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':37, '轻甲':45, '重甲':41, '板甲':37}
    智力 = {'布甲':45, '皮甲':37, '轻甲':30, '重甲':30, '板甲':37}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.23)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.06
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '技能攻击力 +23%<br>'
        temp += '攻击速度 +6%<br>'
        return temp

class 装备328():
    名称 = '超界·凯兰崔尔的决断'
    所属套装 = '超界·精灵的荣耀'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.25)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '最终伤害 +25%<br>'
        return temp

class 装备329():
    名称 = '超界·梵雅的绝世容颜'
    所属套装 = '超界·精灵的荣耀'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.24)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +24%<br>'
        return temp

class 装备330():
    名称 = '超界·伊露维塔的创生'
    所属套装 = '超界·精灵的荣耀'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.24)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +24%<br>'
        temp += '移动速度 +10%<br>'
        return temp

class 装备331():
    名称 = '超界·梦纤石的牵绊'
    所属套装 = '超界·幸运的五彩石'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.18)
        属性.冰属性强化加成(20)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +18%<br>'
        temp += '冰属性强化 +20<br>'
        return temp

class 装备332():
    名称 = '超界·君清石的思念'
    所属套装 = '超界·幸运的五彩石'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':37, '轻甲':45, '重甲':41, '板甲':37}
    智力 = {'布甲':45, '皮甲':37, '轻甲':30, '重甲':30, '板甲':37}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.17)
        属性.火属性强化加成(20)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '技能攻击力 +17%<br>'
        temp += '火属性强化 +20<br>'
        return temp

class 装备333():
    名称 = '超界·凤瞳石的轻鸣'
    所属套装 = '超界·幸运的五彩石'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.17)
        属性.光属性强化加成(20)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +17%<br>'
        temp += '光属性强化 +20<br>'
        return temp

class 装备334():
    名称 = '超界·琥冥石的乖戾'
    所属套装 = '超界·幸运的五彩石'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.18)
        属性.所有属性强化加成(20)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +18%<br>'
        temp += '所有属性强化 +20<br>'
        return temp

class 装备335():
    名称 = '超界·诛璃石的断杀'
    所属套装 = '超界·幸运的五彩石'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.18)
        属性.暗属性强化加成(20)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +18%<br>'
        temp += '暗属性强化 +20<br>'
        temp += '移动速度 +4%<br>'
        return temp

#endregion

#region  普雷
class 装备336():
    名称 = '暗黑之云：被吞噬的太阳'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 45
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(28)
        属性.技能攻击力加成(0.18)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +45<br>'
        temp += '所有属性强化 +28<br>'
        temp += '技能攻击力 +18%<br>'
        return temp

class 装备337():
    名称 = '暗黑之潮：分裂的太阳'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 45
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(24)
        属性.百分比三攻加成(0.22)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +45<br>'
        temp += '所有属性强化 +24<br>'
        temp += '百分比三攻 +22%<br>'
        return temp

class 装备338():
    名称 = '暗黑之炎：被蚕食的太阳'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 67
    智力 = 67
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(34)
        属性.技能攻击力加成(0.16)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +67<br>'
        temp += '智力 +67<br>'
        temp += '所有属性强化 +34<br>'
        temp += '技能攻击力 +16%<br>'
        return temp

class 装备339():
    名称 = '暗黑之云：被吞噬的大地'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 45
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(28)
        属性.技能攻击力加成(0.14)
        属性.技能等级加成('所有', 1, 48, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +45<br>'
        temp += '所有属性强化 +28<br>'
        temp += '技能攻击力 +14%<br>'
        temp += 'Lv1-48 技能等级+1<br>'
        return temp

class 装备340():
    名称 = '暗黑之潮：分裂的大地'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 45
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(24)
        属性.百分比三攻加成(0.18)
        属性.技能等级加成('所有', 60, 80, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +45<br>'
        temp += '所有属性强化 +24<br>'
        temp += '百分比三攻 +18%<br>'
        temp += 'Lv60-80 技能等级+1<br>'
        return temp

class 装备341():
    名称 = '暗黑之炎：被蚕食的大地'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 67
    智力 = 67
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(34)
        属性.技能攻击力加成(0.10)
        属性.技能等级加成('所有', 80, 85, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +67<br>'
        temp += '智力 +67<br>'
        temp += '所有属性强化 +34<br>'
        temp += '技能攻击力 +10%<br>'
        temp += 'Lv80-85 技能等级+1<br>'
        return temp

class 装备342():
    名称 = '暗黑之云：被吞噬的天空'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 45
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(28)
        属性.技能攻击力加成(0.14)
        属性.技能冷却缩减(60, 80, 0.12)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.03
        属性.释放速度 += 0.045
        属性.移动速度 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +45<br>'
        temp += '所有属性强化 +28<br>'
        temp += '技能攻击力 +14%<br>'
        temp += 'Lv60-80 技能CD-12%<br>'
        temp += '攻击速度 +3%<br>'
        temp += '释放速度 +4.5%<br>'
        temp += '移动速度 +3%<br>'
        return temp

class 装备343():
    名称 = '暗黑之潮：分裂的天空'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 45
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(24)
        属性.百分比三攻加成(0.19)
        属性.技能冷却缩减(1, 30, 0.15)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.03
        属性.释放速度 += 0.045
        属性.移动速度 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +45<br>'
        temp += '所有属性强化 +24<br>'
        temp += '百分比三攻 +19%<br>'
        temp += 'Lv1-30 技能CD-15%<br>'
        temp += '攻击速度 +3%<br>'
        temp += '释放速度 +4.5%<br>'
        temp += '移动速度 +3%<br>'
        return temp

class 装备344():
    名称 = '暗黑之炎：被蚕食的天空'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 67
    智力 = 67
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(34)
        属性.技能攻击力加成(0.11)
        属性.技能冷却缩减(35, 45, 0.15)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.03
        属性.释放速度 += 0.045
        属性.移动速度 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +67<br>'
        temp += '智力 +67<br>'
        temp += '所有属性强化 +34<br>'
        temp += '技能攻击力 +11%<br>'
        temp += 'Lv35-45 技能CD-15%<br>'
        temp += '攻击速度 +3%<br>'
        temp += '释放速度 +4.5%<br>'
        temp += '移动速度 +3%<br>'
        return temp

class 装备345():
    名称 = '暗黑之魂：被吞噬的太阳'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.16)
        属性.附加伤害加成(0.16)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '伤害增加 +16%<br>'
        temp += '附加伤害 +16%<br>'
        return temp

class 装备346():
    名称 = '暗黑之翼：被蚕食的太阳'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 44
    智力 = 44
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.15)
        属性.技能攻击力加成(0.08)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +44<br>'
        temp += '智力 +44<br>'
        temp += '伤害增加 +15%<br>'
        temp += '技能攻击力 +8%<br>'
        return temp

class 装备347():
    名称 = '暗黑之风：分裂的太阳'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.15)
        属性.技能攻击力加成(0.15)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '暴击伤害 +15%<br>'
        temp += '技能攻击力 +15%<br>'
        return temp

class 装备348():
    名称 = '暗黑之魂：被吞噬的大地'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.14)
        属性.附加伤害加成(0.14)
        属性.技能等级加成('所有', 60, 80, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '伤害增加 +14%<br>'
        temp += '附加伤害 +14%<br>'
        temp += 'Lv60-80 技能等级+1<br>'
        return temp

class 装备349():
    名称 = '暗黑之翼：被蚕食的大地'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 44
    智力 = 44
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.10)
        属性.技能攻击力加成(0.08)
        属性.技能等级加成('所有', 48, 70, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +44<br>'
        temp += '智力 +44<br>'
        temp += '伤害增加 +10%<br>'
        temp += '技能攻击力 +8%<br>'
        temp += 'Lv48-70 技能等级+1<br>'
        return temp

class 装备350():
    名称 = '暗黑之风：分裂的大地'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.10)
        属性.技能攻击力加成(0.15)
        属性.技能等级加成('所有', 35, 50, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '暴击伤害 +10%<br>'
        temp += '技能攻击力 +15%<br>'
        temp += 'Lv35-50 技能等级+1<br>'
        return temp


class 装备351():
    名称 = '暗黑之魂：被吞噬的天空'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.14)
        属性.附加伤害加成(0.14)
        属性.技能冷却缩减(1, 45, 0.12)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.03
        属性.释放速度 += 0.045
        属性.移动速度 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '伤害增加 +14%<br>'
        temp += '附加伤害 +14%<br>'
        temp += 'Lv1-45 技能CD-12%<br>'
        temp += '攻击速度 +3%<br>'
        temp += '释放速度 +4.5%<br>'
        temp += '移动速度 +3%<br>'
        return temp

class 装备352():
    名称 = '暗黑之翼：被蚕食的天空'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 44
    智力 = 44
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.11)
        属性.技能攻击力加成(0.08)
        属性.技能冷却缩减(75, 80, 0.15)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.03
        属性.释放速度 += 0.045
        属性.移动速度 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +44<br>'
        temp += '智力 +44<br>'
        temp += '伤害增加 +11%<br>'
        temp += '技能攻击力 +8%<br>'
        temp += 'Lv75-80 技能CD-15%<br>'
        temp += '攻击速度 +3%<br>'
        temp += '释放速度 +4.5%<br>'
        temp += '移动速度 +3%<br>'
        return temp

class 装备353():
    名称 = '暗黑之风：分裂的天空'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.11)
        属性.技能攻击力加成(0.15)
        属性.技能冷却缩减(60, 70, 0.15)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.03
        属性.释放速度 += 0.045
        属性.移动速度 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '暴击伤害 +11%<br>'
        temp += '技能攻击力 +15%<br>'
        temp += 'Lv60-70 技能CD-15%<br>'
        temp += '攻击速度 +3%<br>'
        temp += '释放速度 +4.5%<br>'
        temp += '移动速度 +3%<br>'
        return temp
#endregion

#region  100改造&传说
class 装备354():
    名称 = '轮回·维度冲击臂环'
    模式 = 1
    所属套装 = '智慧产物'
    所属套装2 = '维度崩坏'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.12)
        属性.技能攻击力加成(0.16)
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        属性.力量 += 25 * 属性.获取改造(self.部位)
        属性.智力 += 25 * 属性.获取改造(self.部位)
        属性.暴击伤害加成(0.02 * 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '百分比力智 +12%<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +28<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '力量 +' + str(25 * 改造等级) + '<br>'
            temp += '智力 +' + str(25 * 改造等级) + '<br>'
            temp += '暴击伤害+' + str(2 * 改造等级) + '%<br>'
        return temp

class 装备355():
    名称 = '时空：维度冲击臂环'
    模式 = 1
    所属套装 = '维度崩坏'
    等级 = 100
    品质 = '传说'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 46
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.10)
        属性.技能攻击力加成(0.16)
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +46<br>'
        temp += '百分比力智 +10%<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +28<br>'
        return temp

class 装备356():
    名称 = '维度定位项链'
    模式 = 1
    所属套装 = '维度崩坏'
    等级 = 100
    品质 = '传说'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 46
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.22)
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +46<br>'
        temp += '百分比三攻 +22%<br>'
        temp += '所有属性强化 +28<br>'
        return temp


class 装备357():
    名称 = '维度粉碎戒指'
    模式 = 1
    所属套装 = '维度崩坏'
    等级 = 100
    品质 = '传说'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 68
    智力 = 68
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.05)
        属性.技能攻击力加成(0.16)
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +68<br>'
        temp += '智力 +68<br>'
        temp += '附加伤害 +5%<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +28<br>'
        return temp

class 装备358():
    名称 = '轮回·腐蚀之黑色十字耳环'
    模式 = 1
    所属套装 = '智慧产物'
    所属套装2 = '暗之腐蚀'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.20)
        属性.附加伤害加成(0.20)
        pass
    def 进图属性(self, 属性):
        属性.力量 += 25 * 属性.获取改造(self.部位)
        属性.智力 += 25 * 属性.获取改造(self.部位)
        属性.百分比力智加成(0.02 * 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '伤害增加 +20%<br>'
        temp += '附加伤害 +20%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '力量 +' + str(25 * 改造等级) + '<br>'
            temp += '智力 +' + str(25 * 改造等级) + '<br>'
            temp += '百分比力智+' + str(2 * 改造等级) + '%<br>'
        return temp

class 装备359():
    名称 = '时空：腐蚀之黑色十字耳环'
    模式 = 1
    所属套装 = '暗之腐蚀'
    等级 = 100
    品质 = '传说'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 67
    智力 = 67
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.17)
        属性.附加伤害加成(0.17)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +67<br>'
        temp += '智力 +67<br>'
        temp += '伤害增加 +17%<br>'
        temp += '附加伤害 +17%<br>'
        return temp

class 装备360():
    名称 = '腐蚀之黑色面具'
    模式 = 1
    所属套装 = '暗之腐蚀'
    等级 = 100
    品质 = '传说'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 45
    智力 = 45
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.15)
        属性.技能攻击力加成(0.13)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +45<br>'
        temp += '智力 +45<br>'
        temp += '伤害增加 +15%<br>'
        temp += '技能攻击力 +13%<br>'
        return temp

class 装备361():
    名称 = '腐蚀之黑色尖角'
    模式 = 1
    所属套装 = '暗之腐蚀'
    等级 = 100
    品质 = '传说'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 67
    智力 = 67
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.13)
        属性.技能攻击力加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +67<br>'
        temp += '智力 +67<br>'
        temp += '暴击伤害 +13%<br>'
        temp += '技能攻击力 +15%<br>'
        return temp

class 装备362():
    名称 = '轮回·黑暗幽灵紫杉胸甲'
    模式 = 1
    所属套装 = '智慧产物'
    所属套装2 = '堕落的暗黑之力'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.15)
        属性.百分比力智加成(0.08)
        属性.伤害增加加成(0.11)
        pass
    def 进图属性(self, 属性):
        属性.力量 += 25 * 属性.获取改造(self.部位)
        属性.智力 += 25 * 属性.获取改造(self.部位)
        属性.技能攻击力加成(0.02 * 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +15%<br>'
        temp += '百分比力智 +8%<br>'
        temp += '伤害增加 +11%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '力量 +' + str(25 * 改造等级) + '<br>'
            temp += '智力 +' + str(25 * 改造等级) + '<br>'
            temp += '技能攻击力 +' + str(2 * 改造等级) + '%<br>'
        return temp
        return temp

class 装备363():
    名称 = '时空：黑暗幽灵紫杉胸甲'
    模式 = 1
    所属套装 = '堕落的暗黑之力'
    等级 = 100
    品质 = '传说'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':47, '轻甲':57, '重甲':52, '板甲':47}
    智力 = {'布甲':57, '皮甲':47, '轻甲':37, '重甲':37, '板甲':47}
    类型 = '轻甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.15)
        属性.百分比力智加成(0.08)
        属性.伤害增加加成(0.06)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +15%<br>'
        temp += '百分比力智 +8%<br>'
        temp += '伤害增加 +6%<br>'
        return temp

class 装备364():
    名称 = '黑暗幽灵紫杉护肩'
    模式 = 1
    所属套装 = '堕落的暗黑之力'
    等级 = 100
    品质 = '传说'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':39, '轻甲':45, '重甲':42, '板甲':39}
    智力 = {'布甲':45, '皮甲':39, '轻甲':31, '重甲':31, '板甲':39}
    类型 = '轻甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.12)
        属性.百分比力智加成(0.10)
        属性.所有属性强化加成(24)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +12%<br>'
        temp += '百分比力智 +10%<br>'
        temp += '所有属性强化 +24<br>'
        return temp


class 装备365():
    名称 = '黑暗幽灵紫杉护腿'
    模式 = 1
    所属套装 = '堕落的暗黑之力'
    等级 = 100
    品质 = '传说'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':47, '轻甲':57, '重甲':52, '板甲':47}
    智力 = {'布甲':57, '皮甲':47, '轻甲':37, '重甲':37, '板甲':47}
    类型 = '轻甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.15)
        属性.百分比力智加成(0.08)
        属性.所有属性强化加成(22)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +15%<br>'
        temp += '百分比力智 +8%<br>'
        temp += '所有属性强化 +22<br>'
        return temp

class 装备366():
    名称 = '黑暗幽灵紫杉腰带'
    模式 = 1
    所属套装 = '堕落的暗黑之力'
    等级 = 100
    品质 = '传说'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':29, '轻甲':34, '重甲':31, '板甲':29}
    智力 = {'布甲':34, '皮甲':29, '轻甲':23, '重甲':23, '板甲':29}
    类型 = '轻甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.12)
        属性.百分比力智加成(0.10)
        属性.所有属性强化加成(24)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +12%<br>'
        temp += '百分比力智 +10%<br>'
        temp += '所有属性强化 +24<br>'
        return temp


class 装备367():
    名称 = '黑暗幽灵紫杉长靴'
    模式 = 1
    所属套装 = '堕落的暗黑之力'
    等级 = 100
    品质 = '传说'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':29, '轻甲':34, '重甲':31, '板甲':29}
    智力 = {'布甲':34, '皮甲':29, '轻甲':23, '重甲':23, '板甲':29}
    类型 = '轻甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.05)
        属性.暴击伤害加成(0.08)
        属性.百分比力智加成(0.10)
        属性.所有属性强化加成(24)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +5%<br>'
        temp += '暴击伤害 +8%<br>'
        temp += '百分比力智 +10%<br>'
        temp += '所有属性强化 +24<br>'
        temp += '移动速度 +4%<br>'
        return temp


class 装备368():
    名称 = '维度冲击臂环'
    模式 = 1
    所属套装 = '维度崩坏'
    等级 = 100
    品质 = '传说'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 46
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.05)
        属性.技能攻击力加成(0.16)
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +46<br>'
        temp += '百分比力智 +5%<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +28<br>'
        return temp

class 装备369():
    名称 = '腐蚀之黑色十字耳环'
    模式 = 1
    所属套装 = '暗之腐蚀'
    等级 = 100
    品质 = '传说'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 67
    智力 = 67
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.14)
        属性.附加伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +67<br>'
        temp += '智力 +67<br>'
        temp += '伤害增加 +14%<br>'
        temp += '附加伤害 +14%<br>'
        return temp
        
class 装备370():
    名称 = '黑暗幽灵紫杉胸甲'
    模式 = 1
    所属套装 = '堕落的暗黑之力'
    等级 = 100
    品质 = '传说'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':47, '轻甲':57, '重甲':52, '板甲':47}
    智力 = {'布甲':57, '皮甲':47, '轻甲':37, '重甲':37, '板甲':47}
    类型 = '轻甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.15)
        属性.百分比力智加成(0.08)
        属性.所有属性强化加成(22)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +15%<br>'
        temp += '百分比力智 +8%<br>'
        temp += '所有属性强化 +22<br>'
        return temp

#endregion

#region 改造低级SS
class 装备390():
    名称 = '碧水红潮'
    所属套装 = '江山如画'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 67
    智力 = 67
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(16)
        属性.百分比三攻加成(0.18)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.移动速度 += 0.08
        属性.释放速度 += 0.12
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +67<br>'
        temp += '智力 +67<br>'
        temp += '所有属性强化 +16<br>'
        temp += '百分比三攻 +18%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +8%<br>'
        temp += '释放速度 +12%<br>'
        return temp

class 装备391():
    名称 = '雪浪风尘'
    所属套装 = '江山如画'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 45
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(16)
        属性.技能攻击力加成(0.18)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.移动速度 += 0.08
        属性.释放速度 += 0.12
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +45<br>'
        temp += '所有属性强化 +16<br>'
        temp += '技能攻击力 +18%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +8%<br>'
        temp += '释放速度 +12%<br>'
        return temp

class 装备392():
    名称 = '千寻一醉'
    所属套装 = '江山如画'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 45
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(16)
        属性.百分比力智加成(0.18)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.移动速度 += 0.08
        属性.释放速度 += 0.12
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +45<br>'
        temp += '所有属性强化 +16<br>'
        temp += '百分比力智 +18%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +8%<br>'
        temp += '释放速度 +12%<br>'
        return temp

class 装备393():
    名称 = '转世：回溯的生命'
    所属套装 = '万物的生灭'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.12)
        属性.暴击伤害加成(0.12)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '伤害增加 +12%<br>'
        temp += '暴击伤害 +12%<br>'
        return temp

class 装备394():
    名称 = '循环：无尽的诞生'
    所属套装 = '万物的生灭'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 44
    智力 = 44
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.10)
        属性.技能等级加成('所有', 1, 85, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +44<br>'
        temp += '智力 +44<br>'
        temp += '最终伤害 +10%<br>'
        temp += 'Lv1-85 技能等级+1<br>'
        return temp


class 装备395():
    名称 = '轮回：周而复始的时间'
    所属套装 = '万物的生灭'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(50)
        属性.技能攻击力加成(0.10)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '所有属性强化 +50<br>'
        temp += '技能攻击力 +10%<br>'
        return temp

class 改造产物():
    模式 = 1
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    力量 = 0
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    关联套装 = ''
    def 基础属性(self, 属性):
        pass
    def 改造属性(self, 属性, x):
        pass
    def 城镇属性(self, 属性):
        for i in 属性.装备栏:
            if 装备列表[装备序号[i]].所属套装 in self.关联套装:
                属性.力量 += 100
                属性.智力 += 100
        self.基础属性(属性)
        pass
    def 进图属性(self, 属性):
        if self.关联套装 in 属性.套装栏:
            self.改造属性(属性, 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        return temp

class 装备396(改造产物):
    名称 = '江山如故'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    关联套装 = '江山如画[3]'
    def 改造属性(self, 属性, x):
        属性.最终伤害加成(0.02 * x)
        if x >= 3:
            属性.伤害增加加成(0.14)
            属性.暴击伤害加成(0.28)
        if x >= 4:
            属性.最终伤害加成(0.21)
            属性.百分比三攻加成(0.38)
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.08
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '移动速度 +8%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '最终伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 3:
           temp += '伤害增加 +14%<br>'
           temp += '暴击伤害 +28%<br>'
        if 改造等级 >= 4:
           temp += '最终伤害 +21%<br>'
           temp += '百分比三攻 +38%<br>'
        return temp


class 装备397(改造产物):
    名称 = '天衍万物'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    关联套装 = '万物的生灭[3]'
    def 改造属性(self, 属性, x):
        属性.暴击伤害加成(0.02 * x)
        if x >= 3:
            属性.附加伤害加成(0.13)
            属性.百分比三攻加成(0.25)
        if x >= 4:
            属性.所有属性强化加成(60)
            属性.百分比力智加成(0.37)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.10
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '攻击速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '暴击伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 3:
           temp += '附加伤害 +13%<br>'
           temp += '百分比三攻 +25%<br>'
        if 改造等级 >= 4:
           temp += '所有属性强化 +60<br>'
           temp += '百分比力智 +37%<br>'
        return temp

class 装备398():
    名称 = '刻印：文韬妙策上衣'
    所属套装 = '兵法之神'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.08)
        属性.物理攻击力 += 100
        属性.魔法攻击力 += 100
        属性.独立攻击力 += 100
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +8%<br>'
        return temp

class 装备399():
    名称 = '刻印：龙韬秘法护肩'
    所属套装 = '兵法之神'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':37, '轻甲':45, '重甲':41, '板甲':37}
    智力 = {'布甲':45, '皮甲':37, '轻甲':30, '重甲':30, '板甲':37}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.08)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +8%<br>'
        return temp 

class 装备400():
    名称 = '刻印：虎韬妙计下装'
    所属套装 = '兵法之神'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.08)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.释放速度 += 0.075
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +8%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '释放速度 +7.5%<br>'
        return temp      

class 装备401():
    名称 = '刻印：豹韬飞跃战靴'
    所属套装 = '兵法之神'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.08)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.14
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '最终伤害 +8%<br>'
        temp += '移动速度 +14%<br>'
        return temp
     

class 装备402():
    名称 = '刻印：武韬秘典腰带'
    所属套装 = '兵法之神'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.08)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +8%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp 

class 装备403(改造产物):
    名称 = '过往时光的轮回'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    关联套装 = '兵法之神[5]'
    关联套装2 = '无相轮回的希望[2]'
    关联套装3 = '流逝轮回的记忆[3]'
    def 基础属性(self, 属性):
        属性.爆伤 = max(属性.爆伤, 0.45)
    def 改造属性(self, 属性, x):
        属性.技能攻击力加成(0.01 * x)
        if x >= 1:
            属性.最终伤害加成(0.40)
        if x >= 3:
            属性.暴击伤害加成(0.15)
            属性.百分比力智加成(0.35)
            属性.伤害增加加成(0.15)
        if x >= 4:
            属性.技能攻击力加成(0.15)
        pass
    def 进图属性(self, 属性):
        if (self.关联套装 in 属性.套装栏) and (self.关联套装2 in 属性.套装栏) and (self.关联套装3 in 属性.套装栏):
            self.改造属性(属性, 属性.获取改造(self.部位))
        pass

    def 城镇属性(self, 属性):
        for i in 属性.装备栏:
            if 装备列表[装备序号[i]].所属套装 in self.关联套装:
                属性.力量 += 100
                属性.智力 += 100
            if 装备列表[装备序号[i]].所属套装 in self.关联套装2:
                属性.力量 += 100
                属性.智力 += 100
            if 装备列表[装备序号[i]].所属套装 in self.关联套装3:
                属性.力量 += 100
                属性.智力 += 100
        self.基础属性(属性)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '爆伤 +45%(取最高值)<br>'
        if not ((self.关联套装 in 属性.套装栏) and (self.关联套装2 in 属性.套装栏) and (self.关联套装3 in 属性.套装栏)):
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '技能攻击力 +' + str(改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '最终伤害 +40%<br>'
        if 改造等级 >= 3:
           temp += '暴击伤害 +15%<br>'
           temp += '百分比力智 +35%<br>'
           temp += '伤害增加 +15%<br>'
        if 改造等级 >= 4:
           temp += '技能攻击力 +15%<br>'
        return temp
 
class 装备404():
    名称 = '流逝轮回的时间'
    所属套装 = '流逝轮回的记忆'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 45
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.10)
    def 进图属性(self, 属性):
        属性.力量 += 100
        属性.智力 += 100
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +145<br>'
        temp += '智力 +100<br>'
        temp += '附加伤害 +10%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp    

class 装备405():
    名称 = '流逝轮回的思念'
    所属套装 = '流逝轮回的记忆'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 45
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(42)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        属性.攻击速度 += 0.05
        属性.释放速度 += 0.05
        属性.移动速度 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +45<br>'
        temp += '所有属性强化 +42<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '释放速度 +5%<br>'
        temp += '移动速度 +5%<br>'
        return temp      

class 装备406():
    名称 = '流逝轮回的启迪'
    所属套装 = '流逝轮回的记忆'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 67
    智力 = 67
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.08)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        pass
    名称 = '流逝轮回的启迪'
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +67<br>'
        temp += '智力 +67<br>'
        temp += '技能攻击力 +8%<br>'
        temp += '攻击速度 +5%<br>'
        return temp   

class 装备407():
    名称 = '无相轮回的追忆'
    所属套装 = '无相轮回的希望'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.06)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    名称 = '无相轮回的追忆'
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '伤害增加 +6%<br>'
        return temp     

class 装备408():
    名称 = '无相轮回的信念'
    所属套装 = '无相轮回的希望'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 105
    智力 = 105
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.物理攻击力 += 50
        属性.魔法攻击力 += 50
        属性.独立攻击力 += 50
        属性.黄字 = max(属性.黄字, 0.10)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +105<br>'
        temp += '智力 +105<br>'
        temp += '物理攻击力 +50<br>'
        temp += '魔法攻击力 +50<br>'
        temp += '独立攻击力 +50<br>'
        temp += '伤害增加 +10%<br>'
        return temp      

class 装备409():
    名称 = '无相轮回的眼泪'
    所属套装 = '无相轮回的希望'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(16)
        属性.暴击伤害加成(0.06)
    def 进图属性(self, 属性):
        属性.所有属性强化加成(10)
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '所有属性强化 +16<br>'
        temp += '暴击伤害 +6%<br>'
        temp += '所有属性强化 +10<br>'
        return temp    

class 装备410():
    名称 = '魔战无双胸甲'
    所属套装 = '魔战无双'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.黄字 = max(属性.黄字, 0.10)
        属性.加算冷却缩减 += 0.12
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.释放速度 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'            
        temp += '黄字 +10%(取最高值)<br>'
        temp += '技能冷却 -12%(加算)<br>'
        temp += '释放速度 +5%<br>'
        return temp     

class 装备411():
    名称 = '魔战无双肩甲'
    所属套装 = '魔战无双'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':34, '轻甲':41, '重甲':37, '板甲':34}	
    智力 = {'布甲':41, '皮甲':34, '轻甲':28, '重甲':28, '板甲':34}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.技能等级加成('所有', 30, 48, 2)
        try:
            属性.技能栏[属性.技能序号['基础精通']].倍率 *= 2.5
        except:
            pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.12
        属性.释放速度 += 0.12
        属性.移动速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'     
        temp += 'Lv30-48 技能等级+2<br>'
        temp += '基础精通效果 +150%<br>'
        temp += '攻击速度 +12%<br>'
        temp += '释放速度 +12%<br>'
        temp += '移动速度 +15%<br>'
        return temp     

class 装备412():
    名称 = '魔战无双腿甲'
    所属套装 = '魔战无双'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.加算冷却缩减 += 0.10
        属性.技能等级加成('所有', 85, 85, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.释放速度 += 0.05
        属性.移动速度 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '技能冷却 -10%(加算)<br>'
        temp += 'Lv85 技能等级+1<br>'
        temp += '攻击速度 +5%<br>'
        temp += '释放速度 +5%<br>'
        temp += '移动速度 +5%<br>'
        return temp   

class 装备413():
    名称 = '魔战无双腰带'
    所属套装 = '魔战无双'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.加算冷却缩减 += 0.10
        属性.技能等级加成('所有', 80, 80, 2)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '技能冷却 -10%(加算)<br>'
        temp += 'Lv80 技能等级+2<br>'
        return temp     

class 装备414():
    名称 = '魔战无双短靴'
    所属套装 = '魔战无双'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':88, '皮甲':113, '轻甲':119, '重甲':116, '板甲':113}	
    智力 = {'布甲':119, '皮甲':113, '轻甲':108, '重甲':108, '板甲':113}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.08)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.06
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '百分比三攻 +8%<br>'
        temp += '移动速度 +6%<br>'
        return temp     

class 装备415(改造产物):
    名称 = '聚魔漩涡'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    关联套装 = '魔战无双[5]'
    def 改造属性(self, 属性, x):
        属性.最终伤害加成(0.02 * x)
        if x >= 1:
            属性.暴击伤害加成(0.40)
        if x >= 3:
            属性.百分比三攻加成(0.10)
            属性.百分比力智加成(0.33)
            属性.技能攻击力加成(0.20)
        if x >= 5:
            属性.最终伤害加成(0.08)
            属性.技能攻击力加成(0.40)
        pass
    def 基础属性(self, 属性):
        属性.附加伤害加成(0.35)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '附加伤害 +35%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '最终伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
            temp += '暴击伤害 +40%<br>'
        if 改造等级 >= 3:
            temp += '百分比三攻 +10%<br>'
            temp += '百分比力智 +33%<br>'
            temp += '技能攻击力 +20%<br>'
        if 改造等级 >= 5:
            temp += '最终伤害 +8%<br>'
            temp += '技能攻击力 +40%<br>'
        return temp     

class 装备416():
    名称 = '霸域英豪胸甲'
    所属套装 = '霸域英豪'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':55, '皮甲':98, '轻甲':106, '重甲':101, '板甲':98}	
    智力 = {'布甲':106, '皮甲':98, '轻甲':89, '重甲':89, '板甲':98}	
    类型 = '板甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.物理攻击力 += 100
        属性.魔法攻击力 += 100
        属性.独立攻击力 += 100
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '物理攻击力 +100<br>'
        temp += '魔法攻击力 +100<br>'
        temp += '独立攻击力 +100<br>'
        return temp   

class 装备417():
    名称 = '霸域英豪护肩'
    所属套装 = '霸域英豪'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':34, '轻甲':41, '重甲':37, '板甲':34}	
    智力 = {'布甲':41, '皮甲':34, '轻甲':28, '重甲':28, '板甲':34}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.爆伤 = max(属性.爆伤, 0.15)
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.07
        属性.魔法暴击率 += 0.07
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '爆伤 +15%(取最高值)<br>'
        temp += '物理暴击率 +7%<br>'
        temp += '魔法暴击率 +7%<br>'
        return temp        

class 装备418():
    名称 = '霸域英豪护腿'
    所属套装 = '霸域英豪'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':55, '皮甲':98, '轻甲':106, '重甲':101, '板甲':98}	
    智力 = {'布甲':106, '皮甲':98, '轻甲':89, '重甲':89, '板甲':98}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.物理攻击力 += 100
        属性.魔法攻击力 += 100
        属性.独立攻击力 += 100
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '物理攻击力 +100<br>'
        temp += '魔法攻击力 +100<br>'
        temp += '独立攻击力 +100<br>'
        return temp       

class 装备419():
    名称 = '霸域英豪腰带'
    所属套装 = '霸域英豪'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':165, '皮甲':190, '轻甲':196, '重甲':193, '板甲':190}	
    智力 = {'布甲':196, '皮甲':190, '轻甲':185, '重甲':185, '板甲':190}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        return temp       

class 装备420():
    名称 = '霸域英豪战靴'
    所属套装 = '霸域英豪'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.3
        属性.移动速度 += 0.3
        属性.释放速度 += 0.3
        属性.攻击速度 += 0.02
        属性.移动速度 += 0.06
        属性.释放速度 += 0.03
        属性.物理暴击率 += 0.1
        属性.魔法暴击率 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '攻击速度 +30%<br>'
        temp += '移动速度 +30%<br>'
        temp += '释放速度 +30%<br>'
        temp += '攻击速度 +2%<br>'
        temp += '移动速度 +6%<br>'
        temp += '释放速度 +3%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp    

class 装备421(改造产物):
    名称 = '全能霸域'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    关联套装 = '霸域英豪[5]'
    def 改造属性(self, 属性, x):
        属性.最终伤害加成(0.02 * x)
        if x >= 1:
            属性.所有属性强化加成(50)
            属性.技能等级加成('所有', 50, 85, 2)
            属性.技能等级加成('所有', 100, 100, 2)
        if x >= 3:
            属性.百分比力智加成(0.19)
            属性.伤害增加加成(0.22)
            属性.技能攻击力加成(0.28)
        if x >= 5:
            属性.百分比力智加成(0.63)
        pass
    def 基础属性(self, 属性):
        属性.百分比三攻加成(0.40)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '百分比三攻 +40%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '最终伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '所有属性强化 +50<br>'
           temp += 'Lv50-85 技能等级+2<br>'
           temp += 'Lv100   技能等级+2<br>'
        if 改造等级 >= 3:
           temp += '百分比力智 +19%<br>'
           temp += '伤害增加 +22%<br>'
           temp += '技能攻击力 +28%<br>'
        if 改造等级 >= 5:
           temp += '百分比力智 +63%<br>'
        return temp     

class 装备422():
    名称 = '千蛛碎影之毒牙胸甲'
    所属套装 = '千蛛碎影'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':154, '皮甲':197, '轻甲':205, '重甲':200, '板甲':197}	
    智力 = {'布甲':205, '皮甲':197, '轻甲':188, '重甲':188, '板甲':197}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.固定减防 = 36000 * 千蛛减防
        pass
    def 进图属性(self, 属性):
        if 属性.职业 == '街霸':
            for i in 属性.技能栏:
                if i.是否有伤害 == 1:
                    i.中毒倍率 += 0.2
                    if 属性.角色 == '格斗家(女)':
                        i.涂毒倍率 += 0.2
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '中毒、涂毒伤害 +20%<br>'
        if 千蛛减防 == 1:
            temp += '固定减防 +36000(最多叠加1次)<br>'
        return temp      

class 装备423():
    名称 = '千蛛碎影之蛛丝肩甲'
    所属套装 = '千蛛碎影'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':110, '皮甲':144, '轻甲':151, '重甲':147, '板甲':144}	
    智力 = {'布甲':151, '皮甲':144, '轻甲':138, '重甲':138, '板甲':144}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.固定减防 = 36000 * 千蛛减防
        属性.技能等级加成('所有', 48, 48, 1)
        if 属性.职业 == '街霸' and 属性.角色 == '格斗家(男)':
            for i in 属性.技能栏:
                if i.是否有伤害 == 1:
                    i.感电倍率 += 0.2
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += 'Lv48 技能等级+1<br>'
        temp += '感电伤害 +20%<br>'
        if 千蛛减防 == 1:
            temp += '固定减防 +36000(最多叠加1次)<br>'
        return temp      

class 装备424():
    名称 = '千蛛碎影之蛛网护腿'
    所属套装 = '千蛛碎影'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':154, '皮甲':197, '轻甲':205, '重甲':200, '板甲':197}	
    智力 = {'布甲':205, '皮甲':197, '轻甲':188, '重甲':188, '板甲':197}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.固定减防 = 36000 * 千蛛减防
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        if 千蛛减防 == 1:
            temp += '固定减防 +36000(最多叠加1次)<br>'
        return temp

class 装备425():
    名称 = '千蛛碎影之蛛刺腰带'
    所属套装 = '千蛛碎影'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':110, '皮甲':135, '轻甲':141, '重甲':138, '板甲':135}	
    智力 = {'布甲':141, '皮甲':135, '轻甲':130, '重甲':130, '板甲':135}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.技能等级加成('所有', 48, 48, 1)
        属性.固定减防 = 36000 * 千蛛减防
        pass
    def 进图属性(self, 属性):
        if 属性.职业 == '街霸':
            for i in 属性.技能栏:
                if i.是否有伤害 == 1:
                    i.灼伤倍率 += 0.2
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += 'Lv48 技能等级+1<br>'
        temp += '灼伤伤害 +20%<br>'
        if 千蛛减防 == 1:
            temp += '固定减防 +36000(最多叠加1次)<br>'
        return temp    

class 装备426():
    名称 = '千蛛碎影之利齿战靴'
    所属套装 = '千蛛碎影'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':110, '皮甲':135, '轻甲':141, '重甲':138, '板甲':135}	
    智力 = {'布甲':141, '皮甲':135, '轻甲':130, '重甲':130, '板甲':135}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.技能等级加成('所有', 48, 48, 1)
        属性.固定减防 = 36000 * 千蛛减防
        pass
    def 进图属性(self, 属性):
        if 属性.职业 == '街霸':
            for i in 属性.技能栏:
                if i.是否有伤害 == 1:
                    i.出血倍率 += 1.2
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += 'Lv48 技能等级+1<br>'
        temp += '出血伤害 +20%<br>'
        if 千蛛减防 == 1:
            temp += '固定减防 +36000(最多叠加1次)<br>'
        return temp       

class 装备427(改造产物):
    名称 = '百变千蛛'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    关联套装 = '千蛛碎影[5]'
    def 改造属性(self, 属性, x):
        属性.伤害增加加成(0.02 * x)
        if x >= 1:
            属性.附加伤害加成(0.18)
            属性.最终伤害加成(0.40)
        if x >= 3:
            属性.暴击伤害加成(0.38)
            属性.技能攻击力加成(0.30)
        if x >= 5:
            属性.百分比力智加成(0.45)
            属性.百分比三攻加成(0.10)
        pass
    def 基础属性(self, 属性):
        属性.所有属性强化加成(119)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '所有属性强化 +119<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '伤害增加 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '附加伤害 +18%<br>'
           temp += '最终伤害 +40%<br>'
        if 改造等级 >= 3:
           temp += '暴击伤害 +38%<br>'
           temp += '技能攻击力 +30%<br>'
        if 改造等级 >= 5:
           temp += '百分比力智 +45%<br>'
           temp += '百分比三攻 +10%<br>'
        return temp   

class 装备428():
    名称 = '誓血之盟铠甲'
    所属套装 = '誓血之盟'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':220, '皮甲':263, '轻甲':271, '重甲':266, '板甲':263}	
    智力 = {'布甲':271, '皮甲':263, '轻甲':254, '重甲':254, '板甲':263}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.力量 += 200
        属性.智力 += 200
        属性.攻击速度 += 0.14
        属性.释放速度 += 0.22
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '攻击速度 +14%<br>'
        temp += '释放速度 +22%<br>'
        temp += '力量 +200<br>'
        temp += '智力 +200<br>'
        return temp       

class 装备429():
    名称 = '誓血之盟肩甲'
    所属套装 = '誓血之盟'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':83, '皮甲':117, '轻甲':123, '重甲':120, '板甲':117}	
    智力 = {'布甲':123, '皮甲':117, '轻甲':110, '重甲':110, '板甲':117}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.物理攻击力 += 116
        属性.魔法攻击力 += 116
        属性.独立攻击力 += 116
        属性.伤害增加加成(0.04)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '伤害增加 +4%<br>'
        temp += '物理攻击 +116<br>'
        temp += '魔法攻击 +116<br>'
        temp += '独立攻击 +116<br>'
        return temp
    

class 装备430():
    名称 = '誓血之盟腿甲'
    所属套装 = '誓血之盟'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.物理攻击力 += 138
        属性.魔法攻击力 += 138
        属性.独立攻击力 += 138
        pass
    def 进图属性(self, 属性):#mp<85%
        属性.物理暴击率 += 0.15
        属性.魔法暴击率 += 0.15
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '物理暴击率 +15%<br>'
        temp += '魔法暴击率 +15%<br>'
        temp += '物理攻击 +138<br>'
        temp += '魔法攻击 +138<br>'
        temp += '独立攻击 +138<br>'
        return temp     

class 装备431():
    名称 = '誓血之盟腰带'
    所属套装 = '誓血之盟'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.05)
        pass
    def 进图属性(self, 属性):
        属性.物理攻击力 += 100
        属性.魔法攻击力 += 100
        属性.独立攻击力 += 100
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '百分比三攻 +5%<br>'
        temp += '物理攻击 +100<br>'
        temp += '魔法攻击 +100<br>'
        temp += '独立攻击 +100<br>'
        return temp       

class 装备432():
    名称 = '誓血之盟战靴'
    所属套装 = '誓血之盟'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(14)
        属性.物理攻击力 += 100
        属性.魔法攻击力 += 100
        属性.独立攻击力 += 100
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.移动速度 += 0.09
        属性.释放速度 += 0.07
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '所有属性强化 +14<br>'
        temp += '物理攻击 +100<br>'
        temp += '魔法攻击 +100<br>'
        temp += '独立攻击 +100<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +9%<br>'
        temp += '释放速度 +7%<br>'
        return temp       

class 装备433(改造产物):
    名称 = '禁断契约书'
    部位 = '辅助装备'
    类型 = '特殊装备'
    力量 = 146
    智力 = 146
    关联套装 = '誓血之盟[5]'
    def 改造属性(self, 属性, x):
        属性.最终伤害加成(0.02 * x)
        if x >= 1:
            属性.伤害增加加成(0.10)
            属性.百分比力智加成(0.35)
        if x >= 3:
            属性.最终伤害加成(0.05)
            属性.百分比力智加成(0.15)
            属性.技能攻击力加成(0.20)
            属性.附加伤害加成(0.25)
        if x >= 5:
            属性.最终伤害加成(0.27)
            属性.暴击伤害加成(0.50)
            pass
    def 基础属性(self, 属性):
        属性.爆伤 = max(属性.爆伤, 0.45)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '爆伤 +45%(取最高值)<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '最终伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '伤害增加 +10%<br>'
           temp += '百分比力智 +35%<br>'
        if 改造等级 >= 3:
           temp += '最终伤害 +5%<br>'
           temp += '百分比力智 +15%<br>'
           temp += '技能攻击力 +20%<br>'
           temp += '附加伤害 +25%<br>'
        if 改造等级 >= 3:
           temp += '最终伤害 +27%<br>'
           temp += '暴击伤害 +50%<br>'
        return temp       

class 装备434():
    名称 = '天御雷罚战甲'
    所属套装 = '天御之灾'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.光属性强化加成(24)
        属性.物理攻击力 += 74
        属性.魔法攻击力 += 74
        属性.独立攻击力 += 74
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.03
        属性.魔法暴击率 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '光属性强化 +24<br>'
        temp += '物理暴击率 +3%<br>'
        temp += '魔法暴击率 +3%<br>'
        return temp     

class 装备435():
    名称 = '天御虫噬战甲'
    所属套装 = '天御之灾'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':34, '轻甲':41, '重甲':37, '板甲':34}	
    智力 = {'布甲':41, '皮甲':34, '轻甲':28, '重甲':28, '板甲':34}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.暗属性强化加成(24)
        属性.物理攻击力 += 74
        属性.魔法攻击力 += 74
        属性.独立攻击力 += 74
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.03
        属性.魔法暴击率 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '暗属性强化 +24<br>'
        temp += '物理攻击力 +74<br>'
        temp += '魔法攻击力 +74<br>'
        temp += '独立攻击力 +74<br>'
        temp += '物理暴击率 +3%<br>'
        temp += '魔法暴击率 +3%<br>'
        return temp      

class 装备436():
    名称 = '天御火袭战甲'
    所属套装 = '天御之灾'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.火属性强化加成(24)
        属性.物理攻击力 += 74
        属性.魔法攻击力 += 74
        属性.独立攻击力 += 74
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.03
        属性.魔法暴击率 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '火属性强化 +24<br>'
        temp += '物理攻击力 +74<br>'
        temp += '魔法攻击力 +74<br>'
        temp += '独立攻击力 +74<br>'
        temp += '物理暴击率 +3%<br>'
        temp += '魔法暴击率 +3%<br>'
        return temp      

class 装备437():
    名称 = '天御凝霜战甲'
    所属套装 = '天御之灾'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.冰属性强化加成(24)
        属性.物理攻击力 += 74
        属性.魔法攻击力 += 74
        属性.独立攻击力 += 74
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.03
        属性.魔法暴击率 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '冰属性强化 +24<br>'
        temp += '物理攻击力 +74<br>'
        temp += '魔法攻击力 +74<br>'
        temp += '独立攻击力 +74<br>'
        temp += '物理暴击率 +3%<br>'
        temp += '魔法暴击率 +3%<br>'
        return temp      

class 装备438():
    名称 = '天御风行战甲'
    所属套装 = '天御之灾'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.所有属性强化加成 (14)
        属性.物理攻击力 += 74
        属性.魔法攻击力 += 74
        属性.独立攻击力 += 74
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.03
        属性.魔法暴击率 += 0.03
        属性.攻击速度 += 0.08
        属性.移动速度 += 0.12
        属性.释放速度 += 0.12
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '所有属性强化 +14<br>'
        temp += '物理攻击力 +74<br>'
        temp += '魔法攻击力 +74<br>'
        temp += '独立攻击力 +74<br>'
        temp += '物理暴击率 +3%<br>'
        temp += '魔法暴击率 +3%<br>'
        temp += '攻击速度 +8%<br>'
        temp += '移动速度 +12%<br>'
        temp += '释放速度 +12%<br>'
        return temp       

class 装备439(改造产物):
    名称 = '天御万物'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    关联套装 = '天御之灾[5]'
    def 改造属性(self, 属性, x):
        属性.最终伤害加成(0.02 * x)
        if x >= 1:
            属性.百分比力智加成(0.28)
        if x >= 3:
            属性.所有属性强化加成 (50)
            属性.百分比三攻加成(0.32)
            属性.技能攻击力加成(0.20)
        if x >= 5:
            属性.最终伤害加成(0.17)
            属性.属性附加加成(0.25)
            属性.伤害增加加成(0.18)
        pass
    def 基础属性(self, 属性):
        属性.伤害增加加成(0.18)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '伤害增加 +18%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '最终伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '百分比力智 +28%<br>'
        if 改造等级 >= 3:
           temp += '所有属性强化 +50<br>'
           temp += '百分比三攻 +32%<br>'
           temp += '技能攻击力 +20%<br>'
        if 改造等级 >= 5:
           temp += '最终伤害 +17%<br>'
           temp += '属性附加 +25%<br>'
           temp += '伤害增加 +18%<br>'
        return temp     

class 装备440():
    名称 = '最佳球手的暴走战衣'
    所属套装 = '最佳球手的绝杀'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':94, '皮甲':136, '轻甲':144, '重甲':140, '板甲':136}	
    智力 = {'布甲':144, '皮甲':136, '轻甲':128, '重甲':128, '板甲':136}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.物理攻击力 += 149
        属性.魔法攻击力 += 149
        属性.独立攻击力 += 149
        属性.伤害增加加成(0.04)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '伤害增加 +4%<br>'
        temp += '物理攻击力 +149<br>'
        temp += '魔法攻击力 +149<br>'
        temp += '独立攻击力 +149<br>'
        return temp      

class 装备441():
    名称 = '最佳球手的反击护具'
    所属套装 = '最佳球手的绝杀'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':330, '皮甲':364, '轻甲':371, '重甲':367, '板甲':364}	
    智力 = {'布甲':371, '皮甲':364, '轻甲':358, '重甲':358, '板甲':364}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        return temp      

class 装备442():
    名称 = '最佳球手的奇袭长裤'
    所属套装 = '最佳球手的绝杀'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.爆伤 = max(属性.爆伤, 0.18)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '暴伤 +18%(取最大值)<br>'
        return temp  

class 装备443():
    名称 = '最佳球手的冲锋腰带'
    所属套装 = '最佳球手的绝杀'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.物理攻击力 += 138
        属性.魔法攻击力 += 138
        属性.独立攻击力 += 138
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.回避率 += 0.05
        属性.物理暴击率 += 0.15
        属性.魔法暴击率 += 0.15
        属性.命中率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '物理攻击力 +138<br>'
        temp += '魔法攻击力 +138<br>'
        temp += '独立攻击力 +138<br>'
        temp += '物理暴击率 +15%<br>'
        temp += '魔法暴击率 +15%<br>'
        temp += '命中率 +5%<br>'
        temp += '回避率 +5%<br>'
        return temp     

class 装备444():
    名称 = '最佳球手的逆袭跑鞋'
    所属套装 = '最佳球手的绝杀'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.06
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '移动速度 +6%<br>'
        return temp      

class 装备445(改造产物):
    名称 = '最佳球手之球'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    关联套装 = '最佳球手的绝杀[5]'
    def 改造属性(self, 属性, x):
        属性.百分比力智加成(0.02 * x)
        if x >= 1:
            属性.暴击伤害加成(0.35)
            属性.伤害增加加成(0.20)
        if x >= 3:
            属性.百分比力智加成(0.20)
            属性.技能攻击力加成(0.20)
            属性.伤害增加加成(0.10)
        if x >= 5:
            属性.附加伤害加成(0.65)
        pass
    def 基础属性(self, 属性):
        属性.最终伤害加成(0.45)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '最终伤害 +45%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '百分比力智 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '暴击伤害 +35%<br>'
           temp += '伤害增加 +20%<br>'
        if 改造等级 >= 3:
           temp += '百分比力智 +20%<br>'
           temp += '技能攻击力 +20%<br>'
           temp += '伤害增加 +10%<br>'
        if 改造等级 >= 5:
           temp += '附加伤害 +65%<br>'
        
        return temp

class 装备446():
    名称 = '战术之王的御敌胸甲'
    所属套装 = '战术之王的御敌'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':33, '皮甲':76, '轻甲':84, '重甲':79, '板甲':76}	
    智力 = {'布甲':84, '皮甲':76, '轻甲':67, '重甲':67, '板甲':76}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.物理攻击力 += 80
        属性.魔法攻击力 += 80
        属性.独立攻击力 += 80
        pass
    def 其它属性(self, 属性):
        属性.命中率 += 0.02
        属性.回避率 += 0.02
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '物理攻击力 +80<br>'
        temp += '魔法攻击力 +80<br>'
        temp += '独立攻击力 +80<br>'
        temp += '命中率 +2%<br>'
        temp += '回避率 +2%<br>'
        return temp   

class 装备447():
    名称 = '战术之王的御敌肩甲'
    所属套装 = '战术之王的御敌'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':33, '皮甲':67, '轻甲':74, '重甲':70, '板甲':67}	
    智力 = {'布甲':74, '皮甲':67, '轻甲':61, '重甲':61, '板甲':67}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.10
        属性.移动速度 += 0.10
        属性.释放速度 += 0.15
        属性.命中率 += 0.10
        属性.回避率 += 0.01
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        temp += '命中率 +10%<br>'
        temp += '回避率 +1%<br>'
        return temp      

class 装备448():
    名称 = '战术之王的御敌护腿'
    所属套装 = '战术之王的御敌'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':33, '皮甲':76, '轻甲':84, '重甲':79, '板甲':76}	
    智力 = {'布甲':84, '皮甲':76, '轻甲':67, '重甲':67, '板甲':76}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.12
        属性.魔法暴击率 += 0.12
        属性.命中率 += 0.02
        属性.回避率 += 0.02
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '物理暴击率 +12%<br>'
        temp += '魔法暴击率 +12%<br>'
        temp += '命中率 +2%<br>'
        temp += '回避率 +2%<br>'
        return temp     

class 装备449():
    名称 = '战术之王的御敌腰带'
    所属套装 = '战术之王的御敌'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':33, '皮甲':58, '轻甲':64, '重甲':61, '板甲':58}	
    智力 = {'布甲':64, '皮甲':58, '轻甲':53, '重甲':53, '板甲':58}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(20)
        pass
    def 其它属性(self, 属性):
        属性.命中率 += 0.01
        属性.回避率 += 0.01
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '所有属性强化 +20<br>'
        temp += '命中率 +1%<br>'
        temp += '回避率 +1%<br>'
        return temp    

class 装备450():
    名称 = '战术之王的御敌长靴'
    所属套装 = '战术之王的御敌'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':33, '皮甲':58, '轻甲':64, '重甲':61, '板甲':58}	
    智力 = {'布甲':64, '皮甲':58, '轻甲':53, '重甲':53, '板甲':58}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.力量 += 120
        属性.智力 += 120
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        属性.命中率 += 0.01
        属性.回避率 += 0.01
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '力量 +120<br>'
        temp += '智力 +120<br>'
        temp += '移动速度 +4%<br>'
        temp += '命中率 +1%<br>'
        temp += '回避率 +1%<br>'
        return temp     

class 装备451(改造产物):
    名称 = '战术之王的战术指挥棒'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    关联套装 = '战术之王的御敌[5]'
    def 改造属性(self, 属性, x):
        属性.百分比三攻加成(0.02 * x)
        if x >= 1:
            属性.最终伤害加成(0.32)
            属性.技能等级加成('所有', 60, 80, 3)
        if x >= 3:
            属性.百分比三攻加成(0.30)
            属性.技能攻击力加成(0.20)
        if x >= 5:
            属性.技能攻击力加成(0.10)
        pass
    def 基础属性(self, 属性):
        属性.爆伤 = max(属性.爆伤, 0.42)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '爆伤 +42%(取最高值)<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '百分比三攻 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '最终伤害 +32%<br>'
           temp += 'Lv60-80 技能等级+3<br>'
        if 改造等级 >= 3:
           temp += '百分比三攻 +30%<br>'
           temp += '技能攻击力 +20%<br>'
        if 改造等级 >= 5:
           temp += '技能攻击力 +10%<br>'
        return temp

class 装备452():
    名称 = '暗魅之影上衣'
    所属套装 = '杀意决'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':50, '皮甲':92, '轻甲':100, '重甲':96, '板甲':92}	
    智力 = {'布甲':100, '皮甲':92, '轻甲':84, '重甲':84, '板甲':92}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.黄字 = max(属性.黄字, 0.18)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '黄字 +18%(取最高值)<br>'
        return temp      

class 装备453():
    名称 = '冥殇之刃肩甲'
    所属套装 = '杀意决'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':33, '皮甲':67, '轻甲':74, '重甲':70, '板甲':67}	
    智力 = {'布甲':74, '皮甲':67, '轻甲':61, '重甲':61, '板甲':67}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.物理攻击力 += 66
        属性.魔法攻击力 += 66
        属性.独立攻击力 += 66
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.物理暴击率 += 0.10
        属性.魔法暴击率 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '物理攻击力 +66<br>'
        temp += '魔法攻击力 +66<br>'
        temp += '独立攻击力 +66<br>'
        temp += '攻击速度 +15%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp       

class 装备454():
    名称 = '血舞之牙护腿'
    所属套装 = '杀意决'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':50, '皮甲':92, '轻甲':100, '重甲':96, '板甲':92}	
    智力 = {'布甲':100, '皮甲':92, '轻甲':84, '重甲':84, '板甲':92}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.04)
        属性.物理攻击力 += 121
        属性.魔法攻击力 += 121
        属性.独立攻击力 += 121
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '暴击伤害 +4%<br>'
        temp += '物理攻击力 +121<br>'
        temp += '魔法攻击力 +121<br>'
        temp += '独立攻击力 +121<br>'
        return temp       

class 装备455():
    名称 = '亡灵之帐腰带'
    所属套装 = '杀意决'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':33, '皮甲':58, '轻甲':64, '重甲':61, '板甲':58}	
    智力 = {'布甲':64, '皮甲':58, '轻甲':53, '重甲':53, '板甲':58}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.物理攻击力 += 116
        属性.魔法攻击力 += 116
        属性.独立攻击力 += 116
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '物理攻击力 +116<br>'
        temp += '魔法攻击力 +116<br>'
        temp += '独立攻击力 +116<br>'
        return temp      

class 装备456():
    名称 = '黄泉之风战靴'
    所属套装 = '杀意决'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':33, '皮甲':58, '轻甲':64, '重甲':61, '板甲':58}	
    智力 = {'布甲':64, '皮甲':58, '轻甲':53, '重甲':53, '板甲':58}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(20)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.22
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '所有属性强化 +20<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +22%<br>'
        return temp      

class 装备457(改造产物):
    名称 = '杀戮之决'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    关联套装 = '杀意决[5]'
    def 改造属性(self, 属性, x):
        属性.最终伤害加成(0.02 * x)
        if x >= 1:
            属性.技能等级加成('所有', 50, 50, 3)
            属性.技能等级加成('所有', 85, 85, 3)
            属性.技能等级加成('所有', 100, 100, 1)
            属性.所有属性强化加成(50)
        if x >= 3:
            属性.百分比力智加成(0.13)
            属性.伤害增加加成(0.30)
            属性.暴击伤害加成(0.30)
        if x >= 5:
            属性.最终伤害加成(0.10)
            属性.技能攻击力加成(0.42)
        pass
    def 基础属性(self, 属性):
        属性.百分比三攻加成(0.38)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '百分比三攻 +38%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '最终伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += 'Lv50  技能等级+3<br>'
           temp += 'Lv85  技能等级+3<br>'
           temp += 'Lv100 技能等级+1<br>'
           temp += '所有属性强化 +50<br>'
        if 改造等级 >= 3:
           temp += '百分比力智 +13%<br>'
           temp += '伤害增加 +30%<br>'       
           temp += '暴击伤害 +30%<br>'
        if 改造等级 >= 5:
           temp += '最终伤害 +10%<br>'
           temp += '技能攻击力 +42%<br>'
        return temp     

class 装备458():
    名称 = '逝魔之疾咒长袍'
    所属套装 = '逝魔之力'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.15)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '百分比三攻 +15%<br>'
        return temp      

class 装备459():
    名称 = '逝魔之灵悟肩甲'
    所属套装 = '逝魔之力'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':34, '轻甲':41, '重甲':37, '板甲':34}	
    智力 = {'布甲':41, '皮甲':34, '轻甲':28, '重甲':28, '板甲':34}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.12)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '百分比三攻 +12%<br>'
        return temp

class 装备460():
    名称 = '逝魔之爆裂长裤'
    所属套装 = '逝魔之力'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.爆伤 = max(属性.爆伤, 0.15)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '爆伤 +15%(取最大值)<br>'
        return temp     

class 装备461():
    名称 = '逝魔之灵心腰带'
    所属套装 = '逝魔之力'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.魔法暴击率 += 0.20
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '魔法暴击率 +20%<br>'
        return temp      

class 装备462():
    名称 = '逝魔之风速短靴'
    所属套装 = '逝魔之力'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(20)
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.16
        属性.释放速度 += 0.25
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '所有属性强化 +20<br>'
        temp += '移动速度 +16%<br>'
        temp += '释放速度 +25%<br>'
        return temp   

class 装备463(改造产物):
    名称 = '逝魔之痕'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    关联套装 = '逝魔之力[5]'
    def 改造属性(self, 属性, x):
        属性.暴击伤害加成(0.02 * x)
        if x >= 1:
            属性.百分比力智加成(0.40)
        if x >= 3:
            属性.所有属性强化加成(42)
            属性.伤害增加加成(0.30)
            属性.技能攻击力加成(0.28)
        if x >= 5:
            属性.技能等级加成('所有', 1, 85, 2)
            属性.技能等级加成('所有', 100, 100, 2)
            属性.技能攻击力加成(0.18)
        pass
    def 基础属性(self, 属性):
        属性.最终伤害加成(0.35)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '最终伤害 +35%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '暴击伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '百分比力智 +40%<br>'
        if 改造等级 >= 3:
           temp += '所有属性强化 +42<br>'
           temp += '伤害增加 +30%<br>'
           temp += '技能攻击力 +28%<br>'
        if 改造等级 >= 5:
           temp += 'Lv1-85 技能等级+2<br>'
           temp += 'Lv100  技能等级+2<br>'
           temp += '技能攻击力 +18%<br>'
        return temp       

class 装备464():
    名称 = '封霜雪影长袍'
    所属套装 = '天劫'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.冰属性强化加成(12)
    def 进图属性(self, 属性):
        属性.冰属性强化加成(44 * 天劫减抗)
        pass
    def 其它属性(self, 属性):
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '冰属性强化 +12<br>'
        if 天劫减抗 == 1:
            temp += '冰属性强化 +44<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp      

class 装备465():
    名称 = '蚀日无辉肩甲'
    所属套装 = '天劫'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':34, '轻甲':41, '重甲':37, '板甲':34}	
    智力 = {'布甲':85, '皮甲':78, '轻甲':72, '重甲':72, '板甲':78}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.光属性强化加成(12)
    def 进图属性(self, 属性):
        属性.光属性强化加成(44 * 天劫减抗)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '光属性强化 +12<br>'
        if 天劫减抗 == 1:
            temp += '光属性强化 +44<br>'
        return temp      

class 装备466():
    名称 = '火殒灭炎长裤'
    所属套装 = '天劫'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.火属性强化加成(12)
    def 进图属性(self, 属性):
        属性.火属性强化加成(44 * 天劫减抗)
        pass
    def 其它属性(self, 属性):
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '火属性强化 +12<br>'
        if 天劫减抗 == 1:
            temp += '火属性强化 +44<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp     

class 装备467():
    名称 = '暗殇绝影腰带'
    所属套装 = '天劫'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':75, '皮甲':69, '轻甲':64, '重甲':64, '板甲':69}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.暗属性强化加成(12)
        pass
    def 进图属性(self, 属性):
        属性.暗属性强化加成(44 * 天劫减抗)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '暗属性强化 +12<br>'
        if 天劫减抗 == 1:
            temp += '暗属性强化 +44<br>'
        return temp      

class 装备468():
    名称 = '闲云碎步短靴'
    所属套装 = '天劫'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':75, '皮甲':69, '轻甲':64, '重甲':64, '板甲':69}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(30)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.06
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '所有属性强化 +30<br>'
        temp += '移动速度 +6%<br>'
        return temp      

class 装备469(改造产物):
    名称 = '全元素水晶'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    关联套装 = '天劫[5]'
    def 改造属性(self, 属性, x):
        属性.最终伤害加成(0.02 * x)
        if x >= 1:
            属性.百分比力智加成(0.15)
            属性.属性附加加成(0.35)
        if x >= 3:
            属性.暴击伤害加成(0.20)
            属性.最终伤害加成(0.26)
        if x >= 5:
            属性.技能攻击力加成(0.10)
        pass
    def 基础属性(self, 属性):
        属性.百分比力智加成(0.25)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '百分比力智 +25%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '最终伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '百分比力智 +15%<br>'
           temp += '属性附加 +35%<br>'
        if 改造等级 >= 3:
           temp += '暴击伤害 +20%<br>'
           temp += '最终伤害 +26%<br>'
        if 改造等级 >= 5:
           temp += '技能攻击力 +10%<br>'
        return temp      

class 装备470():
    名称 = '冰雪公主的霜语手镯'
    所属套装 = '冰雪公主的霜语首饰'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 41
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.冰属性强化加成(22)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +41<br>'
        temp += '冰属性强化 +22<br>'
        return temp    

class 装备471():
    名称 = '冰雪公主的霜语项链'
    所属套装 = '冰雪公主的霜语首饰'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 41
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.冰属性强化加成(30)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +41<br>'
        temp += '冰属性强化 +30<br>'
        return temp       

class 装备472():
    名称 = '冰雪公主的霜语戒指'
    所属套装 = '冰雪公主的霜语首饰'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 62
    智力 = 62
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.冰属性强化加成(30)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +62<br>'
        temp += '智力 +62<br>'
        temp += '冰属性强化 +30<br>'
        return temp       

class 装备473(改造产物):
    名称 = '冰雪公主的结晶'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    关联套装 = '冰雪公主的霜语首饰[3]'
    def 改造属性(self, 属性, x):
        属性.暴击伤害加成(0.02 * x)
        if x >= 1:
            属性.伤害增加加成(0.25)
        if x >= 3:
            属性.最终伤害加成(0.28)
            属性.百分比力智加成(0.22)
            属性.技能攻击力加成(0.15)
        if x >= 4:
            属性.最终伤害加成(0.58)
        pass
    def 基础属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '暴击伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '伤害增加 +25%<br>'
        if 改造等级 >= 3:
           temp += '最终伤害 +28%<br>'
           temp += '百分比力智 +22%<br>'
           temp += '技能攻击力 +15%<br>'
        if 改造等级 >= 5:
           temp += '最终伤害 +58%<br>'
        return temp 

class 装备474():
    名称 = '精炼的毁伤魔石手环'
    所属套装 = '精炼的异界魔石首饰'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 96
    智力 = 55
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.07)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +96<br>'
        temp += '智力 +55<br>'
        temp += '技能攻击力 +7%<br>'
        return temp       

class 装备475():
    名称 = '精炼的混沌魔石项链'
    所属套装 = '精炼的异界魔石首饰'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 41
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.黄字 = max(属性.黄字, 0.20)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +41<br>'
        temp += '黄字 +20%(取最高值)<br>'
        return temp     

class 装备476():
    名称 = '精炼的遗忘魔石戒指'
    所属套装 = '精炼的异界魔石首饰'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 62
    智力 = 62
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +62<br>'
        temp += '智力 +62<br>'
        return temp      

class 装备477(改造产物):
    名称 = '扭曲的异界魔石'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    关联套装 = '精炼的异界魔石首饰[3]'
    def 改造属性(self, 属性, x):
        属性.伤害增加加成(0.02 * x)
        if x >= 1:
            属性.暴击伤害加成(0.22)
        if x >= 3:
            属性.百分比三攻加成(0.40)
            属性.伤害增加加成(0.13)
            属性.最终伤害加成(0.20)
        if x >= 4:
            属性.所有属性强化加成(57)
            属性.技能等级加成('所有', 1, 85, 2)
            属性.技能等级加成('所有', 100, 100, 2)
        pass
    def 基础属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '伤害增加 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
            temp += '暴击伤害 +22%<br>'
        if 改造等级 >= 3:
            temp += '百分比三攻 +40%<br>'
            temp += '伤害增加 +13%<br>'
            temp += '最终伤害 +20%<br>'
        if 改造等级 >= 5:
            temp += '所有属性强化 +57<br>'
            temp += 'Lv1-85 技能等级+2<br>'
            temp += 'Lv100  技能等级+2<br>'
        return temp

class 装备478():
    名称 = '感染者臂章'
    所属套装 = '无'
    模式 = 1
    等级 = 90
    品质 = '传说'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 41
    智力 = 41
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        if 属性.职业 == '街霸':
            for i in 属性.技能栏:
                if i.是否有伤害 == 1:
                    i.中毒倍率 += 0.5
                    if 属性.角色 == '格斗家(男)':
                        i.感电倍率 += 0.5
                    else:
                        i.涂毒倍率 += 0.5
                    i.出血倍率 += 0.5
                    i.灼伤倍率 += 0.5
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +41<br>'
        temp += '智力 +41<br>'
        temp += '中毒、涂毒伤害 +50%<br>'
        temp += '感电伤害 +50%<br>'
        temp += '出血伤害 +50%<br>'
        temp += '灼伤伤害 +50%<br>'
        return temp

#endregion

#region 100光环传说
class 装备479():
    名称 = '轮回·先贤的馈赠手镯'
    模式 = 1
    所属套装 = '智慧产物'
    所属套装2 = '先贤的馈赠'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.16)
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        属性.力量 += 25 * 属性.获取改造(self.部位)
        属性.智力 += 25 * 属性.获取改造(self.部位)
        属性.技能攻击力加成(0.02 * 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +28<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '力量 +' + str(25 * 改造等级) + '<br>'
            temp += '智力 +' + str(25 * 改造等级) + '<br>'
            temp += '技能攻击力 +' + str(2 * 改造等级) + '%<br>'
        return temp      

class 装备480():
    名称 = '时空：先贤的馈赠手镯'
    模式 = 1
    所属套装 = '先贤的馈赠'
    等级 = 100
    品质 = '传说'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 46
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.16)
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +46<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +28<br>'
        return temp      

class 装备481():
    名称 = '先贤的馈赠项链'
    模式 = 1
    所属套装 = '先贤的馈赠'
    等级 = 100
    品质 = '传说'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 46
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.20)
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +46<br>'
        temp += '百分比三攻 +20%<br>'
        temp += '所有属性强化 +28<br>'
        return temp       

class 装备482():
    名称 = '先贤的馈赠戒指'
    模式 = 1
    所属套装 = '先贤的馈赠'
    等级 = 100
    品质 = '传说'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 68
    智力 = 68
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.16)
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +68<br>'
        temp += '智力 +68<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +28<br>'
        return temp      

class 装备483():
    名称 = '轮回·鲜红血纹皮甲胸铠'
    模式 = 1
    所属套装 = '智慧产物'
    所属套装2 = '鲜红血纹'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.20)
        属性.暴击伤害加成(0.15)
        pass
    def 进图属性(self, 属性):
        属性.力量 += 25 * 属性.获取改造(self.部位)
        属性.智力 += 25 * 属性.获取改造(self.部位)
        属性.技能攻击力加成(0.02 * 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +20%<br>'
        temp += '暴击伤害 +15%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '力量 +' + str(25 * 改造等级) + '<br>'
            temp += '智力 +' + str(25 * 改造等级) + '<br>'
            temp += '技能攻击力 +' + str(2 * 改造等级) + '%<br>'
        return temp      

class 装备484():
    名称 = '时空：鲜红血纹皮甲胸铠'
    模式 = 1
    所属套装 = '鲜红血纹'
    等级 = 100
    品质 = '传说'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':47, '轻甲':57, '重甲':52, '板甲':47}
    智力 = {'布甲':57, '皮甲':47, '轻甲':37, '重甲':37, '板甲':47}
    类型 = '皮甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.14)
        属性.暴击伤害加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +14%<br>'
        temp += '暴击伤害 +15%<br>'
        return temp  

class 装备485():
    名称 = '鲜红血纹皮甲护肩'
    模式 = 1
    所属套装 = '鲜红血纹'
    等级 = 100
    品质 = '传说'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':39, '轻甲':45, '重甲':42, '板甲':39}
    智力 = {'布甲':45, '皮甲':39, '轻甲':31, '重甲':31, '板甲':39}
    类型 = '皮甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.05)
        属性.百分比三攻加成(0.04)
        属性.百分比力智加成(0.12)
        属性.所有属性强化加成(10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +5%<br>'
        temp += '百分比三攻 +4%<br>'
        temp += '百分比力智 +12%<br>'
        temp += '所有属性强化 +10<br>'
        return temp    

class 装备486():
    名称 = '鲜红血纹皮甲护腿'
    模式 = 1
    所属套装 = '鲜红血纹'
    等级 = 100
    品质 = '传说'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':47, '轻甲':57, '重甲':52, '板甲':47}
    智力 = {'布甲':57, '皮甲':47, '轻甲':37, '重甲':37, '板甲':47}
    类型 = '皮甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.09)
        属性.暴击伤害加成(0.15)
        属性.所有属性强化加成(14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +9%<br>'
        temp += '暴击伤害 +15%<br>'
        temp += '所有属性强化 +14<br>'
        return temp    

class 装备487():
    名称 = '鲜红血纹皮甲腰带'
    模式 = 1
    所属套装 = '鲜红血纹'
    等级 = 100
    品质 = '传说'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':29, '轻甲':34, '重甲':31, '板甲':29}
    智力 = {'布甲':34, '皮甲':29, '轻甲':23, '重甲':23, '板甲':29}
    类型 = '皮甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.05)
        属性.百分比三攻加成(0.04)
        属性.百分比力智加成(0.12)
        属性.所有属性强化加成(10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +5%<br>'
        temp += '百分比三攻 +4%<br>'
        temp += '百分比力智 +12%<br>'
        temp += '所有属性强化 +10<br>'
        return temp   

class 装备488():
    名称 = '鲜红血纹皮甲战靴'
    模式 = 1
    所属套装 = '鲜红血纹'
    等级 = 100
    品质 = '传说'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':29, '轻甲':34, '重甲':31, '板甲':29}
    智力 = {'布甲':34, '皮甲':29, '轻甲':23, '重甲':23, '板甲':29}
    类型 = '皮甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.05)
        属性.百分比三攻加成(0.04)
        属性.百分比力智加成(0.12)
        属性.所有属性强化加成(10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +5%<br>'
        temp += '百分比三攻 +4%<br>'
        temp += '百分比力智 +12%<br>'
        temp += '所有属性强化 +10<br>'
        temp += '移动速度 +4%<br>'
        return temp
class 装备489():
    名称 = '先贤的馈赠手镯'
    模式 = 1
    所属套装 = '先贤的馈赠'
    等级 = 100
    品质 = '传说'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 46
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.16)
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +46<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +28<br>'
        return temp
class 装备490():
    名称 = '鲜红血纹皮甲胸铠'
    模式 = 1
    所属套装 = '鲜红血纹'
    等级 = 100
    品质 = '传说'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':47, '轻甲':57, '重甲':52, '板甲':47}
    智力 = {'布甲':57, '皮甲':47, '轻甲':37, '重甲':37, '板甲':47}
    类型 = '皮甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.09)
        属性.暴击伤害加成(0.15)
        属性.所有属性强化加成(14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +9%<br>'
        temp += '暴击伤害 +15%<br>'
        temp += '所有属性强化 +14<br>'
        return temp
#endregion

#region  防具套装
class 套装效果0():
    名称 = '遗忘魔法师的馈赠'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.14)
        属性.技能攻击力加成(0.14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '最终伤害 +14%<br>'
        temp += '技能攻击力 +14%<br>'
        return temp     

class 套装效果1():
    名称 = '死亡阴影'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.14)
        属性.所有属性强化加成(55)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.10
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +14%<br>'
        temp += '所有属性强化 +55<br>'
        temp += '攻击速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        return temp    

class 套装效果2():
    名称 = '贫瘠沙漠的遗产'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.22)
        if 属性.贫瘠沙漠的遗产 != 0:
            属性.技能攻击力加成(0 + 属性.技能栏空位 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +22%<br>'
        if 属性.贫瘠沙漠的遗产 != 0:
            temp += '技能攻击力 +' +str(属性.技能栏空位) +'%<br>'
        return temp  

class 套装效果3():
    名称 = '噩梦：地狱之路'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.16)
        属性.最终伤害加成(0.06)
        属性.技能攻击力加成(0.06)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +16%<br>'
        temp += '最终伤害 +6%<br>'
        temp += '技能攻击力 +6%<br>'
        return temp     

class 套装效果4():
    名称 = '永恒不息之路'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.32)
        属性.技能倍率加成(60, 0.20)
        属性.技能冷却缩减(60, 60, -0.30)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +32%<br>'
        temp += 'Lv60技能：<br>攻击力 +20% CD +30%<br>'
        return temp       

class 套装效果5():
    名称 = '天堂舞姬'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.17)
        属性.最终伤害加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +17%<br>'
        temp += '最终伤害 +10%<br>'
        return temp     

class 套装效果6():
    名称 = '皇家裁决者宣言'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.16)
        属性.所有属性强化加成(52)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.命中率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +16%<br>'
        temp += '所有属性强化 +52<br>'
        temp += '命中率 +5%<br>'
        return temp    

class 套装效果7():
    名称 = '炙炎之盛宴'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.18)
        属性.所有属性强化加成(40)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +18%<br>'
        temp += '所有属性强化 +40<br>'
        return temp  

class 套装效果8():
    名称 = '传奇铁匠-封神'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.14)
        属性.最终伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +14%<br>'
        temp += '最终伤害 +14%<br>'
        return temp     

class 套装效果9():
    名称 = '命运歧路'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.15)
        属性.附加伤害加成(0.13)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +15%<br>'
        temp += '附加伤害 +13%<br>'
        return temp   

class 套装效果10():
    名称 = '古代祭祀的神圣仪式'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.08)
        属性.伤害增加加成(0.21)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.回避率 += 0.06
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +8%<br>'
        temp += '伤害增加 +21%<br>'
        temp += '回避率 +6%<br>'
        return temp      

class 套装效果11():
    名称 = '龙血玄黄'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.23)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.1
        属性.魔法暴击率 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +23%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp    

class 套装效果12():
    名称 = '擎天战甲'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.14)
        属性.暴击伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +14%<br>'
        temp += '暴击伤害 +14%<br>'
        return temp      

class 套装效果13():
    名称 = '荆棘漫天'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.12)
        属性.暴击伤害加成(0.11)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.10
        属性.魔法暴击率 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +12%<br>'
        temp += '暴击伤害 +11%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp

class 套装效果14():
    名称 = '大自然的呼吸'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.16)
        属性.暴击伤害加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +16%<br>'
        temp += '暴击伤害 +15%<br>'
        return temp     

class 套装效果15():
    名称 = '遗忘魔法师的馈赠'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.22)
        属性.暴击伤害加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +22%<br>'
        temp += '暴击伤害 +10%<br>'
        return temp      

class 套装效果16():
    名称 = '死亡阴影'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.14)
        属性.技能攻击力加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '最终伤害 +14%<br>'
        temp += '技能攻击力 +16%<br>'
        return temp

class 套装效果17():
    名称 = '贫瘠沙漠的遗产'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.15)
        属性.所有属性强化加成(60)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '技能攻击力 +15%<br>'
        temp += '所有属性强化 +60<br>'
        return temp

class 套装效果18():
    名称 = '噩梦：地狱之路'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(66)
        属性.技能等级加成('所有', 1, 85, 1) 
        属性.技能等级加成('所有', 100, 100, 1) 
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '所有属性强化 +66<br>'
        temp += 'Lv1-85 技能等级+1<br>'
        temp += 'Lv100  技能等级+1<br>'
        return temp    

class 套装效果19():
    名称 = '永恒不息之路'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.32)
        属性.技能倍率加成(70, 0.20)
        属性.技能冷却缩减(70, 70, -0.30)    
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '最终伤害 +32%<br>'
        temp += 'Lv70技能：<br>攻击力 +20% CD +30%<br>'
        return temp     

class 套装效果20():
    名称 = '天堂舞姬'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.11)
        属性.伤害增加加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.10
        属性.移动速度 += 0.10
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +11%<br>'
        temp += '伤害增加 +16%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        return temp     

class 套装效果21():
    名称 = '皇家裁决者宣言'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.15)
        属性.所有属性强化加成(62)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.移动速度 += 0.05
        属性.释放速度 += 0.08
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +15%<br>'
        temp += '所有属性强化 +62<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +5%<br>'
        temp += '释放速度 +8%<br>'
        return temp  

class 套装效果22():
    名称 = '炙炎之盛宴'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.10)
        属性.技能攻击力加成(0.20)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +10%<br>'
        temp += '技能攻击力 +20%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp    

class 套装效果23():
    名称 = '传奇铁匠-封神'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.21)
        if 属性.装备检查('天堂之翼'):
            属性.技能冷却缩减(1, 45, 0.30)
            属性.技能冷却缩减(60, 80, 0.30)
        else:
            属性.技能冷却缩减(1, 45, 0.20)
            属性.技能冷却缩减(60, 80, 0.20)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +21%<br>'
        if 属性.装备检查('天堂之翼'):
            temp += 'Lv1-45  技能CD-30%<br>'
            temp += 'Lv60-80 技能CD-30%<br>'
        else:
            temp += 'Lv1-45  技能CD-20%<br>'
            temp += 'Lv60-80 技能CD-20%<br>'
        return temp    

class 套装效果24():
    名称 = '命运歧路'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.12)
        属性.暴击伤害加成(0.17)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.21
        属性.移动速度 += 0.21
        属性.释放速度 += 0.315  
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +12%<br>'
        temp += '暴击伤害 +17%<br>'
        temp += '攻击速度 +21%<br>'
        temp += '移动速度 +21%<br>'
        temp += '释放速度 +31.5%<br>'
        return temp   

class 套装效果25():
    名称 = '古代祭祀的神圣仪式'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.08)
        属性.附加伤害加成(0.21)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +8%<br>'
        temp += '附加伤害 +21%<br>'
        return temp 

class 套装效果26():
    名称 = '龙血玄黄'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.24)
        属性.所有属性强化加成(24)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +24%<br>'
        temp += '所有属性强化 +24<br>'
        return temp    

class 套装效果27():
    名称 = '擎天战甲'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.32)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +32%<br>'
        return temp     

class 套装效果28():
    名称 = '荆棘漫天'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.25)
        属性.技能冷却缩减(1, 45, 0.15)
        属性.技能冷却缩减(60, 80, 0.15)
        属性.技能冷却缩减(90, 95, 0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +25%<br>'
        temp += 'Lv1-45  技能CD-15%<br>'
        temp += 'Lv60-80 技能CD-15%<br>'
        temp += 'Lv90-95 技能CD-15%<br>'
        return temp 

class 套装效果29():
    名称 = '大自然的呼吸'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.15)
        属性.技能攻击力加成(0.13)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.移动速度 += 0.05
        属性.释放速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +15%<br>'
        temp += '技能攻击力 +13%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +5%<br>'
        temp += '释放速度 +10%<br>'
        return temp      

class 套装效果30():
    名称 = '遗忘魔法师的馈赠'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.13)
        属性.技能等级加成('所有', 1, 85, 2)
        属性.技能等级加成('所有', 100, 100, 2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +13%<br>'
        temp += 'Lv1-85 技能等级+2<br>'
        temp += 'Lv100  技能等级+2<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp   

class 套装效果31():
    名称 = '死亡阴影'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.46)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '技能攻击力 +46%<br>'
        return temp
class 套装效果32():
    名称 = '贫瘠沙漠的遗产'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.42)
        if 属性.贫瘠沙漠的遗产 == 2:
            属性.技能攻击力加成(0.04)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '技能攻击力 +42%<br>'
        if 属性.贫瘠沙漠的遗产 == 2:
            temp += '技能攻击力 +4%<br>'
        return temp      

class 套装效果33():
    名称 = '噩梦：地狱之路'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.46)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '技能攻击力 +46%<br>'
        return temp    

class 套装效果34():
    名称 = '永恒不息之路'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.23)
        属性.伤害增加加成(0.20)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.释放速度 += 0.225
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +23%<br>'
        temp += '伤害增加 +20%<br>'
        temp += '攻击速度 +15%<br>'
        temp += '释放速度 +22.5%<br>'
        return temp       

class 套装效果35():
    名称 = '天堂舞姬'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.12)
        属性.技能攻击力加成(0.20)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.10
        属性.魔法暴击率 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +12%<br>'
        temp += '技能攻击力 +20%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp 

class 套装效果36():
    名称 = '皇家裁决者宣言'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.属性附加加成(0.20)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '属性附加 +20%<br>'
        return temp  

class 套装效果37():
    名称 = '炙炎之盛宴'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.22)
        属性.技能冷却缩减(1, 100, 0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.攻击速度 += 0.05
        属性.移动速度 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '最终伤害 +22%<br>'
        temp += 'Lv1-100 技能CD-15%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +5%<br>'
        return temp
      

class 套装效果38():
    名称 = '传奇铁匠-封神'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.27)
        属性.技能冷却缩减(50, 50, 0.30)
        属性.技能冷却缩减(85, 85, 0.30)
        属性.技能冷却缩减(100, 100, 0.17)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        属性.释放速度 += 0.20
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +27%<br>'
        temp += 'Lv50  技能CD-30%<br>'
        temp += 'Lv85  技能CD-30%<br>'
        temp += 'Lv100 技能CD-17%<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        temp += '释放速度 +20%<br>'
        return temp    

class 套装效果39():
    名称 = '命运歧路'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.11)
        属性.最终伤害加成(0.30)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +11%<br>'
        temp += '最终伤害 +30%<br>'
        return temp

class 套装效果40():
    名称 = '古代祭祀的神圣仪式'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.21)
        属性.技能攻击力加成(0.25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +21%<br>'
        temp += '技能攻击力 +25%<br>'
        return temp     

class 套装效果41():
    名称 = '龙血玄黄'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            属性.附加伤害加成(0.41)
        else:
            属性.附加伤害加成(0.40)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        属性.释放速度 += 0.225
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            temp += '附加伤害 +41%<br>'
        else:
            temp += '附加伤害 +40%<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        temp += '释放速度 +22.5%<br>'
        return temp 

class 套装效果42():
    名称 = '擎天战甲'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.属性附加加成(0.12)
        if 属性.擎天战甲 == 0:
            属性.技能攻击力加成(0.05)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.擎天战甲 == 0:
            属性.攻击速度 += 0.2
            属性.移动速度 += 0.2
            属性.释放速度 += 0.3
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '属性附加 +12%<br>'
        if 属性.擎天战甲 == 0:
            temp += '技能攻击力 +5%<br>'
            temp += '攻击速度 +20%<br>'
            temp += '移动速度 +20%<br>'
            temp += '释放速度 +30%<br>'
        return temp      

class 套装效果43():
    名称 = '荆棘漫天'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.10)
        属性.技能攻击力加成(0.28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.移动速度 += -0.02
        属性.释放速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +10%<br>'
        temp += '技能攻击力 +28%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 -2%<br>'
        temp += '释放速度 +10%<br>'
        return temp       

class 套装效果44():
    名称 = '大自然的呼吸'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.11)
        属性.技能攻击力加成(0.10)
        属性.所有属性强化加成(64)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.10
        属性.魔法暴击率 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '最终伤害 +11%<br>'
        temp += '技能攻击力 +10%<br>'
        temp += '所有属性强化 +64<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp
#endregion

#region  散搭套装
class 套装效果45():
    名称 = '深渊窥视者'
    件数 = 2
    类型 = '上链左'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.09)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 1, 48, 2)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +9%<br>'
        temp += 'Lv1-48 技能等级+2<br>'
        return temp    

class 套装效果46():
    名称 = '圣者的黄昏'
    件数 = 2
    类型 = '上链左'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.11)
        属性.附加伤害加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +11%<br>'
        temp += '附加伤害 +10%<br>'
        temp += '移动速度 +5%<br>'
        return temp     

class 套装效果47():
    名称 = '坎坷命运'
    件数 = 2
    类型 = '上链左'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.14)
        属性.技能攻击力加成(0.09)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.03
        属性.移动速度 += 0.03
        属性.释放速度 += 0.045
        if 属性.装备检查('地狱边缘'):
            属性.攻击速度 -= 0.01
            属性.移动速度 -= 0.01
            属性.释放速度 -= 0.015
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +14%<br>'
        temp += '技能攻击力 +9%<br>'
        temp += '攻击速度 +3%<br>'
        temp += '移动速度 +3%<br>'
        temp += '释放速度 +4.5%<br>'
        if 属性.装备检查('地狱边缘'):
            temp += '攻击速度 -1%<br>'
            temp += '移动速度 -1%<br>'
            temp += '释放速度 -1.5%<br>'
        return temp    

class 套装效果48():
    名称 = '吞噬愤怒'
    件数 = 2
    类型 = '上链左'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.10)
        属性.暴击伤害加成(0.11)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('灭世之怒'):
            属性.攻击速度 += 0.15
            属性.移动速度 += 0.15
            属性.释放速度 += 0.225
        else:
            属性.攻击速度 += 0.10
            属性.移动速度 += 0.10
            属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +10%<br>'
        temp += '暴击伤害 +11%<br>'
        if 属性.装备检查('灭世之怒'):
            temp += '攻击速度 +15%<br>'
            temp += '移动速度 +15%<br>'
            temp += '释放速度 +22.5%<br>'
        else:
            temp += '攻击速度 +10%<br>'
            temp += '移动速度 +10%<br>'
            temp += '释放速度 +15%<br>'
        return temp   

class 套装效果49():
    名称 = '黑魔法探求者'
    件数 = 2
    类型 = '镯下右'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.12)
        属性.技能攻击力加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +12%<br>'
        temp += '技能攻击力 +10%<br>'
        return temp        

class 套装效果50():
    名称 = '时空旅行者'
    件数 = 2
    类型 = '镯下右'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.10)
        属性.最终伤害加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +10%<br>'
        temp += '最终伤害 +10%<br>'
        return temp

class 套装效果51():
    名称 = '穿透命运的呐喊'
    件数 = 2
    类型 = '镯下右'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.23)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +23%<br>'
        return temp    

class 套装效果52():
    名称 = '狂乱追随者'
    件数 = 2
    类型 = '镯下右'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.18)
        属性.所有属性强化加成(25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.释放速度 += 0.225
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +18%<br>'
        temp += '所有属性强化 +25<br>'
        temp += '攻击速度 +15%<br>'
        temp += '释放速度 +22.5%<br>'
        return temp  

class 套装效果53():
    名称 = '地狱求道者'
    件数 = 2
    类型 = '环鞋指'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.10)
        属性.最终伤害加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +10%<br>'
        temp += '最终伤害 +10%<br>'
        return temp 

class 套装效果54():
    名称 = '次元旅行者'
    件数 = 2
    类型 = '环鞋指'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.22)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.10
        属性.魔法暴击率 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +22%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp

class 套装效果55():
    名称 = '天命无常'
    件数 = 2
    类型 = '环鞋指'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.07)
        属性.附加伤害加成(0.08)
        属性.技能攻击力加成(0.05)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.天命无常 == 0:
            if 属性.装备检查('命运反抗者'):
                属性.移动速度 += 0.08
                属性.攻击速度 += 0.08
                属性.释放速度 += 0.12
            else:
                属性.移动速度 += 0.07
                属性.攻击速度 += 0.07
                属性.释放速度 += 0.105
        else:
            属性.移动速度 += 0.02 * 属性.天命无常
            属性.攻击速度 += 0.02 * 属性.天命无常
            属性.释放速度 += 0.03 * 属性.天命无常
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +7%<br>'
        temp += '附加伤害 +8%<br>'
        temp += '技能攻击力 +5%<br>'
        if 属性.天命无常 == 0:
            if 属性.装备检查('命运反抗者'):
                temp += '移动速度 +8%<br>'
                temp += '攻击速度 +8%<br>'
                temp += '释放速度 +12%<br>'
            else:
                temp += '移动速度 +7%<br>'
                temp += '攻击速度 +7%<br>'
                temp += '释放速度 +10.5%<br>'
        else:
            temp += '移动速度 +' +str(2*属性.天命无常) +'%<br>'
            temp += '攻击速度 +' +str(2*属性.天命无常) +'%<br>'
            temp += '释放速度 +' +str(3*属性.天命无常) +'%<br>'
        return temp     

class 套装效果56():
    名称 = '悲剧的残骸'
    件数 = 2
    类型 = '环鞋指'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.23)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '最终伤害 +23%<br>'
        return temp
     

class 套装效果57():
    名称 = '深渊窥视者'
    件数 = 3
    类型 = '上链左'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.13)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 60, 80, 2)
        属性.技能等级加成('所有', 50, 50, 1)
        属性.技能等级加成('所有', 85, 85, 1)
        属性.技能等级加成('所有', 100, 100, 1)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '技能攻击力 +13%<br>'
        temp += 'Lv60-80 技能等级+2<br>'
        temp += 'Lv50  技能等级+1<br>'
        temp += 'Lv85  技能等级+1<br>'
        temp += 'Lv100 技能等级+1<br>'
        return temp       

class 套装效果58():
    名称 = '圣者的黄昏'
    件数 = 3
    类型 = '上链左'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.05)
        属性.技能攻击力加成(0.12)
        属性.所有属性强化加成(32)
        属性.技能冷却缩减(1, 45, 0.10)
        属性.技能冷却缩减(60, 80, 0.10)
        属性.技能冷却缩减(90, 95, 0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.05
        属性.物理暴击率 += 0.15
        属性.魔法暴击率 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +5%<br>'
        temp += '技能攻击力 +12%<br>'
        temp += '所有属性强化 +32<br>'
        temp += 'Lv1-45  技能CD-10%<br>'
        temp += 'Lv60-80 技能CD-10%<br>'
        temp += 'Lv90-95 技能CD-10%<br>'
        temp += '移动速度 +5%<br>'
        temp += '物理暴击率 +15%<br>'
        temp += '魔法暴击率 +15%<br>'
        return temp      

class 套装效果59():
    名称 = '坎坷命运'
    件数 = 3
    类型 = '上链左'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.20)
        属性.技能攻击力加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.03
        属性.移动速度 += 0.03
        属性.释放速度 += 0.045
        if 属性.装备检查('地狱边缘'):
            属性.攻击速度 -= 0.01
            属性.移动速度 -= 0.01
            属性.释放速度 -= 0.015
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +20%<br>'
        temp += '技能攻击力 +10%<br>'
        temp += '攻击速度 +3%<br>'
        temp += '移动速度 +3%<br>'
        temp += '释放速度 +4.5%<br>'
        if 属性.装备检查('地狱边缘'):
            temp += '攻击速度 -1%<br>'
            temp += '移动速度 -1%<br>'
            temp += '释放速度 -1.5%<br>'
        return temp     

class 套装效果60():
    名称 = '吞噬愤怒'
    件数 = 3
    类型 = '上链左'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.30)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +30%<br>'
        return temp     

class 套装效果61():
    名称 = '黑魔法探求者'
    件数 = 3
    类型 = '镯下右'
    def 城镇属性(self, 属性):
        属性.属性附加加成(0.13)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.10
        属性.魔法暴击率 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '属性附加 +13%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp       

class 套装效果62():
    名称 = '时空旅行者'
    件数 = 3
    类型 = '镯下右'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.17)
        属性.技能攻击力加成(0.13)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +17%<br>'
        temp += '技能攻击力 +13%<br>'
        return temp    

class 套装效果63():
    名称 = '穿透命运的呐喊'
    件数 = 3
    类型 = '镯下右'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.14)
        属性.技能攻击力加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +14%<br>'
        temp += '技能攻击力 +16%<br>'
        return temp

class 套装效果64():
    名称 = '狂乱追随者'
    件数 = 3
    类型 = '镯下右'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.16)
        属性.技能攻击力加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +16%<br>'
        temp += '技能攻击力 +15%<br>'
        return temp     

class 套装效果65():
    名称 = '地狱求道者'
    件数 = 3
    类型 = '环鞋指'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.16)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        属性.释放速度 += 0.20
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +40<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        temp += '释放速度 +20%<br>'
        return temp

class 套装效果66():
    名称 = '次元旅行者'
    件数 = 3
    类型 = '环鞋指'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.10)
        属性.技能攻击力加成(0.18)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +10%<br>'
        temp += '技能攻击力 +18%<br>'
        return temp     

class 套装效果67():
    名称 = '天命无常'
    件数 = 3
    类型 = '环鞋指'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.10)
        属性.技能攻击力加成(0.07)
        属性.百分比力智加成(0.07)
        if 属性.天命无常 == 0:
            if 属性.装备检查('命运反抗者'):
                属性.百分比力智加成(0.056)
            else:
                属性.百分比力智加成(0.046666667)
        if 属性.天命无常 == 4 or 属性.天命无常 == 5:
            属性.百分比力智加成(0.07)
        if 属性.天命无常 == 6:
            属性.百分比力智加成(0.14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.天命无常 == 0:
            if 属性.装备检查('命运反抗者'):
                属性.移动速度 += 0.066
                属性.攻击速度 += 0.066
            else:
                属性.移动速度 += 0.055
                属性.攻击速度 += 0.055 
        if 属性.天命无常 >= 4:
            属性.移动速度 += 0.03 * 属性.天命无常
            属性.攻击速度 += 0.03 * 属性.天命无常
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +10%<br>'
        temp += '技能攻击力 +7%<br>'
        temp += '百分比力智 +7%<br>'
        if 属性.天命无常 == 0:
            if 属性.装备检查('命运反抗者'):
                temp += '百分比力智 +5.6%<br>'
                temp += '移动速度 +6.6%<br>'
                temp += '攻击速度 +6.6%<br>'
            else:
                temp += '移动速度 +5.5%<br>'
                temp += '攻击速度 +5.5%<br>'
                temp += '百分比力智 +4.6666667%<br>'
        if 属性.天命无常 == 4 or 属性.天命无常 == 5:
            temp += '百分比力智 +7%<br>'
            temp += '移动速度 +' +str(3 * 属性.天命无常) +'%<br>'
            temp += '攻击速度 +' +str(3 * 属性.天命无常) +'%<br>'
        if 属性.天命无常 == 6:
            temp += '百分比力智 +14%<br>'
            temp += '移动速度 +' +str(3 * 属性.天命无常) +'%<br>'
            temp += '攻击速度 +' +str(3 * 属性.天命无常) +'%<br>'
        return temp     

class 套装效果68():
    名称 = '悲剧的残骸'
    件数 = 3
    类型 = '环鞋指'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.29)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +29%<br>'
        return temp

#endregion

#region  首饰套装
class 套装效果69():
    名称 = '上古尘封术士'
    件数 = 2
    类型 = '首饰'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.10)
        属性.百分比三攻加成(0.14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +10%<br>'
        temp += '百分比三攻 +14%<br>'
        return temp   

class 套装效果70():
    名称 = '破晓曦光'
    件数 = 2
    类型 = '首饰'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.10)
        属性.最终伤害加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +10%<br>'
        temp += '最终伤害 +10%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp


class 套装效果71():
    名称 = '幸运三角'
    件数 = 2
    类型 = '首饰'
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(77)
        属性.物理攻击力 += 77
        属性.魔法攻击力 += 77
        属性.独立攻击力 += 77
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.07
        属性.魔法暴击率 += 0.07
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '所有属性强化 +77<br>'
        temp += '物理暴击率 +7%<br>'
        temp += '魔法暴击率 +7%<br>'
        return temp
    

class 套装效果72():
    名称 = '精灵使的权能'
    件数 = 2
    类型 = '首饰'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.10)
        属性.技能攻击力加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +10%<br>'
        temp += '技能攻击力 +12%<br>'
        return temp   

class 套装效果73():
    名称 = '上古尘封术士'
    件数 = 3
    类型 = '首饰'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.20)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +20%<br>'
        return temp


class 套装效果74():
    名称 = '破晓曦光'
    件数 = 3
    类型 = '首饰'
    def 城镇属性(self, 属性):
        属性.属性附加加成(0.10)
        属性.技能等级加成('所有', 100, 100, 1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.10
        属性.移动速度 += 0.10
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '属性附加 +10%<br>'
        temp += 'Lv100 技能等级+1<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        return temp    

class 套装效果75():
    名称 = '幸运三角'
    件数 = 3
    类型 = '首饰'
    def 城镇属性(self, 属性):
        if 属性.幸运三角 == 0:
            属性.技能攻击力加成(0.2915)
        elif 属性.幸运三角 == 1:
           属性.技能攻击力加成(0.27)
        elif 属性.幸运三角 == 2:
            属性.技能攻击力加成(0.31)
        elif 属性.幸运三角 == 3:
            属性.技能攻击力加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.幸运三角 == 0:
            属性.攻击速度 += 0.005
            属性.移动速度 += 0.005
            属性.释放速度 += 0.0075
        if 属性.幸运三角 == 3:
            属性.攻击速度 += 0.10
            属性.移动速度 += 0.10
            属性.释放速度 += 0.15  
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.幸运三角 == 0:
            temp += '技能攻击力 +29.15%<br>'
            temp += '攻击速度 +0.5%<br>'
            temp += '移动速度 +0.5%<br>'
            temp += '释放速度 +0.75%<br>'
        if 属性.幸运三角 == 1:
            temp += '技能攻击力 +27%<br>'
        if 属性.幸运三角 == 2:
            temp += '技能攻击力 +31%<br>'
        if 属性.幸运三角 == 3:
            temp += '技能攻击力 +34%<br>'
            temp += '攻击速度 +10%<br>'
            temp += '移动速度 +10%<br>'
            temp += '释放速度 +15%<br>'
        return temp       

class 套装效果76():
    名称 = '精灵使的权能'
    件数 = 3
    类型 = '首饰'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.10)
        属性.技能冷却缩减(1, 100, 0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +10%<br>'
        temp += 'Lv1-100 技能CD-10%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp
#endregion

#region  特殊套装
class 套装效果77():
    名称 = '军神的隐秘遗产'
    件数 = 2
    类型 = '特殊'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.10)
        属性.最终伤害加成(0.08)
        if 属性.装备检查('军神的遗书'):
            if 属性.装备检查('军神的心之所念'):
                属性.暴击伤害加成(0.05)
            if 属性.装备检查('军神的古怪耳环'):
                属性.暴击伤害加成(0.05)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('军神的遗书'):
            if 属性.装备检查('军神的心之所念'):
                属性.攻击速度 += 0.05
                属性.移动速度 += 0.10
                属性.释放速度 += 0.075
            if 属性.装备检查('军神的古怪耳环'):
                属性.移动速度 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +10%<br>'
        temp += '最终伤害 +8%<br>'
        if 属性.装备检查('军神的遗书'):
            if 属性.装备检查('军神的心之所念'):
                temp += '暴击伤害 +5%<br>'
                temp += '攻击速度 +5%<br>'
                temp += '移动速度 +10%<br>'
                temp += '释放速度 +7.5%<br>'
            if 属性.装备检查('军神的古怪耳环'):
                temp += '暴击伤害 +5%<br>'
                temp += '移动速度 +5%<br>'
        return temp     

class 套装效果78():
    名称 = '时间战争的残骸'
    件数 = 2
    类型 = '特殊'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.11)
        属性.暴击伤害加成(0.11)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +11%<br>'
        temp += '暴击伤害 +11%<br>'
        return temp    

class 套装效果79():
    名称 = '灵宝：世间真理'
    件数 = 2
    类型 = '特殊'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.15)
        属性.技能攻击力加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +15%<br>'
        temp += '技能攻击力 +7%<br>'
        return temp
class 套装效果80():
    名称 = '能量主宰'
    件数 = 2
    类型 = '特殊'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.12)
        属性.伤害增加加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +12%<br>'
        temp += '伤害增加 +12%<br>'
        return temp  

class 套装效果81():
    名称 = '军神的隐秘遗产'
    件数 = 3
    类型 = '特殊'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.10)
        if 属性.军神的隐秘遗产 == 0:
            属性.百分比力智加成(0.10)
        if 属性.军神的隐秘遗产 == 1:
            属性.百分比力智加成(0.10)
        if 属性.军神的隐秘遗产 == 2:
            属性.百分比力智加成(0.08)
        if 属性.军神的隐秘遗产 == 3:
            属性.百分比力智加成(0.06)
        if 属性.军神的隐秘遗产 == 4:
            属性.百分比力智加成(0.04)
        if 属性.军神的隐秘遗产 == 5:
            属性.百分比力智加成(0.02)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.军神的隐秘遗产 == 0:
            属性.攻击速度 += 0.10
            属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '技能攻击力 +10%<br>'
        if 属性.军神的隐秘遗产 == 0:
            temp += '百分比力智 +10%<br>'
        if 属性.军神的隐秘遗产 == 1:
            temp += '百分比力智 +10%<br>'
        if 属性.军神的隐秘遗产 == 2:
            temp += '百分比力智 +8%<br>'
        if 属性.军神的隐秘遗产 == 3:
            temp += '百分比力智 +6%<br>'
        if 属性.军神的隐秘遗产 == 4:
            temp += '百分比力智 +4%<br>'
        if 属性.军神的隐秘遗产 == 5:
            temp += '百分比力智 +2%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        return temp      

class 套装效果82():
    名称 = '时间战争的残骸'
    件数 = 3
    类型 = '特殊'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.10)
        属性.技能攻击力加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +10%<br>'
        temp += '技能攻击力 +10%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp
      

class 套装效果83():
    名称 = '灵宝：世间真理'
    件数 = 3
    类型 = '特殊'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 1, 85, 1)
        属性.技能等级加成('所有', 100, 100, 1)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.10
        属性.移动速度 += 0.10
        属性.释放速度 += 0.15
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +12%<br>'
        temp += 'Lv1-85 技能等级+1<br>'
        temp += 'Lv100  技能等级+1<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp   

class 套装效果84():
    名称 = '能量主宰'
    件数 = 3
    类型 = '特殊'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.10)
        属性.技能攻击力加成(0.08)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.10
        属性.魔法暴击率 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +10%<br>'
        temp += '技能攻击力 +8%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp
#endregion

#region  其它套装
class 套装效果85():
    名称 = '超界·苍穹之云'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.10)
        属性.伤害增加加成(0.13)
        属性.技能等级加成('所有', 50, 50, 2)
        属性.技能等级加成('所有', 85, 85, 2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.释放速度 += 0.075
        属性.移动速度 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +10%<br>'
        temp += '伤害增加 +13%<br>'
        temp += 'Lv50 技能等级+2<br>'
        temp += 'Lv85 技能等级+2<br>'
        temp += '攻击速度 +5%<br>'
        temp += '释放速度 +7.5%<br>'
        temp += '移动速度 +5%<br>'
        return temp      

class 套装效果86():
    名称 = '超界·苍穹之云'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.36)
        属性.技能等级加成('所有', 50, 50, 2)
        属性.技能等级加成('所有', 85, 85, 2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.17
        属性.释放速度 += 0.255
        属性.移动速度 += 0.17
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +36%<br>'
        temp += 'Lv50 技能等级+2<br>'
        temp += 'Lv85 技能等级+2<br>'
        temp += '攻击速度 +17%<br>'
        temp += '释放速度 +25.5%<br>'
        temp += '移动速度 +17%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp

class 套装效果87():
    名称 = '超界·永恒的季节'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.12)
        属性.最终伤害加成(0.25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.10
        属性.魔法暴击率 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '技能攻击力 +12%<br>'
        temp += '最终伤害 +25%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp

class 套装效果88():
    名称 = '超界·永恒的季节'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.48)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.17
        属性.释放速度 += 0.255
        属性.移动速度 += 0.17
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +48%<br>'
        temp += '攻击速度 +17%<br>'
        temp += '释放速度 +25.5%<br>'
        temp += '移动速度 +17%<br>'
        return temp
     

class 套装效果89():
    名称 = '超界·亿万年的星光'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.技能等级加成('所有', 50, 50, 2)
        属性.技能等级加成('所有', 85, 85, 1)
        属性.最终伤害加成(0.25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += 'Lv50 技能等级+2<br>'
        temp += 'Lv85 技能等级+1<br>'
        temp += '最终伤害 +25%<br>'
        return temp 

class 套装效果90():
    名称 = '超界·亿万年的星光'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.属性附加加成(0.35)
        属性.技能等级加成('所有', 85, 85, 1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.10
        属性.释放速度 += 0.15
        属性.移动速度 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '属性附加 +35%<br>'
        temp += 'Lv85 技能等级+1<br>'
        temp += '攻击速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        temp += '移动速度 +10%<br>'
        return temp  

class 套装效果91():
    名称 = '超界·精灵的荣耀'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.06
        属性.释放速度 += 0.09
        属性.移动速度 += 0.06
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +35%<br>'
        temp += '攻击速度 +6%<br>'
        temp += '释放速度 +9%<br>'
        temp += '移动速度 +6%<br>'
        return temp  

class 套装效果92():
    名称 = '超界·精灵的荣耀'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.45)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.06
        属性.释放速度 += 0.09
        属性.移动速度 += 0.06
        属性.物理暴击率 += 0.10
        属性.魔法暴击率 += 0.10
        属性.移动速度 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +45%<br>'
        temp += '攻击速度 +6%<br>'
        temp += '释放速度 +9%<br>'
        temp += '移动速度 +6%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        temp += '移动速度 +10%<br>'
        return temp     

class 套装效果93():
    名称 = '超界·幸运的五彩石'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(25)
        属性.最终伤害加成(0.25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.10
        属性.魔法暴击率 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '所有属性强化 +25<br>'
        temp += '最终伤害 +25%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp
  

class 套装效果94():
    名称 = '超界·幸运的五彩石'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.属性附加加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.10
        属性.释放速度 += 0.15
        属性.移动速度 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '属性附加 +35%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        temp += '移动速度 +10%<br>'
        return temp     

class 套装效果95():
    名称 = '黑暗的第一权能'
    件数 = 3
    类型 = '首饰'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.12)
        属性.百分比力智加成(0.12)
        属性.技能攻击力加成(0.08)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.释放速度 += 0.075
        属性.移动速度 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +12%<br>'
        temp += '百分比力智 +12%<br>'
        temp += '技能攻击力 +8%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '释放速度 +7.5%<br>'
        temp += '移动速度 +5%<br>'
        return temp     

class 套装效果96():
    名称 = '黑暗的第二权能'
    件数 = 3
    类型 = '特殊'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.10)
        属性.百分比力智加成(0.08)
        属性.技能攻击力加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.释放速度 += 0.075
        属性.移动速度 += 0.05
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +10%<br>'
        temp += '百分比力智 +8%<br>'
        temp += '技能攻击力 +15%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '释放速度 +7.5%<br>'
        temp += '移动速度 +5%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp
      

class 套装效果97():
    名称 = '维度崩坏'
    件数 = 3
    类型 = '首饰'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·维度冲击臂环'):
            属性.力量 += 200
            属性.智力 += 200
            属性.百分比力智加成(0.15)
            属性.附加伤害加成(0.10)
            属性.暴击伤害加成(0.10)
            属性.百分比三攻加成(0.13)
        elif 属性.装备检查('时空：维度冲击臂环'):
            属性.附加伤害加成(0.05)
            属性.暴击伤害加成(0.15)
        else:
            属性.百分比力智加成(0.04)
            属性.附加伤害加成(0.04)
            属性.技能攻击力加成(0.08)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·维度冲击臂环'):
            属性.物理暴击率 += 0.03
            属性.魔法暴击率 += 0.03
        else:
            pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·维度冲击臂环'):
            temp += '力量 +200<br>'
            temp += '智力 +200<br>'
            temp += '百分比力智 +15%<br>'
            temp += '附加伤害 +10%<br>'
            temp += '暴击伤害 +10%<br>'
            temp += '百分比三攻 +13%<br>'
            temp += '物理暴击率 +3%<br>'
            temp += '魔法暴击率 +3%<br>'
        elif 属性.装备检查('时空：维度冲击臂环'):
            temp += '附加伤害 +5%<br>'
            temp += '暴击伤害 +15%<br>'
        else:
            temp += '百分比力智 +4%<br>'
            temp += '附加伤害 +4%<br>'
            temp += '技能攻击力 +8%<br>'
        return temp      

class 套装效果98():
    名称 = '暗之腐蚀'
    件数 = 3
    类型 = '特殊'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·腐蚀之黑色十字耳环'):
            属性.力量 += 200
            属性.智力 += 200
            属性.百分比力智加成(0.05)
            属性.附加伤害加成(0.16)
            属性.暴击伤害加成(0.23)
            属性.技能攻击力加成(0.05)
        elif 属性.装备检查('时空：腐蚀之黑色十字耳环'):
            属性.附加伤害加成(0.13)
            属性.暴击伤害加成(0.05)
            属性.技能攻击力加成(0.05)
        else:
            属性.百分比力智加成(0.05)
            属性.技能攻击力加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·腐蚀之黑色十字耳环'):
            属性.物理暴击率 += 0.04
            属性.魔法暴击率 += 0.04
        else:
            pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·腐蚀之黑色十字耳环'):
            temp += '力量 +200<br>'
            temp += '智力 +200<br>'
            temp += '百分比力智 +5%<br>'
            temp += '附加伤害 +16%<br>'
            temp += '暴击伤害 +23%<br>'
            temp += '技能攻击力 +5%<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        elif 属性.装备检查('时空：腐蚀之黑色十字耳环'):
            temp += '附加伤害 +13%<br>'
            temp += '暴击伤害 +5%<br>'
            temp += '技能攻击力 +5%<br>'
        else:
            temp += '百分比力智 +5%<br>'
            temp += '技能攻击力 +15%<br>'
        return temp

class 套装效果99():
    名称 = '堕落的暗黑之力'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·黑暗幽灵紫杉胸甲'):
            属性.力量 += 200
            属性.智力 += 200
            属性.百分比三攻加成(0.12)
            属性.伤害增加加成(0.10)
            属性.暴击伤害加成(0.10)
            属性.最终伤害加成(0.05)
        elif 属性.装备检查('时空：黑暗幽灵紫杉胸甲'):
            属性.百分比三攻加成(0.06)
            属性.伤害增加加成(0.10)
            属性.暴击伤害加成(0.10)
        else:
            属性.伤害增加加成(0.10)
            属性.暴击伤害加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·黑暗幽灵紫杉胸甲'):
            pass
        else:
            属性.物理暴击率 += 0.04
            属性.魔法暴击率 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·黑暗幽灵紫杉胸甲'):
            temp += '力量 +200<br>'
            temp += '智力 +200<br>'
            temp += '百分比三攻 +12%<br>'
            temp += '伤害增加 +10%<br>'
            temp += '暴击伤害 +10%<br>'
            temp += '最终伤害 +5%<br>'
        elif 属性.装备检查('时空：黑暗幽灵紫杉胸甲'):
            temp += '百分比三攻 +6%<br>'
            temp += '伤害增加 +10%<br>'
            temp += '暴击伤害 +10%<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        else:
            temp += '伤害增加 +10%<br>'
            temp += '暴击伤害 +10%<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        return temp     

class 套装效果100():
    名称 = '堕落的暗黑之力'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·黑暗幽灵紫杉胸甲'):
            属性.力量 += 200
            属性.智力 += 200
            属性.附加伤害加成(0.20)
            属性.最终伤害加成(0.20)
            属性.技能攻击力加成(0.16)
        elif 属性.装备检查('时空：黑暗幽灵紫杉胸甲'):
            属性.附加伤害加成(0.07)
            属性.最终伤害加成(0.20)
            属性.技能攻击力加成(0.10)
        else:
            属性.附加伤害加成(0.13)
            属性.最终伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·黑暗幽灵紫杉胸甲'):
            属性.物理暴击率 += 0.08
            属性.魔法暴击率 += 0.08
        else:
            pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·黑暗幽灵紫杉胸甲'):
            temp += '力量 +200<br>'
            temp += '智力 +200<br>'
            temp += '附加伤害 +20%<br>'
            temp += '最终伤害 +20%<br>'
            temp += '技能攻击力 +16%<br>'
            temp += '物理暴击率 +8%<br>'
            temp += '魔法暴击率 +8%<br>'
        elif 属性.装备检查('时空：黑暗幽灵紫杉胸甲'):
            temp += '附加伤害 +7%<br>'
            temp += '最终伤害 +20%<br>'
            temp += '技能攻击力 +10%<br>'
        else:        
            temp += '附加伤害 +13%<br>'
            temp += '最终伤害 +12%<br>'
        return temp

class 套装效果101():
    名称 = '江山如画'
    件数 = 3
    类型 = '首饰'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.20)
        属性.技能攻击力加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +20%<br>'
        temp += '技能攻击力 +10%<br>'
        return temp     

class 套装效果102():
    名称 = '万物的生灭'
    件数 = 3
    类型 = '特殊'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.12)
        属性.技能攻击力加成(0.20)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '最终伤害 +12%<br>'
        temp += '技能攻击力 +20%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp
     

class 套装效果103():
    名称 = '兵法之神'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.12)
        属性.物理攻击力 += 200
        属性.魔法攻击力 += 200
        属性.独立攻击力 += 200
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.10
        属性.移动速度 += 0.10
        属性.释放速度 += 0.15
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +12%<br>'
        temp += '物理攻击力 +200<br>'
        temp += '魔法攻击力 +200<br>'
        temp += '独立攻击力 +200<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp      

class 套装效果104():
    名称 = '兵法之神'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(25)
        属性.百分比三攻加成(0.22)
        属性.技能攻击力加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '所有属性强化 +25<br>'
        temp += '百分比三攻 +22%<br>'
        temp += '技能攻击力 +10%<br>'
        return temp  

class 套装效果105():
    名称 = '流逝轮回的记忆'
    件数 = 3
    类型 = '首饰'
    def 城镇属性(self, 属性):
        属性.百分比减防 += 0.02
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比减防 +5%<br>'
        temp += '(BOSS：实际2%)<br>'
        return temp        

class 套装效果106():
    名称 = '无相轮回的希望'
    件数 = 2
    类型 = '特殊'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(10)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '所有属性强化 +10<br>'
        return temp 

class 套装效果107():
    名称 = '魔战无双'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.35)
        属性.技能等级加成('所有', 50, 75, 2)
        属性.技能等级加成('所有', 85, 85, 1)
        try:
            属性.技能栏[属性.技能序号['基础精通']].倍率 *= 1.2
        except:
            pass
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.10 * 3
        属性.移动速度 += 0.10 * 3
        属性.释放速度 += 0.15 * 3
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +35%<br>'
        temp += 'Lv50-75 技能等级+2<br>'
        temp += 'Lv85 技能等级+1<br>'
        temp += '基础精通效果 +20%<br>'
        temp += '攻击速度 +10% x3<br>'
        temp += '移动速度 +10% x3<br>'
        temp += '释放速度 +15% x3<br>'
        return temp     

class 套装效果108():
    名称 = '霸域英豪'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.物理攻击力 += 300
        属性.魔法攻击力 += 300
        属性.独立攻击力 += 300
        属性.力量 += 220
        属性.智力 += 220
        pass
    def 进图属性(self, 属性):
        属性.附加伤害加成(0.40)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.移动速度 += 0.05
        属性.释放速度 += 0.20
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '物理攻击力 +300<br>'
        temp += '魔法攻击力 +300<br>'
        temp += '独立攻击力 +300<br>'
        temp += '力量 +200<br>'
        temp += '智力 +200<br>'
        temp += '附加伤害 +40%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +5%<br>'
        temp += '释放速度 +20%<br>'
        return temp      

class 套装效果109():
    名称 = '千蛛碎影'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.12)
        属性.黄字 = max(属性.黄字, 0.45)
        if 属性.职业 == '街霸':
            for i in 属性.技能栏:
                if i.是否有伤害 == 1:
                    i.中毒倍率 += 0.3
                    if 属性.角色 == '格斗家(男)':
                        i.感电倍率 += 0.3
                    else:
                        i.涂毒倍率 += 0.3
                    i.出血倍率 += 0.3
                    i.灼伤倍率 += 0.3
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.10
        属性.魔法暴击率 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '中毒、涂毒伤害 +30%<br>'
        temp += '感电伤害 +30%<br>'
        temp += '出血伤害 +30%<br>'
        temp += '灼伤伤害 +30%<br>'
        temp += '百分比三攻 +12%<br>'
        temp += '黄字 +45%(取最高值)<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp     

class 套装效果110():
    名称 = '誓血之盟'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.百分比三攻加成(0.30)
        属性.爆伤 = max(属性.爆伤, 0.20)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +30%<br>'
        temp += '爆伤 +20%(取最高值)<br>'
        return temp    

class 套装效果111():
    名称 = '天御之灾'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        if 天御套装 == 0:
            属性.所有属性强化加成(10)
            属性.属性附加加成(0.20)
            属性.附加伤害加成(0.09)
        elif 天御套装 == 1:
            属性.所有属性强化加成(50)
            属性.属性附加加成(0.25)
        elif 天御套装 == 2:
            属性.附加伤害加成(0.45)
        pass
    def 其它属性(self, 属性):
        if 天御套装 == 0:
            属性.攻击速度 += 0.04
            属性.移动速度 += 0.04
            属性.释放速度 += 0.05
        elif 天御套装 == 2:
            属性.攻击速度 += 0.20
            属性.移动速度 += 0.20
            属性.释放速度 += 0.25            
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 天御套装 == 0:
            temp += '所有属性强化 +10<br>'
            temp += '属性附加 +20%<br>'
            temp += '附加伤害 +9%<br>'
            temp += '攻击速度 +4%<br>'
            temp += '移动速度 +4%<br>'
            temp += '释放速度 +5%<br>'
        elif 天御套装 == 1:
            temp += '所有属性强化 +50<br>'
            temp += '属性附加 +25%<br>'
        elif 天御套装 == 2:
            temp += '附加伤害 +45%<br>'
            temp += '攻击速度 +20%<br>'
            temp += '移动速度 +20%<br>'
            temp += '释放速度 +25%<br>'
        return temp     

class 套装效果112():
    名称 = '最佳球手的绝杀'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.05)
        pass
    def 进图属性(self, 属性):
        属性.百分比三攻加成(0.40)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.30
        属性.移动速度 += 0.30
        属性.释放速度 += 0.445
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +5%<br>'
        temp += '百分比三攻 +40%<br>'
        temp += '攻击速度 +30%<br>'
        temp += '移动速度 +30%<br>'
        temp += '释放速度 +44.5%<br>'
        return temp   

class 套装效果113():
    名称 = '战术之王的御敌'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(战术白字)
        pass
    def 进图属性(self, 属性):
        属性.力量 += 620
        属性.智力 += 620
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.20
        属性.移动速度 += 0.20
        属性.释放速度 += 0.20  
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +' + str(int(战术白字 * 100)) +'%<br>'
        temp += '攻击速度 +20%<br>'
        temp += '移动速度 +20%<br>'
        temp += '释放速度 +20%<br>'
        return temp
    

class 套装效果114():
    名称 = '杀意决'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.12)
        属性.力量 += 150
        属性.智力 += 150
        属性.附加伤害加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +12%<br>'
        temp += '力量 +150<br>'
        temp += '智力 +150<br>'
        temp += '附加伤害 +35%<br>'
        return temp


class 套装效果115():
    名称 = '逝魔之力'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.18)
        属性.魔法攻击力 += 550
        属性.独立攻击力 += 550
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +18%<br>'
        temp += '魔法攻击力 +550<br>'
        temp += '独立攻击力 +550<br>'
        return temp
    

class 套装效果116():
    名称 = '天劫'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(50)
        属性.智力 += 400
        属性.技能攻击力加成(0.18)
        属性.百分比减防 += 0.10 * 天劫减防
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '所有属性强化 +50<br>'
        temp += '智力 +400<br>'
        temp += '技能攻击力 +18%<br>'
        if 天劫减防 == 1:
            temp += '百分比减防 +20%<br>'
            temp += '(BOSS：实际10%)<br>'
        return temp  

class 套装效果117():
    名称 = '冰雪公主的霜语首饰'
    件数 = 3
    类型 = '首饰'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.18)
        属性.冰属性强化加成(50)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +18%<br>'
        temp += '冰属性强化 +50<br>'
        return temp  

class 套装效果118():
    名称 = '精炼的异界魔石首饰'
    件数 = 3
    类型 = '首饰'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.20)
        属性.所有属性强化加成(18)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.12
        属性.魔法暴击率 += 0.12        
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +20%<br>'
        temp += '所有属性强化 +18<br>'
        temp += '物理暴击率 +12%<br>'
        temp += '魔法暴击率 +12%<br>'
        return temp
#endregion

#region 新增传说两件套 &光环套
class 套装效果119():
    名称 = '维度崩坏'
    件数 = 2
    类型 = '首饰'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·维度冲击臂环'):
            pass
        elif 属性.装备检查('时空：维度冲击臂环'):
            属性.百分比力智加成(0.10)
            属性.附加伤害加成(0.05)
        else:
            属性.百分比力智加成(0.04)
            属性.附加伤害加成(0.04)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·维度冲击臂环'):
            pass
        else:
            属性.物理暴击率 += 0.03
            属性.魔法暴击率 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·维度冲击臂环'):
            temp += '无<br>'
        elif 属性.装备检查('时空：维度冲击臂环'):
            temp += '百分比力智 +10%<br>'
            temp += '附加伤害 +5%<br>'
            temp += '物理暴击率 +3%<br>'
            temp += '魔法暴击率 +3%<br>'
        else:
            temp += '百分比力智 +4%<br>'
            temp += '附加伤害 +4%<br>'
            temp += '物理暴击率 +3%<br>'
            temp += '魔法暴击率 +3%<br>'
        return temp   


class 套装效果120():
    名称 = '暗之腐蚀'
    件数 = 2
    类型 = '特殊'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·腐蚀之黑色十字耳环'):
            pass
        elif 属性.装备检查('时空：腐蚀之黑色十字耳环'):
            属性.百分比力智加成(0.10)
            属性.暴击伤害加成(0.05)
        else:
            属性.暴击伤害加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·腐蚀之黑色十字耳环'):
            pass
        else:
            属性.物理暴击率 += 0.04
            属性.魔法暴击率 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·腐蚀之黑色十字耳环'):
            temp += '无<br>'
        elif 属性.装备检查('时空：腐蚀之黑色十字耳环'):
            temp += '百分比力智 +10%<br>'
            temp += '暴击伤害 +5%<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        else:
            temp += '暴击伤害 +10%<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        return temp   

class 套装效果121():
    名称 = '先贤的馈赠'
    件数 = 2
    类型 = '首饰'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·先贤的馈赠手镯'):
            pass
        elif 属性.装备检查('时空：先贤的馈赠手镯'):
            属性.百分比力智加成(0.10)
            属性.附加伤害加成(0.05)
        else:
            属性.百分比力智加成(0.04)
            属性.附加伤害加成(0.04)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·先贤的馈赠手镯'):
            pass
        else:
            属性.物理暴击率 += 0.03
            属性.魔法暴击率 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·先贤的馈赠手镯'):
            temp += '无<br>'
        elif 属性.装备检查('时空：先贤的馈赠手镯'):
            temp += '百分比力智 +10%<br>'
            temp += '附加伤害 +5%<br>'
            temp += '物理暴击率 +3%<br>'
            temp += '魔法暴击率 +3%<br>'
        else:
            temp += '百分比力智 +4%<br>'
            temp += '附加伤害 +4%<br>'
            temp += '物理暴击率 +3%<br>'
            temp += '魔法暴击率 +3%<br>'
        return temp      

class 套装效果122():
    名称 = '先贤的馈赠'
    件数 = 3
    类型 = '首饰'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·先贤的馈赠手镯'):
            属性.力量 += 200
            属性.智力 += 200
            属性.百分比力智加成(0.15)
            属性.附加伤害加成(0.10)
            属性.技能攻击力加成(0.05)
            属性.百分比三攻加成(0.13)
        elif 属性.装备检查('时空：先贤的馈赠手镯'):
            属性.附加伤害加成(0.05)
            属性.技能攻击力加成(0.05)
        else:
            属性.百分比力智加成(0.04)
            属性.附加伤害加成(0.04)
            属性.技能攻击力加成(0.05)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·先贤的馈赠手镯'):
            属性.物理暴击率 += 0.03
            属性.魔法暴击率 += 0.03
        else:
            pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·先贤的馈赠手镯'):
            temp += '力量 +200<br>'
            temp += '智力 +200<br>'
            temp += '百分比力智 +15%<br>'
            temp += '附加伤害 +10%<br>'
            temp += '技能攻击力 +5%<br>'
            temp += '百分比三攻 +13%<br>'
            temp += '物理暴击率 +3%<br>'
            temp += '魔法暴击率 +3%<br>'
        elif 属性.装备检查('时空：先贤的馈赠手镯'):
            temp += '附加伤害 +5%<br>'
            temp += '技能攻击力 +5%<br>'
        else:
            temp += '百分比力智 +4%<br>'
            temp += '附加伤害 +4%<br>'
            temp += '技能攻击力 +5%<br>'
        return temp      

class 套装效果123():
    名称 = '堕落的暗黑之力'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·黑暗幽灵紫杉胸甲'):
            pass
        elif 属性.装备检查('时空：黑暗幽灵紫杉胸甲'):
            属性.最终伤害加成(0.05)
            属性.附加伤害加成(0.07)
        else:
            属性.百分比三攻加成(0.05)
            属性.附加伤害加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·黑暗幽灵紫杉胸甲'):
            pass
        else:
            属性.物理暴击率 += 0.04
            属性.魔法暴击率 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·黑暗幽灵紫杉胸甲'):
            temp += '无<br>'
        elif 属性.装备检查('时空：黑暗幽灵紫杉胸甲'):
            temp += '最终伤害 +5%<br>'
            temp += '附加伤害 +7%<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        else:
            temp += '百分比三攻 +5%<br>'
            temp += '附加伤害 +7%<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        return temp

class 套装效果124():
    名称 = '鲜红血纹'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            pass
        elif 属性.装备检查('时空：鲜红血纹皮甲胸铠'):
            属性.百分比力智加成(0.10)
            属性.所有属性强化加成(25)
        else:
            属性.百分比力智加成(0.05)
            属性.所有属性强化加成(25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            pass
        else:
            属性.物理暴击率 += 0.04
            属性.魔法暴击率 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            temp += '无<br>'
        elif 属性.装备检查('时空：鲜红血纹皮甲胸铠'):
            temp += '百分比力智 +10%<br>'
            temp += '所有属性强化 +25<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        else:
            temp += '百分比力智 +5%<br>'
            temp += '所有属性强化 +25<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        return temp    

class 套装效果125():
    名称 = '鲜红血纹'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            属性.力量 += 200
            属性.智力 += 200
            属性.附加伤害加成(0.10)
            属性.最终伤害加成(0.10)
            属性.所有属性强化加成(20)
            属性.百分比三攻加成(0.05)
        elif 属性.装备检查('时空：鲜红血纹皮甲胸铠'):
            属性.附加伤害加成(0.10)
            属性.最终伤害加成(0.08)
            属性.所有属性强化加成(15)
            属性.百分比三攻加成(0.05)
        else:
            属性.附加伤害加成(0.10)
            属性.所有属性强化加成(10)
            属性.百分比三攻加成(0.05)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            pass
        else:
            属性.物理暴击率 += 0.04
            属性.魔法暴击率 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            temp += '力量 +200<br>'
            temp += '智力 +200<br>'
            temp += '附加伤害 +10%<br>'
            temp += '最终伤害 +10%<br>'
            temp += '所有属性强化 +20<br>'
            temp += '百分比三攻 +5%<br>'
        elif 属性.装备检查('时空：鲜红血纹皮甲胸铠'):
            temp += '附加伤害 +10%<br>'
            temp += '最终伤害 +8%<br>'
            temp += '所有属性强化 +15<br>'
            temp += '百分比三攻 +5%<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        else:
            temp += '附加伤害 +10%<br>'
            temp += '所有属性强化 +10<br>'
            temp += '百分比三攻 +5%<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        return temp        

class 套装效果126():
    名称 = '鲜红血纹'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            属性.力量 += 200
            属性.智力 += 200
            属性.所有属性强化加成(30)
            属性.最终伤害加成(0.06)
            属性.百分比力智加成(0.10)
            属性.技能攻击力加成(0.16)
            属性.百分比三攻加成(0.15)
        elif 属性.装备检查('时空：鲜红血纹皮甲胸铠'):
            属性.所有属性强化加成(10)
            属性.最终伤害加成(0.05)
            属性.技能攻击力加成(0.10)
            属性.百分比三攻加成(0.15)
        else:
            属性.所有属性强化加成(15)
            属性.百分比力智加成(0.05)
            属性.百分比三攻加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            属性.物理暴击率 += 0.08
            属性.魔法暴击率 += 0.08
        else:
            pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            temp += '力量 +200<br>'
            temp += '智力 +200<br>'
            temp += '所有属性强化 +30<br>'
            temp += '最终伤害 +6%<br>'
            temp += '百分比力智 +10%<br>'
            temp += '技能攻击力 +16%<br>'
            temp += '百分比三攻 +15%<br>'
            temp += '物理暴击率 +8%<br>'
            temp += '魔法暴击率 +8%<br>'
        elif 属性.装备检查('时空：鲜红血纹皮甲胸铠'):
            temp += '所有属性强化 +10<br>'
            temp += '最终伤害 +5%<br>'
            temp += '技能攻击力 +10%<br>'
            temp += '百分比三攻 +15%<br>'
        else:
            temp += '所有属性强化 +15<br>'
            temp += '百分比力智 +5%<br>'
            temp += '百分比三攻 +15%<br>'
        return temp    
#endregion