from .basic_equ import *
#region  100SS首饰
class 装备180(装备):
    名称 = '莱多：变幻的规律'
    模式 = 0
    所属套装 = '上古尘封术士'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    体力 = 117
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.12)
        self.属性描述 += 属性.技能攻击力加成(0.20)
        self.属性描述 += 属性.所有属性强化加成(25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.1)
        pass
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=230)
        self.属性描述 += 属性.被动增加(转职被动智力=250)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.08)

class 装备181(装备):
    名称 = '拥抱晨曦之温暖'
    模式 = 0
    所属套装 = '破晓曦光'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    体力 = 117
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.06)
        self.属性描述 += 属性.技能攻击力加成(0.05 + 0.01 * min(13, 属性.获取强化(self.部位)))
        self.属性描述 += 属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 1, 48, 1)
        self.属性描述 += 属性.技能恢复加成(15, 30, 0.30)  
        pass
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 1, 48, 1)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=180)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.05)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.05)
        
class 装备182(装备):
    名称 = '白象之庇护'
    模式 = 0
    所属套装 = '幸运三角'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    体力 = 117
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.07)
        self.属性描述 += 属性.伤害增加加成(0.07)
        self.属性描述 += 属性.暴击伤害加成(0.07)
        self.属性描述 += 属性.附加伤害加成(0.07)
        self.属性描述 += 属性.技能攻击力加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=220)
        self.属性描述 += 属性.被动增加(转职被动智力=250)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.08)

class 装备183(装备):
    名称 = '火魔之焰-沙罗曼达'
    模式 = 0
    所属套装 = '精灵使的权能'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    体力 = 117
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(38)
        self.属性描述 += 属性.附加伤害加成(0.3)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass  
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=220)
        self.属性描述 += 属性.被动增加(转职被动智力=250)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.08)

class 装备184(装备):
    名称 = '执着的探求'
    模式 = 0
    所属套装 = '黑魔法探求者'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    体力 = 117
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.28)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        pass   
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=245)
        self.属性描述 += 属性.被动增加(转职被动智力=270)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.08)

class 装备185(装备):
    名称 = '时间指引之针'
    模式 = 0
    所属套装 = '时空旅行者'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    体力 = 117
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.2)
        self.属性描述 += 属性.技能攻击力加成(0.14)
        self.属性描述 += 属性.技能冷却缩减(50, 50, 0.10)
        self.属性描述 += 属性.技能冷却缩减(85, 85, 0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.1)
        self.属性描述 += 属性.释放速度增加(0.15)
        pass 
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=230)
        self.属性描述 += 属性.被动增加(转职被动智力=242)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.07)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.07)

class 装备186(装备):
    名称 = '支配战场的呐喊'
    模式 = 0
    所属套装 = '穿透命运的呐喊'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    体力 = 117
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.12)
        self.属性描述 += 属性.最终伤害加成(0.23)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass   
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=220)
        self.属性描述 += 属性.被动增加(转职被动智力=250)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.08)

class 装备187(装备):
    名称 = '狂乱之坚如磐石'
    模式 = 0
    所属套装 = '狂乱追随者'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    体力 = 117
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.3)
        self.属性描述 += 属性.技能攻击力加成(0.11)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass    
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=220)
        self.属性描述 += 属性.被动增加(转职被动智力=250)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.08)

class 装备188(装备):
    名称 = '莱多：秩序创造者'
    模式 = 0
    所属套装 = '上古尘封术士'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    体力 = 120
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '百分比三攻：'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力：'
    属性2范围 = [6, 1, 1]
    属性2选择 = 0
    属性3描述 = '暴击伤害：'
    属性3范围 = [9, 1, 1]
    属性3选择 = 0
    属性4描述 = '百分比力智：'
    属性4范围 = [6, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.06)
        self.属性描述 += 属性.技能攻击力加成(0.25)
        self.属性描述 += 属性.所有属性强化加成(25)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.百分比三攻加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]) / 100)
        self.属性描述 += 属性.技能攻击力加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.暴击伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        self.属性描述 += 属性.百分比力智加成((self.属性4范围[0]-self.属性4选择*self.属性4范围[2]) / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.1)
        self.属性描述 += 属性.移动速度增加(0.1)
        self.属性描述 += 属性.释放速度增加(0.15)
        pass     
    # 专属属性
    属性1描述_BUFF = '一觉力智：'
    属性1范围_BUFF = [60, 40, 10]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = '转职被动：'
    属性2范围_BUFF = [200, 100, 20]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = '一觉力智：'
    属性3范围_BUFF = [9, 1, 1]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = 'BUFF三攻：'
    属性4范围_BUFF = [7, 2, 1]  # 最大值 最小值 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=230)
        self.属性描述 += 属性.被动增加(转职被动智力=250)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08, BUFF智力per=1.08)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.觉醒增加(一觉力智=60 - self.属性1选择_BUFF * 10)
        self.属性描述 += 属性.被动增加(守护恩赐体精=200 - self.属性2选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(转职被动智力=200 - self.属性2选择_BUFF * 20)
        self.属性描述 += 属性.觉醒增加(一觉力智per=1.09 - self.属性3选择_BUFF / 100)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.07 - self.属性4选择_BUFF / 100, BUFF魔攻per=1.07 - self.属性4选择_BUFF / 100, BUFF独立per=1.07 - self.属性4选择_BUFF / 100)
  
class 装备189(装备):
    名称 = '融化黑暗之温暖'
    模式 = 0
    所属套装 = '破晓曦光'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    体力 = 120
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '物理/魔法/独立 +'
    属性1范围 = [110, 30, 10]
    属性1选择 = 0
    属性2描述 = '暴击伤害：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '伤害增加：'
    属性3范围 = [11, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.06)
        self.属性描述 += 属性.所有属性强化加成(28)
        self.属性描述 += 属性.技能攻击力加成(0.05 + 0.01 * min(13, 属性.获取强化(self.部位)))
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.三攻固定加成(x=(self.属性1范围[0]-self.属性1选择*self.属性1范围[2]))
        self.属性描述 += 属性.暴击伤害加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)  
        self.属性描述 += 属性.伤害增加加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2])/ 100)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 1, 48, 1)
        self.属性描述 += 属性.技能恢复加成(15, 30, 0.30)
        pass
    def 其它属性(self, 属性):
        x = int(min(sum(属性.强化等级), 150) / 6)
        self.属性描述 += 属性.物理暴击率增加(0.005 * x)
        self.属性描述 += 属性.魔法暴击率增加(0.005 * x)
        self.属性描述 += 属性.攻击速度增加(0.008 * x)
        self.属性描述 += 属性.移动速度增加(0.008 * x)
        self.属性描述 += 属性.释放速度增加(0.012 * x)
        pass          
    # 专属属性
    属性1描述_BUFF = 'BUFF三攻：'
    属性1范围_BUFF = [9, 1, 1]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = '一觉力智：'
    属性2范围_BUFF = [10, 1, 1]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = 'BUFF力智：'
    属性3范围_BUFF = [11, 1, 1]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '无'
    属性4范围_BUFF = [0, 0, 0]  # 最大值 最小值 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 1, 48, 1)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=180)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.05, BUFF智力per=1.05)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.09 - self.属性1选择_BUFF / 100, BUFF魔攻per=1.09 - self.属性1选择_BUFF / 100, BUFF独立per=1.09 - self.属性1选择_BUFF / 100)
        self.属性描述 += 属性.觉醒增加(一觉力智per=1.10 - self.属性2选择_BUFF / 100)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.11 - self.属性3选择_BUFF / 100, BUFF智力per=1.11 - self.属性3选择_BUFF / 100)

class 装备190(装备):
    名称 = '伽内什的永恒庇护'
    模式 = 0
    所属套装 = '幸运三角'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    体力 = 120
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '暴击伤害：'
    属性1范围 = [4, 1, 1]
    属性1选择 = 0
    属性2描述 = '百分比力智：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '伤害增加：'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '百分比三攻：'
    属性4范围 = [8, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.07)
        self.属性描述 += 属性.技能攻击力加成(0.07)
        self.属性描述 += 属性.暴击伤害加成(0.07)
        self.属性描述 += 属性.伤害增加加成(0.07)
        self.属性描述 += 属性.百分比力智加成(0.07)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.暴击伤害加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]) / 100)
        self.属性描述 += 属性.百分比力智加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.伤害增加加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        self.属性描述 += 属性.百分比三攻加成((self.属性4范围[0]-self.属性4选择*self.属性4范围[2]) / 100)       
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.07)
        self.属性描述 += 属性.移动速度增加(0.07)
        self.属性描述 += 属性.释放速度增加(0.07)
        pass
    # 专属属性
    属性1描述_BUFF = '一觉力智：'
    属性1范围_BUFF = [50, 20, 10]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = '一觉力智：'
    属性2范围_BUFF = [10, 1, 1]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = '一觉被动(120/100)+'
    属性3范围_BUFF = [40, 0, 20]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = 'BUFF力智：'
    属性4范围_BUFF = [9, 2, 1]  # 最大值 最小值 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=220)
        self.属性描述 += 属性.被动增加(转职被动智力=250)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08, BUFF智力per=1.08)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.觉醒增加(一觉力智=50 - self.属性1选择_BUFF * 10)
        self.属性描述 += 属性.觉醒增加(一觉力智per=1.1 - self.属性2选择_BUFF / 100)
        self.属性描述 += 属性.被动增加(信念光环体精=160 - self.属性3选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(一觉被动力智=140 - self.属性3选择_BUFF * 20)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.09 - self.属性4选择_BUFF / 100, BUFF智力per=1.09 - self.属性4选择_BUFF / 100)    
  
class 装备191(装备):
    名称 = '至高之炎-伊弗利特'
    模式 = 0
    所属套装 = '精灵使的权能'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    体力 = 120
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '力量/智力 +'
    属性1范围 = [160, 40, 20]
    属性1选择 = 0
    属性2描述 = '最终伤害：'
    属性2范围 = [12, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比三攻：'
    属性3范围 = [12, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.2)
        self.属性描述 += 属性.所有属性强化加成(38)
        self.属性描述 += 属性.技能攻击力加成(0.13)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.力智固定加成(x=(self.属性1范围[0]-self.属性1选择*self.属性1范围[2]))
        self.属性描述 += 属性.最终伤害加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.百分比三攻加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    # 专属属性
    属性1描述_BUFF = '守护恩赐/力智：'
    属性1范围_BUFF = [160, 40, 20]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = '一觉力智：'
    属性2范围_BUFF = [120, 10, 10]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = 'BUFF三攻：'
    属性3范围_BUFF = [12, 1, 1]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '无'
    属性4范围_BUFF = [0, 0, 0]  # 最大值 最小值 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=220)
        self.属性描述 += 属性.被动增加(转职被动智力=250)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08, BUFF智力per=1.08)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.被动增加(守护恩赐体精=160 - self.属性1选择_BUFF * 20)
        self.属性描述 += 属性.力智固定加成(x=160 - self.属性1选择_BUFF * 20)
        self.属性描述 += 属性.觉醒增加(一觉力智=120 - self.属性2选择_BUFF * 10)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.12 - self.属性3选择_BUFF / 100, BUFF魔攻per=1.12 - self.属性3选择_BUFF / 100, BUFF独立per=1.12 - self.属性3选择_BUFF / 100)

class 装备192(装备):
    名称 = '无尽的探求'
    模式 = 0
    所属套装 = '黑魔法探求者'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    体力 = 120
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '力量/智力 +'
    属性1范围 = [240, 20, 20]
    属性1选择 = 0
    属性2描述 = '附加伤害：'
    属性2范围 = [7, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比三攻：'
    属性3范围 = [12, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.2)
        self.属性描述 += 属性.技能攻击力加成(0.1)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.力智固定加成(x=(self.属性1范围[0]-self.属性1选择*self.属性1范围[2]))
        self.属性描述 += 属性.附加伤害加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.百分比三攻加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        pass   
    # 专属属性
    属性1描述_BUFF = '守护恩赐/力智：'
    属性1范围_BUFF = [240, 20, 20]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = 'BUFF三攻：'
    属性2范围_BUFF = [10, 4, 1]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = '一觉力智：'
    属性3范围_BUFF = [120, 10, 10]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '无'
    属性4范围_BUFF = [0, 0, 0]  # 最大值 最小值 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=245)
        self.属性描述 += 属性.被动增加(转职被动智力=270)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08, BUFF智力per=1.08)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.被动增加(守护恩赐体精=240 - self.属性1选择_BUFF * 20)
        self.属性描述 += 属性.力智固定加成(x=240 - self.属性1选择_BUFF * 20)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.1 - self.属性2选择_BUFF / 100, BUFF魔攻per=1.1 - self.属性2选择_BUFF / 100, BUFF独立per=1.1 - self.属性2选择_BUFF / 100)
        self.属性描述 += 属性.觉醒增加(一觉力智=120 - self.属性3选择_BUFF * 10)

class 装备193(装备):
    名称 = '时间回溯之针'
    模式 = 0
    所属套装 = '时空旅行者'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    体力 = 120
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '百分比力智：'
    属性1范围 = [4, 1, 1]
    属性1选择 = 0
    属性2描述 = '所有属性强化 +'
    属性2范围 = [20, 12, 4]
    属性2选择 = 0
    属性3描述 = '物理/魔法/独立 +'
    属性3范围 = [100, 10, 10]
    属性3选择 = 0
    属性4描述 = '最终伤害：'
    属性4范围 = [8, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.28)
        self.属性描述 += 属性.百分比力智加成(0.12)
        self.属性描述 += 属性.技能冷却缩减(50, 50, 0.15)
        self.属性描述 += 属性.技能冷却缩减(85, 85, 0.15)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.百分比力智加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]) / 100)
        self.属性描述 += 属性.所有属性强化加成(self.属性2范围[0]-self.属性2选择*self.属性2范围[2])
        self.属性描述 += 属性.三攻固定加成(self.属性3范围[0]-self.属性3选择*self.属性3范围[2])
        self.属性描述 += 属性.最终伤害加成((self.属性4范围[0]-self.属性4选择*self.属性4范围[2]) / 100)  
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.1)
        self.属性描述 += 属性.释放速度增加(0.15)
        pass
    # 专属属性
    属性1描述_BUFF = '一觉力智：'
    属性1范围_BUFF = [4, 1, 1]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = '转职被动Lv+'
    属性2范围_BUFF = [5, 3, 1]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = '一觉力智：'
    属性3范围_BUFF = [110, 20, 10]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = 'BUFF三攻：'
    属性4范围_BUFF = [10, 3, 1]  # 最大值 最小值 间隔
    属性4选择_BUFF = 0
    
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=230)
        self.属性描述 += 属性.被动增加(转职被动智力=242)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.07, BUFF智力per=1.07)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.觉醒增加(一觉力智per=1.04 - self.属性1选择_BUFF / 100)
        self.属性描述 += 属性.被动增加(转职被动Lv=5 - self.属性2选择_BUFF)
        self.属性描述 += 属性.被动增加(守护恩赐Lv=5 - self.属性2选择_BUFF)
        self.属性描述 += 属性.觉醒增加(一觉力智=110 - self.属性3选择_BUFF * 10)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.1 - self.属性4选择_BUFF / 100, BUFF魔攻per=1.1 - self.属性4选择_BUFF / 100, BUFF独立per=1.1 - self.属性4选择_BUFF / 100)

class 装备194(装备):
    名称 = '响彻天地的咆哮'
    模式 = 0
    所属套装 = '穿透命运的呐喊'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    体力 = 120
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '技能攻击力：'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '附加伤害：'
    属性2范围 = [4, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比力智：'
    属性3范围 = [7, 1, 1]
    属性3选择 = 0
    属性4描述 = '百分比三攻：'
    属性4范围 = [12, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.12)
        self.属性描述 += 属性.最终伤害加成(0.18)
        self.属性描述 += 属性.技能攻击力加成(0.06)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.技能攻击力加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]) / 100)
        self.属性描述 += 属性.附加伤害加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.百分比力智加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        self.属性描述 += 属性.百分比三攻加成((self.属性4范围[0]-self.属性4选择*self.属性4范围[2]) / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.08)
        self.属性描述 += 属性.移动速度增加(0.08)
        self.属性描述 += 属性.释放速度增加(0.12)
        pass
    # 专属属性
    属性1描述_BUFF = '转职被动：'
    属性1范围_BUFF = [160, 120, 20]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = '一觉力智：'
    属性2范围_BUFF = [4, 1, 1]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = 'BUFF三攻：'
    属性3范围_BUFF = [7, 1, 1]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = 'BUFF力智：'
    属性4范围_BUFF = [12, 1, 1]  # 最大值 最小值 间隔
    属性4选择_BUFF = 0
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=220)
        self.属性描述 += 属性.被动增加(转职被动智力=250)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08, BUFF智力per=1.08)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.被动增加(守护恩赐体精=160 - self.属性1选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(转职被动智力=160 - self.属性1选择_BUFF * 20)
        self.属性描述 += 属性.觉醒增加(一觉力智per=1.04 - self.属性2选择_BUFF / 100) 
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.07 - self.属性3选择_BUFF / 100, BUFF魔攻per=1.07 - self.属性3选择_BUFF / 100, BUFF独立per=1.07 - self.属性3选择_BUFF / 100)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.12 - self.属性4选择_BUFF / 100, BUFF智力per=1.12 - self.属性4选择_BUFF / 100)

class 装备195(装备):
    名称 = '狂乱之逆转宿命'
    模式 = 0
    所属套装 = '狂乱追随者'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    体力 = 120
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '伤害增加：'
    属性1范围 = [10, 1, 1]
    属性1选择 = 0
    属性2描述 = '所有属性强化 +'
    属性2范围 = [32, 4, 4]
    属性2选择 = 0
    属性3描述 = '暴击伤害：'
    属性3范围 = [12, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.3)
        self.属性描述 += 属性.技能攻击力加成(0.11)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.伤害增加加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]) / 100)
        self.属性描述 += 属性.所有属性强化加成(self.属性2范围[0]-self.属性2选择*self.属性2范围[2])
        self.属性描述 += 属性.暴击伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass  
    # 专属属性
    属性1描述_BUFF = '一觉力智：'
    属性1范围_BUFF = [110, 20, 10]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = 'BUFF三攻：'
    属性2范围_BUFF = [8, 1, 1]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = 'BUFF力智：'
    属性3范围_BUFF = [12, 1, 1]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '无'
    属性4范围_BUFF = [0, 0, 0]  # 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=220)
        self.属性描述 += 属性.被动增加(转职被动智力=250)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08, BUFF智力per=1.08)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.觉醒增加(一觉力智=110 - self.属性1选择_BUFF * 20)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.08 - self.属性2选择_BUFF / 100, BUFF魔攻per=1.08 - self.属性2选择_BUFF / 100, BUFF独立per=1.08 - self.属性2选择_BUFF / 100)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.12 - self.属性3选择_BUFF / 100, BUFF智力per=1.12 - self.属性3选择_BUFF / 100)

class 装备196(装备):
    名称 = '肯那兹：精神燎原之火'
    模式 = 0
    所属套装 = '上古尘封术士'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    精神 = 117
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.2)
        self.属性描述 += 属性.附加伤害加成(0.12)
        self.属性描述 += 属性.所有属性强化加成(25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=277)
        self.属性描述 += 属性.被动增加(转职被动智力=151)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.06)

class 装备197(装备):
    名称 = '驱散月光之黎明'
    模式 = 0
    所属套装 = '破晓曦光'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    精神 = 117
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.05  + 0.01 * min(13, 属性.获取强化(self.部位)))
        self.属性描述 += 属性.百分比三攻加成(0.06)
        self.属性描述 += 属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 50, 70, 1)
        self.属性描述 += 属性.技能恢复加成(35, 45, 0.30)   
        pass
    def 其它属性(self, 属性):
        pass   
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 50, 70, 1)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=154)
        self.属性描述 += 属性.被动增加(转职被动智力=151)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.06)

class 装备198(装备):
    名称 = '四叶草之初心'
    模式 = 0
    所属套装 = '幸运三角'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    精神 = 117
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.07)
        self.属性描述 += 属性.百分比三攻加成(0.07)
        self.属性描述 += 属性.伤害增加加成(0.07)
        self.属性描述 += 属性.暴击伤害加成(0.07)
        self.属性描述 += 属性.最终伤害加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass   
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=264)
        self.属性描述 += 属性.被动增加(转职被动智力=151)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.06)

class 装备199(装备):
    名称 = '冷焰之冰-温蒂妮'
    模式 = 0
    所属套装 = '精灵使的权能'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    精神 = 117
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(38)
        self.属性描述 += 属性.百分比三攻加成(0.27)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=264)
        self.属性描述 += 属性.被动增加(转职被动智力=151)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.06)

class 装备200(装备):
    名称 = '堕落世界树之生命'
    模式 = 0
    所属套装 = '深渊窥视者'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    精神 = 117
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.4)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=166)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFFLv=1)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.06)

class 装备201(装备):
    名称 = '引路者的四季项链'
    模式 = 0
    所属套装 = '圣者的黄昏'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    精神 = 117
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.35)
        self.属性描述 += 属性.技能冷却缩减(1, 45, 0.10)
        self.属性描述 += 属性.技能冷却缩减(60, 80, 0.10)
        self.属性描述 += 属性.技能冷却缩减(90, 95, 0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.1)
        pass       
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=248)
        self.属性描述 += 属性.被动增加(转职被动智力=128)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.06)

class 装备202(装备):
    名称 = '悲痛者项链'
    模式 = 0
    所属套装 = '坎坷命运'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    精神 = 117
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.1)
        self.属性描述 += 属性.最终伤害加成(0.28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.04)
        self.属性描述 += 属性.移动速度增加(0.04)
        self.属性描述 += 属性.释放速度增加(0.06)
        if 属性.装备检查('地狱边缘'):
            self.属性描述 += '<font color="#00A2E8">装备地狱边缘时</font><br>'
            self.属性描述 += 属性.攻击速度增加(-0.01)
            self.属性描述 += 属性.移动速度增加(-0.01)
            self.属性描述 += 属性.释放速度增加(-0.015)
        if 属性.装备检查('悲情者遗物'):
            self.属性描述 += '<font color="#00A2E8">装备悲情者遗物时</font><br>'
            self.属性描述 += 属性.攻击速度增加(-0.01)
            self.属性描述 += 属性.移动速度增加(-0.01)
            self.属性描述 += 属性.释放速度增加(-0.015)
        pass
        
    精神 = 117
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=264)
        self.属性描述 += 属性.被动增加(转职被动智力=151)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.06)

class 装备203(装备):
    名称 = '激狂之怒'
    模式 = 0
    所属套装 = '吞噬愤怒'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    精神 = 117
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.3)
        self.属性描述 += 属性.持续伤害加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=264)
        self.属性描述 += 属性.被动增加(转职被动智力=151)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.06)

class 装备204(装备):
    名称 = '盖柏：完美的均衡'
    模式 = 0
    所属套装 = '上古尘封术士'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        
        self.属性描述 += 属性.附加伤害加成(0.12)
        self.属性描述 += 属性.所有属性强化加成(25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.1)
        self.属性描述 += 属性.释放速度增加(0.15)
        pass     
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比力智加成(0.2,2)
        pass    
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=266)
        self.属性描述 += 属性.被动增加(转职被动智力=86)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.08)

class 装备205(装备):
    名称 = '寂静无言之露珠'
    模式 = 0
    所属套装 = '破晓曦光'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.01 * min(13, 属性.获取强化(self.部位)))
        self.属性描述 += 属性.所有属性强化加成(30)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 75, 85, 1)
        self.属性描述 += 属性.技能恢复加成(60, 80, 0.30) 
        pass
    def 其它属性(self, 属性):
        pass  
    def 变换属性(self,属性):
        self.属性描述 += 属性.伤害增加加成(0.05,2)
        pass    
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 75, 85, 1)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=181)
        self.属性描述 += 属性.被动增加(转职被动智力=86)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.06)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.06)

class 装备206(装备):
    名称 = '红兔之祝福'
    模式 = 0
    所属套装 = '幸运三角'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.07)
        self.属性描述 += 属性.百分比三攻加成(0.07)
        self.属性描述 += 属性.伤害增加加成(0.07)
        self.属性描述 += 属性.最终伤害加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass    
    def 变换属性(self,属性):
        self.属性描述 += 属性.暴击伤害加成(0.07,2)
        pass 
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=266)
        self.属性描述 += 属性.被动增加(转职被动智力=86)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.08)

class 装备207(装备):
    名称 = '祝福之风-西尔芙'
    模式 = 0
    所属套装 = '精灵使的权能'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(38)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.04)
        self.属性描述 += 属性.移动速度增加(0.04)
        self.属性描述 += 属性.释放速度增加(0.06)
        pass   
    def 变换属性(self,属性):
        self.属性描述 += 属性.最终伤害加成(0.27,2)
        pass 
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=266)
        self.属性描述 += 属性.被动增加(转职被动智力=86)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.08)

class 装备208(装备):
    名称 = '支配黑暗之环'
    模式 = 0
    所属套装 = '地狱求道者'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.20)
        pass
    def 其它属性(self, 属性):
        pass    
    def 变换属性(self,属性):
        self.属性描述 += 属性.暴击伤害加成(0.20,2)
        pass    
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=299)
        self.属性描述 += 属性.被动增加(转职被动智力=115)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.08)

class 装备209(装备):
    名称 = '次元穿越者之印'
    模式 = 0
    所属套装 = '次元旅行者'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.18)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 60, 80, 1)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.释放速度增加(0.15)
        pass   
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比力智加成(0.14,2)
        pass      
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 60, 80, 1)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=246)
        self.属性描述 += 属性.被动增加(转职被动智力=92)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.08)

class 装备210(装备):
    名称 = '命运的捉弄'
    模式 = 0
    所属套装 = '天命无常'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        if '天命无常[2]' in 属性.套装栏:
            if 属性.天命无常 == 0:
                if 属性.装备检查('命运反抗者'):
                    self.属性描述 += 属性.伤害增加加成(0.11)
                else :
                    self.属性描述 += 属性.伤害增加加成(0.10)
            if 属性.天命无常 == 1:
                self.属性描述 += 属性.伤害增加加成(0.05)
            elif 属性.天命无常 >= 2:
                self.属性描述 += 属性.伤害增加加成(0.11)
        # self.属性描述 += 属性.最终伤害加成(0.06)
        self.属性描述 += 属性.技能攻击力加成(0.19)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass 
    def 变换属性(self,属性):
        self.属性描述 += 属性.最终伤害加成(0.06,2)
        pass  
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=263)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.08)

class 装备211(装备):
    名称 = '蓬勃生命的落幕'
    模式 = 0
    所属套装 = '悲剧的残骸'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        
        if 属性.悲剧的残骸 == 0:
            if 属性.装备检查('心痛如绞的诀别'):
                self.属性描述 += 属性.附加伤害加成(0.106)
            else:
                self.属性描述 += 属性.附加伤害加成(0.10)
        if 属性.悲剧的残骸 == 1:
            if 属性.装备检查('心痛如绞的诀别'):
                self.属性描述 += 属性.附加伤害加成(0.10)
            else:
                self.属性描述 += 属性.附加伤害加成(0.08)
        if 属性.悲剧的残骸 == 2:
            self.属性描述 += 属性.附加伤害加成(0.10)
        if 属性.悲剧的残骸 == 3:
            self.属性描述 += 属性.附加伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.悲剧的残骸 == 0:
            self.属性描述 += 属性.攻击速度增加(0.021)
        if 属性.悲剧的残骸 >= 2:
            self.属性描述 += 属性.攻击速度增加(0.03)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.暴击伤害加成(0.27,2)
        pass  
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=266)
        self.属性描述 += 属性.被动增加(转职被动智力=86)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.08)      
#endregion


# region 智慧产物
class 装备245(装备):
    名称 = '噙毒手套'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    体力 = 117
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    属性1描述 = '暴击伤害:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '暴击伤害:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.暴击伤害加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2])/100)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2])/100)
        if 改造等级 >= 7:
            self.属性描述 += 属性.暴击伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2])/100)  
    def 城镇属性(self, 属性):
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += 属性.暴击伤害加成(0.28)
        if 属性.获取改造(self.部位) >= 4:
            self.属性描述 += 属性.技能攻击力加成(0.10)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(8 * 属性.获取改造(self.部位))
        self.属性描述 += 属性.暴击伤害加成(0.02*属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.物理暴击率增加(0.08)
        self.属性描述 += 属性.魔法暴击率增加(0.08)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '物理暴击率 +8%<br>'
        temp += '魔法暴击率 +8%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '所有属性强化 +%d<br>' % (8 * 改造等级)
            temp += '暴击伤害 +%d<br>' % (2 * 改造等级)
        if 改造等级 >= 1:
            temp += '暴击伤害 +28%<br>'
        if 改造等级 >= 4:
            temp += '技能攻击力 +10%<br>'
        if 属性.产物升级 == 1:
            属性.装备描述 = 1
            self.产物升级(属性)
            temp += self.属性描述
            属性.装备描述 = 0
        return temp      

class 装备246(装备):
    名称 = '先知者的预言'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    精神 = 117
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    属性1描述 = '伤害增加:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '伤害增加:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.伤害增加加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2])/100)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2])/100)
        if 改造等级 >= 7:
            self.属性描述 += 属性.伤害增加加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2])/100)
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += 属性.百分比力智加成(0.18)
        if 属性.获取改造(self.部位) >= 4:
            if 属性.先知者的预言 == 0:
                self.属性描述 += 属性.属性附加加成(0.05 * 0.35)
                self.属性描述 += 属性.技能攻击力加成(0 + (0.10 * 0.35 + 0.15 * 0.3))
            if 属性.先知者的预言 == 1:
                self.属性描述 += 属性.属性附加加成(0.05)
            if 属性.先知者的预言 == 2:
                self.属性描述 += 属性.技能攻击力加成(0.10)
            if 属性.先知者的预言 == 3:
                self.属性描述 += 属性.技能攻击力加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.1)
        self.属性描述 += 属性.移动速度增加(0.1)
        self.属性描述 += 属性.释放速度增加(0.15)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '伤害增加 +%d%%<br>' % (4*改造等级)
        if 改造等级 >= 1:
            temp += '百分比力智 +18%<br>'
        if 改造等级 >= 4:
            if 属性.先知者的预言 == 0:
                temp += '属性附加 +{:.2f}%<br>'.format(0.05 * 0.35 * 100, 3)
                temp += '技能攻击力 +{:.2f}%<br>'.format((0.10 * 0.35 + 0.15 * 0.3)* 100)
            if 属性.先知者的预言 == 1:
                temp += '属性附加 +5%<br>'
            if 属性.先知者的预言 == 2:
                temp += '技能攻击力 +10%<br>'
            if 属性.先知者的预言 == 3:
                temp += '技能攻击力 +15%<br>'
        if 属性.产物升级 == 1:
            属性.装备描述 = 1
            self.产物升级(属性)
            temp += self.属性描述
            属性.装备描述 = 0
        return temp

class 装备247(装备):
    名称 = '骸麒之戒'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    属性1描述 = '附加伤害:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '附加伤害:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.附加伤害加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2])/100)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2])/100)
        if 改造等级 >= 7:
            self.属性描述 += 属性.附加伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2])/100)  
    def 城镇属性(self, 属性):
        if 属性.获取改造(self.部位) >= 5:
            self.属性描述 += 属性.附加伤害加成(0.53)
        if 属性.获取改造(self.部位) >= 1 and 属性.获取改造(self.部位) < 5:
            self.属性描述 += 属性.附加伤害加成(0.35)
        pass
    def 进图属性(self, 属性):
        属性.力量 += 30 * 属性.获取改造(self.部位)
        属性.智力 += 30 * 属性.获取改造(self.部位)
        self.属性描述 += 属性.附加伤害加成(0.02*属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '力量 +{}<br>'.format(30 * 改造等级)
            temp += '智力 +{}<br>'.format(30 * 改造等级)
            temp += '附加伤害 +{}%<br>'.format(2*改造等级)
        if 改造等级 >= 5:
            temp += '附加伤害 +53%<br>'
        if 改造等级>= 1 and 改造等级 < 5:
            temp += '附加伤害 +35%<br>'
        if 属性.产物升级 == 1:
            属性.装备描述 = 1
            self.产物升级(属性)
            temp += self.属性描述
            属性.装备描述 = 0
        return temp     

class 装备528(装备):
    名称 = '无言的愤怒'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    体力 = 117
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    属性1描述 = '所有属性强化:'
    属性1范围 = [12, 4, 4]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '所有属性强化:'
    属性3范围 = [12, 4, 4]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.所有属性强化加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]))
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2])/100)
        if 改造等级 >= 7:
            self.属性描述 += 属性.所有属性强化加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2])) 
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(16 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += 属性.百分比力智加成(0.05)
            self.属性描述 += 属性.技能攻击力加成(0.13)
        if 属性.获取改造(self.部位) >= 4:
            self.属性描述 += 属性.属性附加加成(0.05)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '所有属性强化 +%d<br>' % (16 * 改造等级)
        if 改造等级 >= 1:
            temp += '力量、智力 +5%<br>'
            temp += '技能攻击力 +13%<br>'
        if 改造等级 >= 4:
            temp += '属性附加伤害 +5%<br>'
        if 属性.产物升级 == 1:
            属性.装备描述 = 1
            self.产物升级(属性)
            temp += self.属性描述
            属性.装备描述 = 0
        return temp   
    def 城镇属性_BUFF(self, 属性):
        属性.体精固定加成(20 * 属性.获取改造(self.部位))
        属性.力智固定加成(20 * 属性.获取改造(self.部位))
    def BUFF属性(self, 属性):
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += '<font color="#FF8200">改造属性(+' + str(属性.获取改造(self.部位)) + ')：</font><br>'
            self.属性描述 += 属性.BUFF增加(BUFFLv=1)
            self.属性描述 += 属性.BUFF增加(BUFF力量per=1.03, BUFF智力per=1.03)
            self.属性描述 += 属性.觉醒增加(一觉力智=20)
            self.属性描述 += 属性.被动增加(守护恩赐体精=100)
            self.属性描述 += 属性.被动增加(转职被动智力=40)
        if 属性.获取改造(self.部位) >= 4:
            self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04, BUFF智力per=1.04)
            self.属性描述 += 属性.觉醒增加(一觉力智=30)
            self.属性描述 += 属性.被动增加(守护恩赐体精=20)
            self.属性描述 += 属性.被动增加(转职被动智力=60)

class 装备529(装备):
    名称 = '无形的象征'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    精神 = 117
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    属性1描述 = '伤害增加:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '伤害增加:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.伤害增加加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2])/100)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2])/100)
        if 改造等级 >= 7:
            self.属性描述 += 属性.伤害增加加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2])/100)
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += 属性.伤害增加加成(0.12)
            self.属性描述 += 属性.附加伤害加成(0.1)
        if 属性.获取改造(self.部位) >= 4:
            self.属性描述 += 属性.持续伤害加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '伤害增加 +%d%%<br>' % (4*改造等级)
        if 改造等级 >= 1:
            temp += '伤害增加 +12%<br>'
            temp += '附加伤害 +10%<br>'
        if 改造等级 >= 4:
            temp += '持续伤害 +10%<br>'
        if 属性.产物升级 == 1:
            属性.装备描述 = 1
            self.产物升级(属性)
            temp += self.属性描述
            属性.装备描述 = 0
        return temp
    def 城镇属性_BUFF(self, 属性):
        属性.体精固定加成(20 * 属性.获取改造(self.部位))
        属性.力智固定加成(20 * 属性.获取改造(self.部位))
    def BUFF属性(self, 属性):
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += '<font color="#FF8200">改造属性(+' + str(属性.获取改造(self.部位)) + ')：</font><br>'
            self.属性描述 += 属性.觉醒增加(一觉Lv=1)
            self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.06)
            self.属性描述 += 属性.被动增加(守护恩赐体精=100)
        if 属性.获取改造(self.部位) >= 4:
            self.属性描述 += 属性.BUFF增加(BUFFLv=1)
            self.属性描述 += 属性.觉醒增加(一觉力智=35)

class 装备530(装备):
    名称 = '无念的戒指'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    属性1描述 = '附加伤害:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '附加伤害:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.附加伤害加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2])/100)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2])/100)
        if 改造等级 >= 7:
            self.属性描述 += 属性.附加伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2])/100)   
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 4:
            self.属性描述 += 属性.附加伤害加成(0.1)
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += 属性.所有属性强化加成(40)
            self.属性描述 += 属性.伤害增加加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '技能攻击力 +{}%<br>'.format(4 * 改造等级)
        if 改造等级>= 1:
            temp += '所有属性强化 +40<br>'
            temp += '伤害增加 +10%<br>'
        if 改造等级 >= 4:
            temp += '附加伤害 +10%<br>'
        if 属性.产物升级 == 1:
            属性.装备描述 = 1
            self.产物升级(属性)
            temp += self.属性描述
            属性.装备描述 = 0
        return temp  
    def 城镇属性_BUFF(self, 属性):
        属性.体精固定加成(20 * 属性.获取改造(self.部位))
        属性.力智固定加成(20 * 属性.获取改造(self.部位))
    def BUFF属性(self, 属性):
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += '<font color="#FF8200">改造属性(+' + str(属性.获取改造(self.部位)) + ')：</font><br>'
            self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08, BUFF智力per=1.08)
            self.属性描述 += 属性.觉醒增加(一觉力智=15)
            self.属性描述 += 属性.被动增加(守护恩赐体精=100)
        if 属性.获取改造(self.部位) >= 4:
            self.属性描述 += 属性.觉醒增加(一觉Lv=1)
            self.属性描述 += 属性.BUFF增加(BUFF力量per=1.05, BUFF智力per=1.05)
            self.属性描述 += 属性.被动增加(守护恩赐体精=30)
#endregion

# region 普雷
class 装备336(装备):
    名称 = '暗黑之云：被吞噬的太阳'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 45
    体力 = 112
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(28)
        self.属性描述 += 属性.技能攻击力加成(0.18)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +45<br>'
        temp += '所有属性强化 +28<br>'
        temp += '技能攻击力 +18%<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=170)
        self.属性描述 += 属性.被动增加(转职被动智力=300)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
    def 装备描述_BUFF(self, 属性):
        temp = ''
        if 属性.角色 == '圣职者(女)':
            temp += '[勇气祝福]力量、智力 +4%<br>'
            temp += '[启示：圣歌]智力 +300<br>'
        elif 属性.角色 == '圣职者(男)':
            temp += '体力 +112<br>'
            temp += '[荣誉祝福]力量、智力 +4%<<br>'
            temp += '[守护恩赐]体力、精神 +170<br>'
        elif 属性.角色 == '魔法师(女)':
            temp += '[禁忌诅咒]力量、智力 +4%<<br>'
            temp += '[人偶操纵者]智力 +300<br>'
        return temp

class 装备337(装备):
    名称 = '暗黑之潮：分裂的太阳'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 45
    精神 = 112
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(24)
        self.属性描述 += 属性.百分比三攻加成(0.22)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +45<br>'
        temp += '所有属性强化 +24<br>'
        temp += '百分比三攻 +22%<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=164)
        self.属性描述 += 属性.被动增加(转职被动智力=151)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.04)
    def 装备描述_BUFF(self, 属性):
        temp = ''
        if 属性.角色 == '圣职者(女)':
            temp += '智力 +45<br>'
            temp += '[勇气祝福]物理攻击力增加量 +4%<br>'
            temp += '[启示：圣歌]智力 +151<br>'
        elif 属性.角色 == '圣职者(男)':
            temp += '精神 +112<br>'
            temp += '[荣誉祝福]物理攻击力增加量 +4%<<br>'
            temp += '[守护恩赐]体力、精神 +164<br>'
        elif 属性.角色 == '魔法师(女)':
            temp += '智力 +45<br>'
            temp += '[禁忌诅咒]物理攻击力增加量 +4%<<br>'
            temp += '[人偶操纵者]智力 +151<br>'
        return temp

class 装备338(装备):
    名称 = '暗黑之炎：被蚕食的太阳'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 67
    智力 = 67
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(34)
        self.属性描述 += 属性.技能攻击力加成(0.16)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +67<br>'
        temp += '智力 +67<br>'
        temp += '所有属性强化 +34<br>'
        temp += '技能攻击力 +16%<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=216)
        self.属性描述 += 属性.被动增加(转职被动智力=136)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
    def 装备描述_BUFF(self, 属性):
        temp = ''
        if 属性.角色 == '圣职者(女)':
            temp += '智力 +67<br>'
            temp += '[勇气祝福]力量、智力 +4%<br>'
            temp += '[启示：圣歌]智力 +136<br>'
        elif 属性.角色 == '圣职者(男)':
            temp += '[荣誉祝福]力量、智力 +4%<<br>'
            temp += '[守护恩赐]体力、精神 +216<br>'
        elif 属性.角色 == '魔法师(女)':
            temp += '智力 +67<br>'
            temp += '[禁忌诅咒]力量、智力 +4%<<br>'
            temp += '[人偶操纵者]智力 +136<br>'
        return temp

class 装备339(装备):
    名称 = '暗黑之云：被吞噬的大地'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 45
    智力 = 0
    体力 = 112
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(28)
        self.属性描述 += 属性.技能攻击力加成(0.14)
        self.属性描述 += 属性.技能等级加成('所有', 1, 48, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +45<br>'
        temp += '所有属性强化 +28<br>'
        temp += '技能攻击力 +14%<br>'
        temp += 'Lv1-48 技能等级+1<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 1, 48, 1)

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(转职被动智力=102)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
    def 装备描述_BUFF(self, 属性):
        temp = ''
        if 属性.角色 == '圣职者(女)':
            temp += '[勇气祝福]力量、智力 +4%<br>'
            temp += '[启示：圣歌]智力 +102<br>'
        elif 属性.角色 == '圣职者(男)':
            temp += '体力 +112<br>'
            temp += '[荣誉祝福]力量、智力 +4%<<br>'
        elif 属性.角色 == '魔法师(女)':
            temp += '[禁忌诅咒]力量、智力 +4%<<br>'
            temp += '[人偶操纵者]智力 +102<br>'
        temp += 'Lv1-48 技能等级 +1<br>'
        return temp

class 装备340(装备):
    名称 = '暗黑之潮：分裂的大地'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 45
    精神 = 112
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(24)
        self.属性描述 += 属性.百分比三攻加成(0.18)
        self.属性描述 += 属性.技能等级加成('所有', 60, 80, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +45<br>'
        temp += '所有属性强化 +24<br>'
        temp += '百分比三攻 +18%<br>'
        temp += 'Lv60-80 技能等级+1<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 60, 80, 1)

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=154)
        self.属性描述 += 属性.被动增加(转职被动智力=131)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.04)
    def 装备描述_BUFF(self, 属性):
        temp = ''
        if 属性.角色 == '圣职者(女)':
            temp += '智力 +45<br>'
            temp += '[勇气祝福]物理攻击力增加量 +4%<br>'
            temp += '[启示：圣歌]智力 +131<br>'
        elif 属性.角色 == '圣职者(男)':
            temp += '精神 +112<br>'
            temp += '[荣誉祝福]物理攻击力增加量 +4%<<br>'
            temp += '[守护恩赐]体力、精神 +154<br>'
        elif 属性.角色 == '魔法师(女)':
            temp += '智力 +45<br>'
            temp += '[禁忌诅咒]物理攻击力增加量 +4%<<br>'
            temp += '[人偶操纵者]智力 +131<br>'
        temp += 'Lv60-80 技能等级 +1<br>'
        return temp

class 装备341(装备):
    名称 = '暗黑之炎：被蚕食的大地'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 67
    智力 = 67
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(34)
        self.属性描述 += 属性.技能攻击力加成(0.10)
        self.属性描述 += 属性.技能等级加成('所有', 80, 85, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +67<br>'
        temp += '智力 +67<br>'
        temp += '所有属性强化 +34<br>'
        temp += '技能攻击力 +10%<br>'
        temp += 'Lv80-85 技能等级+1<br>'
        return temp

class 装备342(装备):
    名称 = '暗黑之云：被吞噬的天空'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 45
    智力 = 0
    体力 = 112
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(28)
        self.属性描述 += 属性.技能攻击力加成(0.14)
        self.属性描述 += 属性.技能冷却缩减(60, 80, 0.12)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.03)
        self.属性描述 += 属性.释放速度增加(0.045)
        self.属性描述 += 属性.移动速度增加(0.03)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +45<br>'
        temp += '所有属性强化 +28<br>'
        temp += '技能攻击力 +14%<br>'
        temp += 'Lv60-80 技能CD-12%<br>'
        temp += '攻击速度 +3%<br>'
        temp += '释放速度 +4.5%<br>'
        temp += '移动速度 +3%<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=140)
        self.属性描述 += 属性.被动增加(转职被动智力=280)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
    def 装备描述_BUFF(self, 属性):
        temp = ''
        if 属性.角色 == '圣职者(女)':
            temp += '[勇气祝福]力量、智力 +4%<br>'
            temp += '[启示：圣歌]智力 +280<br>'
        elif 属性.角色 == '圣职者(男)':
            temp += '体力 +112<br>'
            temp += '[荣誉祝福]力量、智力 +4%<<br>'
            temp += '[守护恩赐]体力、精神 +140<br>'
        elif 属性.角色 == '魔法师(女)':
            temp += '[禁忌诅咒]力量、智力 +4%<<br>'
            temp += '[人偶操纵者]智力 +280<br>'
        return temp

class 装备343(装备):
    名称 = '暗黑之潮：分裂的天空'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 45
    精神 = 112
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(24)
        self.属性描述 += 属性.百分比三攻加成(0.19)
        self.属性描述 += 属性.技能冷却缩减(1, 30, 0.15)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.03)
        self.属性描述 += 属性.释放速度增加(0.045)
        self.属性描述 += 属性.移动速度增加(0.03)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +45<br>'
        temp += '所有属性强化 +24<br>'
        temp += '百分比三攻 +19%<br>'
        temp += 'Lv1-30 技能CD-15%<br>'
        temp += '攻击速度 +3%<br>'
        temp += '释放速度 +4.5%<br>'
        temp += '移动速度 +3%<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=144)
        self.属性描述 += 属性.被动增加(转职被动智力=131)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.04)
        try:
            属性.技能栏[属性.技能序号['人偶操控者']].额外智力 -= 15
        except:
            pass
    def 装备描述_BUFF(self, 属性):
        temp = ''
        if 属性.角色 == '圣职者(女)':
            temp += '智力 +45<br>'
            temp += '[勇气祝福]力量、智力 +4%<br>'
            temp += '[启示：圣歌]智力 +131<br>'
        elif 属性.角色 == '圣职者(男)':
            temp += '精神 +112<br>'
            temp += '[荣誉祝福]力量、智力 +4%<<br>'
            temp += '[守护恩赐]体力、精神 +144<br>'
        elif 属性.角色 == '魔法师(女)':
            temp += '智力 +45<br>'
            temp += '[禁忌诅咒]力量、智力 +4%<<br>'
            temp += '[人偶操纵者]智力 +116<br>'
        return temp

class 装备344(装备):
    名称 = '暗黑之炎：被蚕食的天空'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 67
    智力 = 67
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(34)
        self.属性描述 += 属性.技能攻击力加成(0.11)
        self.属性描述 += 属性.技能冷却缩减(35, 45, 0.15)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.03)
        self.属性描述 += 属性.释放速度增加(0.045)
        self.属性描述 += 属性.移动速度增加(0.03)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +67<br>'
        temp += '智力 +67<br>'
        temp += '所有属性强化 +34<br>'
        temp += '技能攻击力 +11%<br>'
        temp += 'Lv35-45 技能CD-15%<br>'
        temp += '攻击速度 +3%<br>'
        temp += '释放速度 +4.5%<br>'
        temp += '移动速度 +3%<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=196)
        self.属性描述 += 属性.被动增加(转职被动智力=116)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
        try:
            属性.技能栏[属性.技能序号['人偶操控者']].额外智力 -= 15
        except:
            pass
    def 装备描述_BUFF(self, 属性):
        temp = ''
        if 属性.角色 == '圣职者(女)':
            temp += '智力 +67<br>'
            temp += '[勇气祝福]力量、智力 +4%<br>'
            temp += '[启示：圣歌]智力 +116<br>'
        elif 属性.角色 == '圣职者(男)':
            temp += '[荣誉祝福]力量、智力 +4%<<br>'
            temp += '[守护恩赐]体力、精神 +196<br>'
        elif 属性.角色 == '魔法师(女)':
            temp += '智力 +67<br>'
            temp += '[禁忌诅咒]力量、智力 +4%<<br>'
            temp += '[人偶操纵者]智力 +101<br>'
        return temp
# endregion

# region  100改造&传说
class 装备354(装备):
    名称 = '轮回·维度冲击臂环'
    模式 = 1
    所属套装 = '智慧产物'
    所属套装2 = '维度崩坏'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    体力 = 117
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    属性1描述 = '暴击伤害:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '暴击伤害:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.暴击伤害加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2])/100)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2])/100)
        if 改造等级 >= 7:
            self.属性描述 += 属性.暴击伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2])/100) 
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.12)
        self.属性描述 += 属性.技能攻击力加成(0.16)
        self.属性描述 += 属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        属性.力量 += 25 * 属性.获取改造(self.部位)
        属性.智力 += 25 * 属性.获取改造(self.部位)
        self.属性描述 += 属性.暴击伤害加成(0.02 * 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '百分比力智 +12%<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +28<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '力量 +' + str(25 * 改造等级) + '<br>'
            temp += '智力 +' + str(25 * 改造等级) + '<br>'
            temp += '暴击伤害+' + str(2 * 改造等级) + '%<br>'
        if 属性.产物升级 == 1:
            属性.装备描述 = 1
            self.产物升级(属性)
            temp += self.属性描述
            属性.装备描述 = 0
        return temp
    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        属性.智力 += 25 * 属性.获取改造(self.部位)
        属性.体力 += 25 * 属性.获取改造(self.部位)
        属性.精神 += 25 * 属性.获取改造(self.部位)
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=262)
        self.属性描述 += 属性.被动增加(转职被动智力=285)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.05)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.05)
    def 装备描述_BUFF(self, 属性):
        temp = ''
        改造等级 = 属性.获取改造(self.部位)
        if 属性.角色 == '圣职者(女)':
            temp += '智力 +100<br>'
            temp += '[勇气祝福]力量、智力 +5%<br>'
            temp += '[启示：圣歌]智力 +285<br>'
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '智力 +{}<br>'.format(25 * 改造等级)
        elif 属性.角色 == '圣职者(男)':
            temp += '体力 +117<br>'
            temp += '[荣誉祝福]力量、智力 +5%<br>'
            temp += '[守护恩赐]体力、精神 +262<br>'
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '体力 +{}<br>'.format(25 * 改造等级)
            temp += '精神 +{}<br>'.format(25 * 改造等级)
        elif 属性.角色 == '魔法师(女)':
            temp += '智力 +100<br>'
            temp += '[禁忌诅咒]力量、智力 +5%<br>'
            temp += '[人偶操纵者]智力 +285<br>'
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '智力 +{}<br>'.format(25 * 改造等级)
        return temp

class 装备355(装备):
    名称 = '时空：维度冲击臂环'
    模式 = 1
    所属套装 = '维度崩坏'
    等级 = 100
    品质 = '传说'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 46
    智力 = 0
    体力 = 114
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.10)
        self.属性描述 += 属性.技能攻击力加成(0.16)
        self.属性描述 += 属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +46<br>'
        temp += '百分比力智 +10%<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +28<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=222)
        self.属性描述 += 属性.被动增加(转职被动智力=345)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.05)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.05)
    def 装备描述_BUFF(self, 属性):
        temp = ''
        改造等级 = 属性.获取改造(self.部位)
        if 属性.角色 == '圣职者(女)':
            temp += '[勇气祝福]力量、智力 +5%<br>'
            temp += '[启示：圣歌]智力 +345<br>'
        elif 属性.角色 == '圣职者(男)':
            temp += '体力 +114<br>'
            temp += '[荣誉祝福]力量、智力 +5%<br>'
            temp += '[守护恩赐]体力、精神 +222<br>'
        elif 属性.角色 == '魔法师(女)':
            temp += '[禁忌诅咒]力量、智力 +5%<br>'
            temp += '[人偶操纵者]智力 +345<br>'
        return temp

class 装备356(装备):
    名称 = '维度定位项链'
    模式 = 1
    所属套装 = '维度崩坏'
    等级 = 100
    品质 = '传说'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 46
    精神 = 114
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.22)
        self.属性描述 += 属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +46<br>'
        temp += '百分比三攻 +22%<br>'
        temp += '所有属性强化 +28<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.03)
        self.属性描述 += 属性.被动增加(守护恩赐体精=156)
        self.属性描述 += 属性.被动增加(转职被动智力=143)
    def 装备描述_BUFF(self, 属性):
        temp = ''
        改造等级 = 属性.获取改造(self.部位)
        if 属性.角色 == '圣职者(女)':
            temp += '智力 +46<br>'
            temp += '[勇气祝福]物理攻击力增加量 +3%<br>'
            temp += '[启示：圣歌]智力 +143<br>'
        elif 属性.角色 == '圣职者(男)':
            temp += '精神 +114<br>'
            temp += '[荣誉祝福]物理攻击力增加量 +3%<br>'
            temp += '[守护恩赐]体力、精神 +156<br>'
        elif 属性.角色 == '魔法师(女)':
            temp += '智力 +46<br>'
            temp += '[禁忌诅咒]物理攻击力增加量 +3%<br>'
            temp += '[人偶操纵者]智力 +143<br>'
        return temp

class 装备357(装备):
    名称 = '维度粉碎戒指'
    模式 = 1
    所属套装 = '维度崩坏'
    等级 = 100
    品质 = '传说'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 68
    智力 = 68
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.05)
        self.属性描述 += 属性.技能攻击力加成(0.16)
        self.属性描述 += 属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +68<br>'
        temp += '智力 +68<br>'
        temp += '附加伤害 +5%<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +28<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=205)
        self.属性描述 += 属性.被动增加(转职被动智力=129)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.03)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.03)
    def 装备描述_BUFF(self, 属性):
        temp = ''
        改造等级 = 属性.获取改造(self.部位)
        if 属性.角色 == '圣职者(女)':
            temp += '智力 +68<br>'
            temp += '[勇气祝福]力量、智力 +3%<br>'
            temp += '[启示：圣歌]智力 +129<br>'
        elif 属性.角色 == '圣职者(男)':
            temp += '[荣誉祝福]力量、智力 +3%<br>'
            temp += '[守护恩赐]体力、精神 +205<br>'
        elif 属性.角色 == '魔法师(女)':
            temp += '智力 +68<br>'
            temp += '[禁忌诅咒]力量、智力 +3%<br>'
            temp += '[人偶操纵者]智力 +129<br>'
        return temp

class 装备368(装备):
    名称 = '维度冲击臂环'
    模式 = 1
    所属套装 = '维度崩坏'
    等级 = 100
    品质 = '传说'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 46
    智力 = 0
    体力 = 114
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.05)
        self.属性描述 += 属性.技能攻击力加成(0.16)
        self.属性描述 += 属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +46<br>'
        temp += '百分比力智 +5%<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +28<br>'
        return temp
    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.03)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.03)
        self.属性描述 += 属性.被动增加(守护恩赐体精=162)
        self.属性描述 += 属性.被动增加(转职被动智力=285)
    def 装备描述_BUFF(self, 属性):
        temp = ''
        if 属性.角色 == '圣职者(女)':
            temp += '[勇气祝福]力量、智力 +3%<br>'
            temp += '[启示：圣歌]智力 +285<br>'
        elif 属性.角色 == '圣职者(男)':
            temp += '体力 +114<br>'
            temp += '[荣誉祝福]力量、智力 +3%<br>'
            temp += '[守护恩赐]体力、精神 +162<br>'
        elif 属性.角色 == '魔法师(女)':
            temp += '[禁忌诅咒]力量、智力 +3%<br>'
            temp += '[人偶操纵者]智力 +285<br>'
        return temp
# endregion

# region 改造低级SS
class 装备390(装备):
    名称 = '碧水红潮'
    所属套装 = '江山如画'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 67
    智力 = 67
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(16)
        self.属性描述 += 属性.百分比三攻加成(0.18)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.05)
        self.属性描述 += 属性.移动速度增加(0.08)
        self.属性描述 += 属性.释放速度增加(0.12)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +67<br>'
        temp += '智力 +67<br>'
        temp += '所有属性强化 +16<br>'
        temp += '百分比三攻 +18%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +8%<br>'
        temp += '释放速度 +12%<br>'
        return temp

class 装备391(装备):
    名称 = '雪浪风尘'
    所属套装 = '江山如画'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 45
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(16)
        self.属性描述 += 属性.技能攻击力加成(0.18)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.05)
        self.属性描述 += 属性.移动速度增加(0.08)
        self.属性描述 += 属性.释放速度增加(0.12)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +45<br>'
        temp += '所有属性强化 +16<br>'
        temp += '技能攻击力 +18%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +8%<br>'
        temp += '释放速度 +12%<br>'
        return temp

class 装备392(装备):
    名称 = '千寻一醉'
    所属套装 = '江山如画'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 45
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(16)
        self.属性描述 += 属性.百分比力智加成(0.18)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.05)
        self.属性描述 += 属性.移动速度增加(0.08)
        self.属性描述 += 属性.释放速度增加(0.12)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +45<br>'
        temp += '所有属性强化 +16<br>'
        temp += '百分比力智 +18%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +8%<br>'
        temp += '释放速度 +12%<br>'
        return temp

class 装备397(改造产物):
    名称 = '天衍万物'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    关联套装 = '万物的生灭[3]'
    属性1描述 = '暴击伤害:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '暴击伤害:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.暴击伤害加成(0.3)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成(0.03)
        if 改造等级 >= 7:
            self.属性描述 += 属性.暴击伤害加成(0.03)  
    def 改造属性(self, 属性, x):
        self.属性描述 += 属性.暴击伤害加成(0.02 * x)
        if x >= 3:
            self.属性描述 += 属性.附加伤害加成(0.13)
            self.属性描述 += 属性.百分比三攻加成(0.25)
        if x >= 4:
            self.属性描述 += 属性.所有属性强化加成(60)
            self.属性描述 += 属性.百分比力智加成(0.37)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.10)
        self.属性描述 += 属性.释放速度增加(0.15)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '攻击速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '暴击伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 3:
           temp += '附加伤害 +13%<br>'
           temp += '百分比三攻 +25%<br>'
        if 改造等级 >= 4:
           temp += '所有属性强化 +60<br>'
           temp += '百分比力智 +37%<br>'
        return temp

class 装备404(装备):
    名称 = '流逝轮回的时间'
    所属套装 = '流逝轮回的记忆'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 45
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.10)
    def 进图属性(self, 属性):
        属性.力量 += 100
        属性.智力 += 100
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.物理暴击率增加(0.05)
        self.属性描述 += 属性.魔法暴击率增加(0.05)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +145<br>'
        temp += '智力 +100<br>'
        temp += '附加伤害 +10%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp    

class 装备405(装备):
    名称 = '流逝轮回的思念'
    所属套装 = '流逝轮回的记忆'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 45
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(42)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.物理暴击率增加(0.05)
        self.属性描述 += 属性.魔法暴击率增加(0.05)
        self.属性描述 += 属性.攻击速度增加(0.05)
        self.属性描述 += 属性.释放速度增加(0.05)
        self.属性描述 += 属性.移动速度增加(0.05)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +45<br>'
        temp += '所有属性强化 +42<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '释放速度 +5%<br>'
        temp += '移动速度 +5%<br>'
        return temp      

class 装备406(装备):
    名称 = '流逝轮回的启迪'
    所属套装 = '流逝轮回的记忆'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 67
    智力 = 67
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.08)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.05)
        pass
    名称 = '流逝轮回的启迪'
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +67<br>'
        temp += '智力 +67<br>'
        temp += '技能攻击力 +8%<br>'
        temp += '攻击速度 +5%<br>'
        return temp   

class 装备421(改造产物):
    名称 = '全能霸域'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    关联套装 = '霸域英豪[5]'
    属性1描述 = '最终伤害:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '最终伤害:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.最终伤害加成(0.3)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成(0.03)
        if 改造等级 >= 7:
            self.属性描述 += 属性.最终伤害加成(0.03) 
    def 改造属性(self, 属性, x):
        self.属性描述 += 属性.最终伤害加成(0.02 * x)
        if x >= 1:
            self.属性描述 += 属性.所有属性强化加成(50)
            self.属性描述 += 属性.技能等级加成('所有', 50, 85, 2)
            self.属性描述 += 属性.技能等级加成('所有', 100, 100, 2)
        if x >= 3:
            self.属性描述 += 属性.百分比力智加成(0.19)
            self.属性描述 += 属性.伤害增加加成(0.22)
            self.属性描述 += 属性.技能攻击力加成(0.28)
        if x >= 5:
            self.属性描述 += 属性.百分比力智加成(0.63)
        pass
    def 基础属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.40)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '百分比三攻 +40%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '最终伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '所有属性强化 +50<br>'
           temp += 'Lv50-85 技能等级+2<br>'
           temp += 'Lv100   技能等级+2<br>'
        if 改造等级 >= 3:
           temp += '百分比力智 +19%<br>'
           temp += '伤害增加 +22%<br>'
           temp += '技能攻击力 +28%<br>'
        if 改造等级 >= 5:
           temp += '百分比力智 +63%<br>'
        return temp     

class 装备427(改造产物):
    名称 = '百变千蛛'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    关联套装 = '千蛛碎影[5]'
    属性1描述 = '伤害增加:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '伤害增加:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.伤害增加加成(0.3)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成(0.03)
        if 改造等级 >= 7:
            self.属性描述 += 属性.伤害增加加成(0.03)
    def 改造属性(self, 属性, x):
        self.属性描述 += 属性.伤害增加加成(0.02 * x)
        if x >= 1:
            self.属性描述 += 属性.附加伤害加成(0.18)
            self.属性描述 += 属性.最终伤害加成(0.40)
        if x >= 3:
            self.属性描述 += 属性.暴击伤害加成(0.38)
            self.属性描述 += 属性.技能攻击力加成(0.30)
        if x >= 5:
            self.属性描述 += 属性.百分比力智加成(0.45)
            self.属性描述 += 属性.百分比三攻加成(0.10)
        pass
    def 基础属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(119)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '所有属性强化 +119<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '伤害增加 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '附加伤害 +18%<br>'
           temp += '最终伤害 +40%<br>'
        if 改造等级 >= 3:
           temp += '暴击伤害 +38%<br>'
           temp += '技能攻击力 +30%<br>'
        if 改造等级 >= 5:
           temp += '百分比力智 +45%<br>'
           temp += '百分比三攻 +10%<br>'
        return temp   

class 装备439(改造产物):
    名称 = '天御万物'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    关联套装 = '天御之灾[5]'
    属性1描述 = '最终伤害:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '最终伤害:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.最终伤害加成(0.3)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成(0.03)
        if 改造等级 >= 7:
            self.属性描述 += 属性.最终伤害加成(0.03)   
    def 改造属性(self, 属性, x):
        self.属性描述 += 属性.最终伤害加成(0.02 * x)
        if x >= 1:
            self.属性描述 += 属性.百分比力智加成(0.28)
        if x >= 3:
            self.属性描述 += 属性.所有属性强化加成 (50)
            self.属性描述 += 属性.百分比三攻加成(0.32)
            self.属性描述 += 属性.技能攻击力加成(0.20)
        if x >= 5:
            self.属性描述 += 属性.最终伤害加成(0.17)
            self.属性描述 += 属性.属性附加加成(0.25)
            self.属性描述 += 属性.伤害增加加成(0.18)
        pass
    def 基础属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.18)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '伤害增加 +18%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '最终伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '百分比力智 +28%<br>'
        if 改造等级 >= 3:
           temp += '所有属性强化 +50<br>'
           temp += '百分比三攻 +32%<br>'
           temp += '技能攻击力 +20%<br>'
        if 改造等级 >= 5:
           temp += '最终伤害 +17%<br>'
           temp += '属性附加 +25%<br>'
           temp += '伤害增加 +18%<br>'
        return temp    

class 装备457(改造产物):
    名称 = '杀戮之决'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    关联套装 = '杀意决[5]'
    属性1描述 = '最终伤害:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '最终伤害:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.最终伤害加成(0.3)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成(0.03)
        if 改造等级 >= 7:
            self.属性描述 += 属性.最终伤害加成(0.03)   
    def 改造属性(self, 属性, x):
        self.属性描述 += 属性.最终伤害加成(0.02 * x)
        if x >= 1:
            self.属性描述 += 属性.技能等级加成('所有', 50, 50, 3)
            self.属性描述 += 属性.技能等级加成('所有', 85, 85, 3)
            self.属性描述 += 属性.技能等级加成('所有', 100, 100, 1)
            self.属性描述 += 属性.所有属性强化加成(50)
        if x >= 3:
            self.属性描述 += 属性.百分比力智加成(0.13)
            self.属性描述 += 属性.伤害增加加成(0.30)
            self.属性描述 += 属性.暴击伤害加成(0.30)
        if x >= 5:
            self.属性描述 += 属性.最终伤害加成(0.10)
            self.属性描述 += 属性.技能攻击力加成(0.42)
        pass
    def 基础属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.38)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '百分比三攻 +38%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '最终伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += 'Lv50  技能等级+3<br>'
           temp += 'Lv85  技能等级+3<br>'
           temp += 'Lv100 技能等级+1<br>'
           temp += '所有属性强化 +50<br>'
        if 改造等级 >= 3:
           temp += '百分比力智 +13%<br>'
           temp += '伤害增加 +30%<br>'       
           temp += '暴击伤害 +30%<br>'
        if 改造等级 >= 5:
           temp += '最终伤害 +10%<br>'
           temp += '技能攻击力 +42%<br>'
        return temp     

class 装备463(改造产物):
    名称 = '逝魔之痕'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    关联套装 = '逝魔之力[5]'
    属性1描述 = '暴击伤害:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '暴击伤害:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.暴击伤害加成(0.3)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成(0.03)
        if 改造等级 >= 7:
            self.属性描述 += 属性.暴击伤害加成(0.03)  
    def 改造属性(self, 属性, x):
        self.属性描述 += 属性.暴击伤害加成(0.02 * x)
        if x >= 1:
            self.属性描述 += 属性.百分比力智加成(0.40)
        if x >= 3:
            self.属性描述 += 属性.所有属性强化加成(42)
            self.属性描述 += 属性.伤害增加加成(0.30)
            self.属性描述 += 属性.技能攻击力加成(0.28)
        if x >= 5:
            self.属性描述 += 属性.技能等级加成('所有', 1, 85, 2)
            self.属性描述 += 属性.技能等级加成('所有', 100, 100, 2)
            self.属性描述 += 属性.技能攻击力加成(0.18)
        pass
    def 基础属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.35)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '最终伤害 +35%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '暴击伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '百分比力智 +40%<br>'
        if 改造等级 >= 3:
           temp += '所有属性强化 +42<br>'
           temp += '伤害增加 +30%<br>'
           temp += '技能攻击力 +28%<br>'
        if 改造等级 >= 5:
           temp += 'Lv1-85 技能等级+2<br>'
           temp += 'Lv100  技能等级+2<br>'
           temp += '技能攻击力 +18%<br>'
        return temp       

class 装备470(装备):
    名称 = '冰雪公主的霜语手镯'
    所属套装 = '冰雪公主的霜语首饰'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 41
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.冰属性强化加成(22)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +41<br>'
        temp += '冰属性强化 +22<br>'
        return temp    

class 装备471(装备):
    名称 = '冰雪公主的霜语项链'
    所属套装 = '冰雪公主的霜语首饰'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 41
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.冰属性强化加成(30)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +41<br>'
        temp += '冰属性强化 +30<br>'
        return temp       

class 装备472(装备):
    名称 = '冰雪公主的霜语戒指'
    所属套装 = '冰雪公主的霜语首饰'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 62
    智力 = 62
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.冰属性强化加成(30)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +62<br>'
        temp += '智力 +62<br>'
        temp += '冰属性强化 +30<br>'
        return temp       

class 装备474(装备):
    名称 = '精炼的毁伤魔石手环'
    所属套装 = '精炼的异界魔石首饰'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 96
    智力 = 55
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.07)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +96<br>'
        temp += '智力 +55<br>'
        temp += '技能攻击力 +7%<br>'
        return temp       

class 装备475(装备):
    名称 = '精炼的混沌魔石项链'
    所属套装 = '精炼的异界魔石首饰'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 41
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.黄字 = max(属性.黄字, 0.20)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +41<br>'
        temp += '黄字 +20%(取最高值)<br>'
        return temp     

class 装备476(装备):
    名称 = '精炼的遗忘魔石戒指'
    所属套装 = '精炼的异界魔石首饰'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 62
    智力 = 62
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +62<br>'
        temp += '智力 +62<br>'
        return temp      
# endregion

#region 100光环传说
class 装备479(装备):
    名称 = '轮回·先贤的馈赠手镯'
    模式 = 1
    所属套装 = '智慧产物'
    所属套装2 = '先贤的馈赠'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.16)
        self.属性描述 += 属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        属性.力量 += 25 * 属性.获取改造(self.部位)
        属性.智力 += 25 * 属性.获取改造(self.部位)
        self.属性描述 += 属性.技能攻击力加成(0.02 * 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +28<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '力量 +' + str(25 * 改造等级) + '<br>'
            temp += '智力 +' + str(25 * 改造等级) + '<br>'
            temp += '技能攻击力 +' + str(2 * 改造等级) + '%<br>'
        return temp      

class 装备480(装备):
    名称 = '时空：先贤的馈赠手镯'
    模式 = 1
    所属套装 = '先贤的馈赠'
    等级 = 100
    品质 = '传说'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 46
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.16)
        self.属性描述 += 属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +46<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +28<br>'
        return temp      

class 装备481(装备):
    名称 = '先贤的馈赠项链'
    模式 = 1
    所属套装 = '先贤的馈赠'
    等级 = 100
    品质 = '传说'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 46
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.20)
        self.属性描述 += 属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +46<br>'
        temp += '百分比三攻 +20%<br>'
        temp += '所有属性强化 +28<br>'
        return temp       

class 装备482(装备):
    名称 = '先贤的馈赠戒指'
    模式 = 1
    所属套装 = '先贤的馈赠'
    等级 = 100
    品质 = '传说'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 68
    智力 = 68
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.16)
        self.属性描述 += 属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +68<br>'
        temp += '智力 +68<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +28<br>'
        return temp      
class 装备489(装备):
    名称 = '先贤的馈赠手镯'
    模式 = 1
    所属套装 = '先贤的馈赠'
    等级 = 100
    品质 = '传说'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 46
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.16)
        self.属性描述 += 属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +46<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +28<br>'
        return temp
# endregion