from .basic_equ import *

# region  100SS特殊
class 装备212(装备):
    名称 = '军神的遗书'
    模式 = 0
    所属套装 = '军神的隐秘遗产'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.05)
        pass      
    def 变换属性(self,属性):
        self.属性描述 += 属性.伤害增加加成(0.25,3)
        pass
    体力 = 46
    精神 = 46
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=208)
        self.属性描述 += 属性.被动增加(转职被动智力=124)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.06)
        self.属性描述 += 属性.觉醒增加(一觉Lv=1)

class 装备213(装备):
    名称 = '末日之刻'
    模式 = 0
    所属套装 = '时间战争的残骸'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.12)
        self.属性描述 += "Lv1-100 技能CD -2% *6<br>"
        for i in range(6):
            属性.技能冷却缩减(1, 100, 0.02)
        pass
    def 进图属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比力智加成(0.15,3)
        pass
    def 其它属性(self, 属性):
        pass       
    体力 = 46
    精神 = 46
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 48, 50, 1)
        self.属性描述 += 属性.被动增加(守护恩赐体精=195)
        self.属性描述 += 属性.被动增加(转职被动智力=98)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.06)

class 装备214(装备):
    名称 = '高贵之天'
    模式 = 0
    所属套装 = '灵宝：世间真理'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.12)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.1)
        pass      
    def 变换属性(self,属性):
        self.属性描述 += 属性.最终伤害加成(0.12,3)
        pass
    体力 = 46
    精神 = 46
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=195)
        self.属性描述 += 属性.被动增加(转职被动智力=130)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.06)
        self.属性描述 += 属性.觉醒增加(一觉Lv=1)
class 装备215(装备):
    名称 = '能量回流控制者'
    模式 = 0
    所属套装 = '能量主宰'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.1)
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比力智加成(0.16,3)
        pass      
    体力 = 46
    精神 = 46
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=208)
        self.属性描述 += 属性.被动增加(转职被动智力=124)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.06)
        self.属性描述 += 属性.觉醒增加(一觉Lv=1)

class 装备216(装备):
    名称 = '暗黑术士亲笔古书'
    模式 = 0
    所属套装 = '深渊窥视者'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.24)
        pass
    def 其它属性(self, 属性):
        pass     
    def 变换属性(self,属性):
        self.属性描述 += 属性.百分比三攻加成(0.18,3)
        pass   
    体力 = 46
    精神 = 46
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=208)
        self.属性描述 += 属性.被动增加(转职被动智力=156)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.06)
        self.属性描述 += 属性.觉醒增加(一觉Lv=1)
class 装备217(装备):
    名称 = '引路者的旅行书'
    模式 = 0
    所属套装 = '圣者的黄昏'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        
        self.属性描述 += 属性.所有属性强化加成(64)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.1)
        self.属性描述 += 属性.释放速度增加(0.15)
        pass  
    def 变换属性(self,属性):
        self.属性描述 += 属性.暴击伤害加成(0.22,3)
        pass       
    体力 = 46
    精神 = 46
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=195)
        self.属性描述 += 属性.被动增加(转职被动智力=108)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.06)
        self.属性描述 += 属性.觉醒增加(一觉Lv=1)

class 装备218(装备):
    名称 = '悲情者遗物'
    模式 = 0
    所属套装 = '坎坷命运'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.16)
        self.属性描述 += 属性.百分比三攻加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 变换属性(self,属性):
        self.属性描述 += 属性.伤害增加加成(0.11,3)
        pass   
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.04)
        self.属性描述 += 属性.移动速度增加(0.04)
        self.属性描述 += 属性.释放速度增加(0.06)
        if 属性.装备检查('地狱边缘'):
            self.属性描述 += '<font color="#00A2E8">装备地狱边缘时</font><br>'
            self.属性描述 += 属性.攻击速度增加(-0.01)
            self.属性描述 += 属性.移动速度增加(-0.01)
            self.属性描述 += 属性.释放速度增加(-0.015)
        if 属性.装备检查('悲痛者项链'):
            self.属性描述 += '<font color="#00A2E8">装备悲痛者项链时</font><br>'
            self.属性描述 += 属性.攻击速度增加(-0.01)
            self.属性描述 += 属性.移动速度增加(-0.01)
            self.属性描述 += 属性.释放速度增加(-0.015)
        pass        
    体力 = 46
    精神 = 46
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=208)
        self.属性描述 += 属性.被动增加(转职被动智力=124)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.06)
        self.属性描述 += 属性.觉醒增加(一觉Lv=1)

class 装备219(装备):
    名称 = '失控之怒'
    模式 = 0
    所属套装 = '吞噬愤怒'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.持续伤害加成(0.1)
        # self.属性描述 += 属性.最终伤害加成(0.3)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass     
    def 变换属性(self,属性):
        self.属性描述 += 属性.最终伤害加成(0.3,3)
        pass    
    体力 = 46
    精神 = 46
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=208)
        self.属性描述 += 属性.被动增加(转职被动智力=124)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.06)
        self.属性描述 += 属性.觉醒增加(一觉Lv=1)

class 装备220(装备):
    名称 = '军神的庇护宝石'
    模式 = 0
    所属套装 = '军神的隐秘遗产'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.21)
        self.属性描述 += 属性.技能攻击力加成(0.17)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass 
    体力 = 69
    精神 = 69
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=177)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFFLv=1)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.08)
        self.属性描述 += 属性.觉醒增加(一觉Lv=1)
class 装备221(装备):
    名称 = '时之漩涡'
    模式 = 0
    所属套装 = '时间战争的残骸'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.24)
        self.属性描述 += 属性.最终伤害加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass      
    体力 = 69
    精神 = 69
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=170)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.技能等级加成('所有', 1, 50, 1)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.08)
class 装备222(装备):
    名称 = '智慧之地'
    模式 = 0
    所属套装 = '灵宝：世间真理'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.12)
        self.属性描述 += 属性.最终伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.1)
        pass      
    体力 = 69
    精神 = 69
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=185)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.技能等级加成('所有', 30, 50, 1)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.08)

class 装备223(装备):
    名称 = '电光能量支配者'
    模式 = 0
    所属套装 = '能量主宰'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.13)
        self.属性描述 += 属性.技能攻击力加成(0.24)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.释放速度增加(0.15)
        pass      
    体力 = 69
    精神 = 69
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=174)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.06)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.06)
        self.属性描述 += 属性.技能等级加成('所有', 1, 50, 1)
class 装备224(装备):
    名称 = '暗黑术士的精髓'
    模式 = 0
    所属套装 = '黑魔法探求者'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.35)
        self.属性描述 += 属性.技能攻击力加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass       
    体力 = 69
    精神 = 69
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=195)
        self.属性描述 += 属性.被动增加(转职被动智力=95)
        self.属性描述 += 属性.BUFF增加(BUFFLv=1)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.08)
        self.属性描述 += 属性.觉醒增加(一觉Lv=1)
class 装备225(装备):
    名称 = '被困的时之沙'
    模式 = 0
    所属套装 = '时空旅行者'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.17)
        self.属性描述 += 属性.所有属性强化加成(80)
        self.属性描述 += 属性.技能冷却缩减(1, 45, 0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass      
    体力 = 69
    精神 = 69
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=164)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.技能等级加成('所有', 1, 50, 1)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.06)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.06)

class 装备226(装备):
    名称 = '寂寞的呼喊'
    模式 = 0
    所属套装 = '穿透命运的呐喊'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.23)
        self.属性描述 += 属性.技能攻击力加成(0.13)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
       
    体力 = 69
    精神 = 69
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 30, 50, 1)
        self.属性描述 += 属性.被动增加(守护恩赐体精=187)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.08)

class 装备227(装备):
    名称 = '狂乱之天灾降临'
    模式 = 0
    所属套装 = '狂乱追随者'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比三攻加成(0.2)
        self.属性描述 += 属性.伤害增加加成(0.2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass        
    体力 = 69
    精神 = 69
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=177)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFFLv=1)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.08)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.08)
        self.属性描述 += 属性.觉醒增加(一觉Lv=1)
class 装备228(装备):
    名称 = '军神的古怪耳环'
    模式 = 0
    所属套装 = '军神的隐秘遗产'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        if 属性.装备检查('军神的遗书'):
            self.属性描述 += 属性.百分比力智加成(0.10)
        self.属性描述 += 属性.百分比三攻加成(0.15)
        self.属性描述 += 属性.最终伤害加成(0.17)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('军神的遗书'):
            self.属性描述 += '<font color="#00A2E8">装备军神的遗书时</font><br>'
            self.属性描述 += 属性.移动速度增加(0.10)
        pass
    体力 = 69
    精神 = 69
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=176)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.06)

class 装备229(装备):
    名称 = '时之矛盾'
    模式 = 0
    所属套装 = '时间战争的残骸'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.15)
        self.属性描述 += 属性.暴击伤害加成(0.24)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    体力 = 69
    精神 = 69
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=174)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.06)
class 装备230(装备):
    名称 = '宽容之海'
    模式 = 0
    所属套装 = '灵宝：世间真理'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.16)
        self.属性描述 += 属性.附加伤害加成(0.1)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.05)
        self.属性描述 += 属性.移动速度增加(0.05)
        self.属性描述 += 属性.释放速度增加(0.225)
        pass      
    体力 = 69
    精神 = 69
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=161)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.06)
class 装备231(装备):
    名称 = '电磁能量传送者'
    模式 = 0
    所属套装 = '能量主宰'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.1)
        self.属性描述 += 属性.百分比三攻加成(0.12)
        if 属性.装备检查('能量回流控制者'):
            self.属性描述 += '<font color="#00A2E8">装备能量回流控制者时</font><br>'
            self.属性描述 += 属性.附加伤害加成(0.1)
        pass
    def 进图属性(self, 属性):
        if 属性.装备检查('电光能量支配者'):
            self.属性描述 += '<font color="#00A2E8">装备电光能量支配者时</font><br>'
            self.属性描述 += 属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        pass     
    体力 = 69
    精神 = 69
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=176)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.06)

class 装备232(装备):
    名称 = '无尽地狱黑暗之印'
    模式 = 0
    所属套装 = '地狱求道者'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.42)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass  
    体力 = 69
    精神 = 69
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=192)
        self.属性描述 += 属性.被动增加(转职被动智力=95)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.06)

class 装备233(装备):
    名称 = '次元流星坠'
    模式 = 0
    所属套装 = '次元旅行者'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.1)
        self.属性描述 += 属性.最终伤害加成(0.19)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 50, 50, 1)
        self.属性描述 += 属性.技能等级加成('所有', 85, 85, 1)
        self.属性描述 += 属性.技能等级加成('所有', 100, 100, 1)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.1)
        pass     
    体力 = 69
    精神 = 69
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 50, 50, 1)
        self.属性描述 += 属性.技能等级加成('所有', 85, 85, 1)
        self.属性描述 += 属性.技能等级加成('所有', 100, 100, 1)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=178)
        self.属性描述 += 属性.被动增加(转职被动智力=82)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.06)

class 装备234(装备):
    名称 = '命运挑战者'
    模式 = 0
    所属套装 = '天命无常'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.1)
        self.属性描述 += 属性.暴击伤害加成(0.22)
        if '天命无常[2]' in 属性.套装栏:
            if 属性.天命无常 == 0:
                self.属性描述 += 属性.最终伤害加成(0.091666667)
            elif 属性.天命无常 <=5:
                self.属性描述 += 属性.最终伤害加成(0.05)
            elif 属性.天命无常 == 6:
                self.属性描述 += 属性.最终伤害加成(0.30)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass        
    体力 = 69
    精神 = 69
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=181)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.06)

class 装备235(装备):
    名称 = '悲剧人生的归寂'
    模式 = 0
    所属套装 = '悲剧的残骸'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.15)
        self.属性描述 += 属性.暴击伤害加成(0.1)
        if 属性.悲剧的残骸 == 0:
            self.属性描述 += 属性.附加伤害加成(0.10)
        if 属性.悲剧的残骸 == 1:
            self.属性描述 += 属性.附加伤害加成(0.08)
        if 属性.悲剧的残骸 == 2:
            self.属性描述 += 属性.附加伤害加成(0.10)
        if 属性.悲剧的残骸 == 3:
            self.属性描述 += 属性.附加伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.悲剧的残骸 == 0:
            self.属性描述 += 属性.攻击速度增加(0.021)
        if 属性.悲剧的残骸 >= 2:
            self.属性描述 += 属性.攻击速度增加(0.03)
        pass     
    体力 = 69
    精神 = 69
    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=184)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.06)

class 装备236(装备):
    名称 = '军神的心之所念'
    模式 = 0
    所属套装 = '军神的隐秘遗产'
    等级 = 100
    品质 = '神话'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '附加伤害：'
    属性1范围 = [4, 1, 1]
    属性1选择 = 0
    属性2描述 = '百分比三攻：'
    属性2范围 = [9, 1, 1]
    属性2选择 = 0
    属性3描述 = '技能攻击力：'
    属性3范围 = [4, 1, 1]
    属性3选择 = 0
    属性4描述 = '最终伤害：'
    属性4范围 = [7, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.10)
        self.属性描述 += 属性.百分比三攻加成(0.15)
        self.属性描述 += 属性.最终伤害加成(0.17)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.附加伤害加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]) / 100)
        self.属性描述 += 属性.百分比三攻加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.技能攻击力加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        self.属性描述 += 属性.最终伤害加成((self.属性4范围[0]-self.属性4选择*self.属性4范围[2]) / 100)   
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.15)
        pass    
    体力 = 70
    精神 = 70

    # 专属属性
    属性1描述_BUFF = '一觉被动(160/140)+'
    属性1范围_BUFF = [60, 0, 20]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = '一觉力智：'
    属性2范围_BUFF = [90, 10, 10]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = '转职被动：'
    属性3范围_BUFF = [160, 100, 20]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '一觉力智'
    属性4范围_BUFF = [7, 1, 1]  # 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=176)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.06)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.被动增加(信念光环体精=220 - self.属性1选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(一觉被动力智=200 - self.属性1选择_BUFF * 20)
        self.属性描述 += 属性.觉醒增加(一觉力智=90 - self.属性2选择_BUFF * 10)
        self.属性描述 += 属性.被动增加(守护恩赐体精=160 - self.属性3选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(转职被动智力=160 - self.属性3选择_BUFF * 20)
        self.属性描述 += 属性.觉醒增加(一觉力智per=1.07 - self.属性4选择_BUFF / 100)

class 装备237(装备):
    名称 = '时之魅影'
    模式 = 0
    所属套装 = '时间战争的残骸'
    等级 = 100
    品质 = '神话'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '百分比三攻：'
    属性1范围 = [6, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力：'
    属性2范围 = [4, 1, 1]
    属性2选择 = 0
    属性3描述 = '附加伤害：'
    属性3范围 = [8, 1, 1]
    属性3选择 = 0
    属性4描述 = '百分比力智：'
    属性4范围 = [5, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.15)
        self.属性描述 += 属性.暴击伤害加成(0.14)
        self.属性描述 += 属性.技能攻击力加成(0.10)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.百分比三攻加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]) / 100)
        self.属性描述 += 属性.技能攻击力加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.附加伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        self.属性描述 += 属性.百分比力智加成((self.属性4范围[0]-self.属性4选择*self.属性4范围[2]) / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass     
    体力 = 70
    精神 = 70

    # 专属属性
    属性1描述_BUFF = '一觉力智'
    属性1范围_BUFF = [70, 20, 10]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = '转职被动：'
    属性2范围_BUFF = [200, 140, 20]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = 'BUFF力智：'
    属性3范围_BUFF = [11, 4, 1]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '一觉力智'
    属性4范围_BUFF = [6, 2, 1]  # 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=174)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.06)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.觉醒增加(一觉力智=70 - self.属性1选择_BUFF * 10)
        self.属性描述 += 属性.被动增加(守护恩赐体精=200 - self.属性2选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(转职被动智力=200 - self.属性2选择_BUFF * 20)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.11 - self.属性3选择_BUFF / 100, BUFF智力per=1.11 - self.属性3选择_BUFF / 100)
        self.属性描述 += 属性.觉醒增加(一觉力智per=1.06 - self.属性4选择_BUFF / 100)

class 装备238(装备):
    名称 = '永恒之海'
    模式 = 0
    所属套装 = '灵宝：世间真理'
    等级 = 100
    品质 = '神话'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '所有属性强化 +'
    属性1范围 = [40, 20, 4]
    属性1选择 = 0
    属性2描述 = '最终伤害：'
    属性2范围 = [8, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比力智：'
    属性3范围 = [5, 1, 1]
    属性3选择 = 0
    属性4描述 = '伤害增加：'
    属性4范围 = [4, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.1)
        self.属性描述 += 属性.伤害增加加成(0.16)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.所有属性强化加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]))
        self.属性描述 += 属性.最终伤害加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.百分比力智加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        self.属性描述 += 属性.伤害增加加成((self.属性4范围[0]-self.属性4选择*self.属性4范围[2]) / 100)      
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.15)
        self.属性描述 += 属性.移动速度增加(0.15)
        self.属性描述 += 属性.释放速度增加(0.375)
        pass   
    体力 = 70
    精神 = 70

    # 专属属性
    属性1描述_BUFF = '一觉力智'
    属性1范围_BUFF = [6, 1, 1]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = '一觉力智：'
    属性2范围_BUFF = [80, 10, 10]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = '转职被动：'
    属性3范围_BUFF = [300, 220, 20]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '一觉被动(100/80）'
    属性4范围_BUFF = [60, 0, 20]  # 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=161)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.06)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.觉醒增加(一觉力智per=1.06 - self.属性1选择_BUFF / 100)
        self.属性描述 += 属性.觉醒增加(一觉力智=80 - self.属性2选择_BUFF * 10)
        self.属性描述 += 属性.被动增加(守护恩赐体精=300 - self.属性3选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(转职被动智力=300 - self.属性3选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(信念光环体精=160 - self.属性4选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(一觉被动力智=140 - self.属性4选择_BUFF * 20)

       
class 装备239(装备):
    名称 = '等离子操控者'
    模式 = 0
    所属套装 = '能量主宰'
    等级 = 100
    品质 = '神话'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '伤害增加：'
    属性1范围 = [12, 1, 1]
    属性1选择 = 0
    属性2描述 = '力量/智力 +'
    属性2范围 = [220, 100, 20]
    属性2选择 = 0
    属性3描述 = '附加伤害：'
    属性3范围 = [12, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.1)
        self.属性描述 += 属性.百分比三攻加成(0.12)
        if 属性.装备检查('能量回流控制者'):
            self.属性描述 += '<font color="#00A2E8">装备能量回流控制者时</font><br>'
            self.属性描述 += 属性.附加伤害加成(0.1)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.伤害增加加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]) / 100)
        self.属性描述 += 属性.力智固定加成(x=(self.属性2范围[0]-self.属性2选择*self.属性2范围[2]))
        self.属性描述 += 属性.附加伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        pass
    def 进图属性(self, 属性):
        if 属性.装备检查('电光能量支配者'):
            self.属性描述 += '<font color="#00A2E8">装备电光能量支配者时</font><br>'
            self.属性描述 += 属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('能量回流控制者'):
            self.属性描述 += '<font color="#00A2E8">装备能量回流控制者时</font><br>'
            self.属性描述 += 属性.移动速度增加(0.1)
        pass      
    体力 = 70
    精神 = 70

    # 专属属性
    属性1描述_BUFF = 'BUFF三攻：'
    属性1范围_BUFF = [12, 1, 1]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = '守护恩赐/力智：'
    属性2范围_BUFF = [220, 100, 20]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = '一觉力智：'
    属性3范围_BUFF = [120, 10, 10]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '无'
    属性4范围_BUFF = [0, 0, 0]  # 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.06)
        self.属性描述 += 属性.被动增加(守护恩赐体精=176)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.12 - self.属性1选择_BUFF / 100, BUFF魔攻per=1.12 - self.属性1选择_BUFF / 100, BUFF独立per=1.12 - self.属性1选择_BUFF / 100)
        self.属性描述 += 属性.力智固定加成(x=220 - self.属性2选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(守护恩赐体精=220 - self.属性2选择_BUFF * 20)
        self.属性描述 += 属性.觉醒增加(一觉力智=120 - self.属性3选择_BUFF * 10)

class 装备240(装备):
    名称 = '永恒地狱黑暗之印'
    模式 = 0
    所属套装 = '地狱求道者'
    等级 = 100
    品质 = '神话'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '最终伤害：'
    属性1范围 = [12, 1, 1]
    属性1选择 = 0
    属性2描述 = '所有属性强化 +'
    属性2范围 = [40, 8, 4]
    属性2选择 = 0
    属性3描述 = '附加伤害：'
    属性3范围 = [9, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.42)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.最终伤害加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]) / 100)
        self.属性描述 += 属性.所有属性强化加成(self.属性2范围[0]-self.属性2选择*self.属性2范围[2])
        self.属性描述 += 属性.附加伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass      
    体力 = 70
    精神 = 70

    # 专属属性
    属性1描述_BUFF = 'BUFF力智：'
    属性1范围_BUFF = [12, 1, 1]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = '转职被动：'
    属性2范围_BUFF = [240, 80, 20]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = '一觉力智：'
    属性3范围_BUFF = [90, 10, 10]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '无'
    属性4范围_BUFF = [0, 0, 0]  # 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=192)
        self.属性描述 += 属性.被动增加(转职被动智力=95)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.06)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.12 - self.属性1选择_BUFF / 100, BUFF智力per=1.12 - self.属性1选择_BUFF / 100)
        self.属性描述 += 属性.被动增加(守护恩赐体精=240 - self.属性2选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(转职被动智力=240 - self.属性2选择_BUFF * 20)
        self.属性描述 += 属性.觉醒增加(一觉力智=90 - self.属性3选择_BUFF * 10)

class 装备241(装备):
    名称 = '次元穿越者之星'
    模式 = 0
    所属套装 = '次元旅行者'
    等级 = 100
    品质 = '神话'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '力量/智力 +'
    属性1范围 = [300, 20, 20]
    属性1选择 = 0
    属性2描述 = '暴击伤害：'
    属性2范围 = [11, 1, 1]
    属性2选择 = 0
    属性3描述 = '技能等级Lv60 -'
    属性3范围 = [100, 70, 5]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.19)
        self.属性描述 += 属性.暴击伤害加成(0.10)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.力智固定加成(x=(self.属性1范围[0]-self.属性1选择*self.属性1范围[2]))
        self.属性描述 += 属性.暴击伤害加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.技能等级加成('所有', 60, (self.属性3范围[0]-self.属性3选择*self.属性3范围[2]), 1)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 50, 50, 1)
        self.属性描述 += 属性.技能等级加成('所有', 85, 85, 1)
        self.属性描述 += 属性.技能等级加成('所有', 100, 100, 1)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.15)
        pass       
    体力 = 70
    精神 = 70

    # 专属属性
    属性1描述_BUFF = '守护恩赐/力智：'
    属性1范围_BUFF = [300, 20, 20]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = '一觉力智：'
    属性2范围_BUFF = [110, 10, 10]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = '一觉被动(60/40)+'
    属性3范围_BUFF = [100, 0, 20]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '无'
    属性4范围_BUFF = [0, 0, 0]  # 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 50, 50, 1)
        self.属性描述 += 属性.技能等级加成('所有', 85, 85, 1)
        self.属性描述 += 属性.技能等级加成('所有', 100, 100, 1)
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=178)
        self.属性描述 += 属性.被动增加(转职被动智力=82)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.06)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.被动增加(守护恩赐体精=300 - self.属性1选择_BUFF * 20)
        self.属性描述 += 属性.力智固定加成(x=300 - self.属性1选择_BUFF * 20)
        self.属性描述 += 属性.觉醒增加(一觉力智=110 - self.属性2选择_BUFF * 10)
        self.属性描述 += 属性.被动增加(信念光环体精=160 - self.属性3选择_BUFF * 20)
        self.属性描述 += 属性.被动增加(一觉被动力智=140 - self.属性3选择_BUFF * 20)
        self.属性描述 += 属性.技能等级加成('所有', 60, 100 - self.属性3选择_BUFF * 5, 1)

class 装备242(装备):
    名称 = '命运反抗者'
    模式 = 0
    所属套装 = '天命无常'
    等级 = 100
    品质 = '神话'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '物攻/魔攻/独立 +'
    属性1范围 = [120, 40, 10]
    属性1选择 = 0
    属性2描述 = '技能等级Lv25 -'
    属性2范围 = [45, 30, 5]
    属性2选择 = 0
    属性3描述 = '百分比力智：'
    属性3范围 = [4, 1, 1]
    属性3选择 = 0
    属性4描述 = '附加伤害：'
    属性4范围 = [7, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.22)
        self.属性描述 += 属性.百分比力智加成(0.1)
        if '天命无常[2]' in 属性.套装栏:
            if 属性.天命无常 == 0:
                self.属性描述 += 属性.最终伤害加成(0.10)
            elif 属性.天命无常 <=5:
                self.属性描述 += 属性.最终伤害加成(0.05)
            elif 属性.天命无常 == 6:
                self.属性描述 += 属性.最终伤害加成(0.30)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.三攻固定加成(x=(self.属性1范围[0]-self.属性1选择*self.属性1范围[2]))
        self.属性描述 += 属性.技能等级加成('所有', 1, (self.属性2范围[0]-self.属性2选择*self.属性2范围[2]), 1)
        self.属性描述 += 属性.百分比力智加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        self.属性描述 += 属性.附加伤害加成((self.属性4范围[0]-self.属性4选择*self.属性4范围[2]) / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass       
    体力 = 70
    精神 = 70

    # 专属属性
    属性1描述_BUFF = '一觉力智：'
    属性1范围_BUFF = [90, 10, 10]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = '一觉力智：'
    属性2范围_BUFF = [4, 1, 1]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = 'BUFF力智：'
    属性3范围_BUFF = [4, 1, 1]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = 'BUFF三攻：'
    属性4范围_BUFF = [7, 1, 1]  # 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=181)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.06)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.觉醒增加(一觉力智=90 - self.属性1选择_BUFF * 10)
        self.属性描述 += 属性.技能等级加成('所有', 1, 45 - self.属性2选择_BUFF * 5, 1)
        self.属性描述 += 属性.觉醒增加(一觉力智per=1.04 - self.属性2选择_BUFF / 100)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04 - self.属性3选择_BUFF / 100, BUFF智力per=1.04 - self.属性3选择_BUFF / 100)
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.07 - self.属性4选择_BUFF / 100, BUFF魔攻per=1.07 - self.属性4选择_BUFF / 100, BUFF独立per=1.07 - self.属性4选择_BUFF / 100)

class 装备243(装备):
    名称 = '心痛如绞的诀别'
    模式 = 0
    所属套装 = '悲剧的残骸'
    等级 = 100
    品质 = '神话'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '所有属性强化 +'
    属性1范围 = [16, 8, 4]
    属性1选择 = 0
    属性2描述 = '持续伤害：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '暴击伤害：'
    属性3范围 = [8, 1, 1]
    属性3选择 = 0
    属性4描述 = '力量/智力 +'
    属性4范围 = [140, 80, 20]
    属性4选择 = 0

    def 城镇属性(self, 属性):

        if 属性.悲剧的残骸 == 0:
            self.属性描述 += '<font color="#00A2E8">期望属性:</font><br>'
            self.属性描述 += 属性.附加伤害加成(0.106)
        if 属性.悲剧的残骸 == 1:
            self.属性描述 += 属性.附加伤害加成(0.10)
        if 属性.悲剧的残骸 == 2:
            self.属性描述 += 属性.附加伤害加成(0.10)
        if 属性.悲剧的残骸 == 3:
            self.属性描述 += 属性.附加伤害加成(0.12)        
        self.属性描述 += 属性.伤害增加加成(0.15)
        self.属性描述 += 属性.暴击伤害加成(0.1)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.所有属性强化加成(self.属性1范围[0]-self.属性1选择*self.属性1范围[2])
        self.属性描述 += 属性.持续伤害加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2]) / 100)
        self.属性描述 += 属性.暴击伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]) / 100)
        self.属性描述 += 属性.力智固定加成(x=(self.属性4范围[0]-self.属性4选择*self.属性4范围[2]))

        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.悲剧的残骸 == 0:
            self.属性描述 += '<font color="#00A2E8">期望属性:</font><br>'
            self.属性描述 += 属性.移动速度增加(0.0315)
        if 属性.悲剧的残骸 >= 2:
            self.属性描述 += 属性.移动速度增加(0.045)
        pass
    体力 = 70
    精神 = 70

    # 专属属性
    属性1描述_BUFF = 'BUFF三攻：'
    属性1范围_BUFF = [5, 3, 1]  # 最大值 最小值 间隔
    属性1选择_BUFF = 0
    属性2描述_BUFF = 'BUFF力智：'
    属性2范围_BUFF = [10, 1, 1]  # 最大值 最小值 间隔
    属性2选择_BUFF = 0
    属性3描述_BUFF = '一觉力智：'
    属性3范围_BUFF = [8, 1, 1]  # 最大值 最小值 间隔
    属性3选择_BUFF = 0
    属性4描述_BUFF = '守护恩赐/力智：'
    属性4范围_BUFF = [140, 40, 20]  # 间隔
    属性4选择_BUFF = 0

    def 城镇属性_BUFF(self, 属性):
        pass
    def 进图属性_BUFF(self, 属性):
        pass
    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=184)
        self.属性描述 += 属性.被动增加(转职被动智力=80)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.06)
        self.属性描述 += '<font color="#00A2E8">神话属性：</font><br>'
        self.属性描述 += 属性.BUFF增加(BUFF物攻per=1.05 - self.属性1选择_BUFF / 100, BUFF魔攻per=1.05 - self.属性1选择_BUFF / 100, BUFF独立per=1.05 - self.属性1选择_BUFF / 100)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.10 - self.属性2选择_BUFF / 100, BUFF智力per=1.10 - self.属性2选择_BUFF / 100)
        self.属性描述 += 属性.觉醒增加(一觉力智per=1.08 - self.属性3选择_BUFF / 100)
        self.属性描述 += 属性.被动增加(守护恩赐体精=140 - self.属性4选择_BUFF * 20)
        self.属性描述 += 属性.力智固定加成(x=140 - self.属性4选择_BUFF * 20)

# endregion

# region  智慧产物
class 装备248(装备):
    名称 = '窥视未来耳环'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    属性1描述 = '伤害增加:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '伤害增加:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.伤害增加加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2])/100)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2])/100)
        if 改造等级 >= 7:
            self.属性描述 += 属性.伤害增加加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2])/100) 
    def 城镇属性(self, 属性):
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += 属性.伤害增加加成(0.35)
        if 属性.获取改造(self.部位) >= 5:
            self.属性描述 += 属性.所有属性强化加成(40) 
    def 进图属性(self, 属性):
        属性.力量 += 40
        属性.物理攻击力 +=  40 * 属性.获取改造(self.部位)
        属性.魔法攻击力 +=  40 * 属性.获取改造(self.部位)
        属性.独立攻击力 +=  40 * 属性.获取改造(self.部位)
        self.属性描述 += 属性.伤害增加加成(0.02*属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
        if 改造等级 >= 1:
            temp += '伤害增加 +35%<br>'
        if 改造等级 >= 5:
            temp += '所有属性强化 +40<br>'
        temp += '物理攻击力 +{}<br>'.format(40 * 改造等级)
        temp += '魔法攻击力 +{}<br>'.format(40 * 改造等级)
        temp += '独立攻击力 +{}<br>'.format(40 * 改造等级)
        temp += '伤害增加 +{}%<br>'.format(2 * 改造等级)
        if 属性.产物升级 == 1:
            属性.装备描述 = 1
            self.产物升级(属性)
            temp += self.属性描述
            属性.装备描述 = 0
        return temp       

class 装备249(装备):
    名称 = '青面修罗的面具'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    属性1描述 = '所有属性强化:'
    属性1范围 = [12, 4, 4]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '所有属性强化:'
    属性3范围 = [12, 4, 4]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.所有属性强化加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2]))
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2])/100)
        if 改造等级 >= 7:
            self.属性描述 += 属性.所有属性强化加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2]))
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += 属性.技能等级加成('所有', 1, 85, 2)
            self.属性描述 += 属性.技能等级加成('所有', 100, 100, 2)
        if 属性.获取改造(self.部位) >= 4:
            self.属性描述 += 属性.百分比力智加成(0.08)
        self.属性描述 += 属性.所有属性强化加成(16 * 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.08)
        self.属性描述 += 属性.移动速度增加(0.08)
        self.属性描述 += 属性.释放速度增加(0.12)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '攻击速度 +8%<br>'
        temp += '移动速度 +8%<br>'
        temp += '释放速度 +12%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '所有属性强化 +{}<br>'.format(16 * 改造等级)
        if 改造等级 >= 1:
            temp += 'Lv1-85 技能等级+2<br>'
            temp += 'Lv100  技能等级+2<br>'
        if 改造等级 >= 4:
            temp += '百分比力智 +8%<br>'
        if 属性.产物升级 == 1:
            属性.装备描述 = 1
            self.产物升级(属性)
            temp += self.属性描述
            属性.装备描述 = 0
        return temp 
    def 进图属性_BUFF(self, 属性):
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += 属性.技能等级加成('所有', 1, 85, 2)
            self.属性描述 += 属性.技能等级加成('所有', 100, 100, 2)

class 装备250(装备):
    名称 = '赤鬼的次元石'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    属性1描述 = '暴击伤害:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '暴击伤害:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.暴击伤害加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2])/100)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2])/100)
        if 改造等级 >= 7:
            self.属性描述 += 属性.暴击伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2])/100)
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += 属性.百分比三攻加成(0.18)
        if 属性.获取改造(self.部位) >= 4:
            self.属性描述 += 属性.伤害增加加成(0.14)
        if 属性.装备检查('青面修罗的面具') or 属性.装备检查('噙毒手套'):
            self.属性描述 += 属性.附加伤害加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        if 属性.装备检查('青面修罗的面具') or 属性.装备检查('噙毒手套'):
            temp += '附加伤害 +7%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '暴击伤害 +{}%<br>'.format(4*改造等级)
        if 改造等级 >= 1:
            temp += '百分比三攻 +18%<br>'
        if 改造等级 >= 4:
            temp += '伤害增加 +14%<br>'
        if 属性.产物升级 == 1:
            属性.装备描述 = 1
            self.产物升级(属性)
            temp += self.属性描述
            属性.装备描述 = 0
        return temp        


class 装备531(装备):
    名称 = '支配者的王冠'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    体力 = 46
    精神 = 46
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    属性1描述 = '百分比三攻:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比三攻:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.百分比三攻加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2])/100)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2])/100)
        if 改造等级 >= 7:
            self.属性描述 += 属性.百分比三攻加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2])/100)
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.1)
        self.属性描述 += 属性.百分比三攻加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += 属性.百分比三攻加成(0.14)
            self.属性描述 += 属性.最终伤害加成(0.08)
        if 属性.获取改造(self.部位) >= 4:
            self.属性描述 += 属性.技能攻击力加成(0.1)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '移动速度 +10%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '百分比三攻 +{}%<br>'.format(4 * 改造等级)
        if 改造等级 >= 1:
            temp += '百分比三攻 +14%<br>'
            temp += '最终伤害 +8%<br>'
        if 改造等级 >= 4:
            temp += '技能攻击力 +10%<br>'
        if 属性.产物升级 == 1:
            属性.装备描述 = 1
            self.产物升级(属性)
            temp += self.属性描述
            属性.装备描述 = 0
        return temp       
    def 城镇属性_BUFF(self, 属性):
        属性.体精固定加成(20 * 属性.获取改造(self.部位))
        属性.力智固定加成(20 * 属性.获取改造(self.部位))
    def BUFF属性(self, 属性):
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += '<font color="#FF8200">改造属性(+' + str(属性.获取改造(self.部位)) + ')：</font><br>'
            self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.06)
            self.属性描述 += 属性.觉醒增加(一觉力智=65)
            self.属性描述 += 属性.被动增加(守护恩赐体精=100)
        if 属性.获取改造(self.部位) >= 4:
            self.属性描述 += 属性.BUFF增加(BUFFLv=1)
            self.属性描述 += 属性.觉醒增加(一觉Lv=1)

class 装备532(装备):
    名称 = '灵魂的掠夺者'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    体力 = 69
    精神 = 69
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    属性1描述 = '附加伤害:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '附加伤害:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.附加伤害加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2])/100)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2])/100)
        if 改造等级 >= 7:
            self.属性描述 += 属性.附加伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2])/100) 
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.技能攻击力加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += 属性.暴击伤害加成(0.18)
        if 属性.获取改造(self.部位) >= 4:
            self.属性描述 += 属性.附加伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.15)
        self.属性描述 += 属性.释放速度增加(0.225)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '技能攻击力 +{}%<br>'.format(4*改造等级)
        if 改造等级 >= 1:
            temp += '暴击伤害 +18%<br>'
        if 改造等级 >= 4:
            temp += '附加伤害 +14%<br>'
        if 属性.产物升级 == 1:
            属性.装备描述 = 1
            self.产物升级(属性)
            temp += self.属性描述
            属性.装备描述 = 0
        return temp     
    def 城镇属性_BUFF(self, 属性):
        属性.体精固定加成(20 * 属性.获取改造(self.部位))
        属性.力智固定加成(20 * 属性.获取改造(self.部位))
    def BUFF属性(self, 属性):
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += '<font color="#FF8200">改造属性(+' + str(属性.获取改造(self.部位)) + ')：</font><br>'
            self.属性描述 += 属性.BUFF增加(BUFFLv=1)
            self.属性描述 += 属性.BUFF增加(BUFF力量per=1.06,BUFF智力per=1.06)
            self.属性描述 += 属性.觉醒增加(一觉力智=35)
            self.属性描述 += 属性.被动增加(守护恩赐体精=100)
            self.属性描述 += 属性.被动增加(转职被动智力=40)
        if 属性.获取改造(self.部位) >= 4:
            self.属性描述 += 属性.觉醒增加(一觉Lv=1)
            self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04,BUFF智力per=1.04)
            self.属性描述 += 属性.被动增加(守护恩赐体精=80)
            self.属性描述 += 属性.被动增加(转职被动智力=80)

class 装备533(装备):
    名称 = '无我的宝贝'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    属性1描述 = '暴击伤害:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '暴击伤害:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.暴击伤害加成((self.属性1范围[0]-self.属性1选择*self.属性1范围[2])/100)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成((self.属性2范围[0]-self.属性2选择*self.属性2范围[2])/100)
        if 改造等级 >= 7:
            self.属性描述 += 属性.暴击伤害加成((self.属性3范围[0]-self.属性3选择*self.属性3范围[2])/100)  
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += 属性.百分比力智加成(0.18)
        if 属性.获取改造(self.部位) >= 4:
            self.属性描述 += 属性.技能攻击力加成(0.13) 
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
        if 改造等级 >= 1:
            temp += '力量、智力 +18%<br>'
        if 改造等级 >= 4:
            temp += '技能攻击力 +13%<br>'
        temp += '暴击伤害 +{}%<br>'.format(4 * 改造等级)
        if 属性.产物升级 == 1:
            属性.装备描述 = 1
            self.产物升级(属性)
            temp += self.属性描述
            属性.装备描述 = 0
        return temp
    def 城镇属性_BUFF(self, 属性):
        属性.体精固定加成(20 * 属性.获取改造(self.部位))
        属性.力智固定加成(20 * 属性.获取改造(self.部位))
    def BUFF属性(self, 属性):
        if 属性.获取改造(self.部位) >= 1:
            self.属性描述 += '<font color="#FF8200">改造属性(+' + str(属性.获取改造(self.部位)) + ')：</font><br>'
            self.属性描述 += 属性.BUFF增加(BUFF独立per=1.06)
            self.属性描述 += 属性.觉醒增加(一觉力智=20)
            self.属性描述 += 属性.被动增加(守护恩赐体精=140)
        if 属性.获取改造(self.部位) >= 4:
            self.属性描述 += 属性.BUFF增加(BUFFLv=1)
            self.属性描述 += 属性.觉醒增加(一觉Lv=1)
# endregion

#region  普雷

class 装备345(装备):
    名称 = '暗黑之魂：被吞噬的太阳'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.16)
        self.属性描述 += 属性.附加伤害加成(0.16)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '伤害增加 +16%<br>'
        temp += '附加伤害 +16%<br>'
        return temp
    体力 = 66
    精神 = 66

    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=116)
        self.属性描述 += 属性.被动增加(转职被动智力=116)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.04)
    def 装备描述_BUFF(self, 属性):
        temp = ''
        if 属性.角色 == '圣职者(女)':
            temp += '智力 +66<br>'
            temp += '[勇气祝福]独立攻击力增加量 +4%<br>'
            temp += '[启示：圣歌]智力 +116<br>'
        elif 属性.角色 == '圣职者(男)':
            temp += '体力 +66<br>'
            temp += '精神 +66<br>'
            temp += '[荣誉祝福]独立攻击力增加量 +4%<<br>'
            temp += '[守护恩赐]体力、精神 +116<br>'
        elif 属性.角色 == '魔法师(女)':
            temp += '智力 +66<br>'
            temp += '[禁忌诅咒]独立攻击力增加量 +4%<<br>'
            temp += '[人偶操纵者]智力 +116<br>'
        return temp

class 装备346(装备):
    名称 = '暗黑之翼：被蚕食的太阳'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 44
    智力 = 44
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.15)
        self.属性描述 += 属性.技能攻击力加成(0.08)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +44<br>'
        temp += '智力 +44<br>'
        temp += '伤害增加 +15%<br>'
        temp += '技能攻击力 +8%<br>'
        return temp
    体力 = 44
    精神 = 44

    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=108)
        self.属性描述 += 属性.被动增加(转职被动智力=128)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.04)
        self.属性描述 += 属性.觉醒增加(一觉Lv=1)
    def 装备描述_BUFF(self, 属性):
        temp = ''
        if 属性.角色 == '圣职者(女)':
            temp += '智力 +44<br>'
            temp += '[圣光天启]技能等级 +1<br>'
            temp += '[勇气祝福]魔法攻击力增加量 +4%<br>'
            temp += '[启示：圣歌]智力 +128<br>'
        elif 属性.角色 == '圣职者(男)':
            temp += '体力 +44<br>'
            temp += '精神 +44<br>'
            temp += '[天启之珠]技能等级 +1<br>'
            temp += '[荣誉祝福]魔法攻击力增加量 +4%<br>'
            temp += '[守护恩赐]体力、精神 +108<br>'
        elif 属性.角色 == '魔法师(女)':
            temp += '智力 +44<br>'
            temp += '[开幕！人偶剧场]技能等级 +1<br>'
            temp += '[禁忌诅咒]魔法攻击力增加量 +4%<br>'
            temp += '[人偶操纵者]智力 +128<br>'
        return temp

class 装备347(装备):
    名称 = '暗黑之风：分裂的太阳'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.15)
        self.属性描述 += 属性.技能攻击力加成(0.15)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '暴击伤害 +15%<br>'
        temp += '技能攻击力 +15%<br>'
        return temp
    体力 = 66
    精神 = 66

    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=120)
        self.属性描述 += 属性.被动增加(转职被动智力=126)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
        self.属性描述 += 属性.觉醒增加(一觉Lv=1)
    def 装备描述_BUFF(self, 属性):
        temp = ''
        if 属性.角色 == '圣职者(女)':
            temp += '智力 +66<br>'
            temp += '[圣光天启]技能等级 +1<br>'
            temp += '[勇气祝福]力量、智力 +4%<br>'
            temp += '[启示：圣歌]智力 +126<br>'
        elif 属性.角色 == '圣职者(男)':
            temp += '体力 +66<br>'
            temp += '精神 +66<br>'
            temp += '[天启之珠]技能等级 +1<br>'
            temp += '[荣誉祝福]力量、智力 +4%<br>'
            temp += '[守护恩赐]体力、精神 +120<br>'
        elif 属性.角色 == '魔法师(女)':
            temp += '智力 +66<br>'
            temp += '[开幕！人偶剧场]技能等级 +1<br>'
            temp += '[禁忌诅咒]力量、智力 +4%<br>'
            temp += '[人偶操纵者]智力 +126<br>'
        return temp

class 装备348(装备):
    名称 = '暗黑之魂：被吞噬的大地'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.14)
        self.属性描述 += 属性.附加伤害加成(0.14)
        self.属性描述 += 属性.技能等级加成('所有', 60, 80, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '伤害增加 +14%<br>'
        temp += '附加伤害 +14%<br>'
        temp += 'Lv60-80 技能等级+1<br>'
        return temp
    体力 = 66
    精神 = 66

    def 城镇属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 60, 80, 1)

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=106)
        self.属性描述 += 属性.被动增加(转职被动智力=96)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.04)
    def 装备描述_BUFF(self, 属性):
        temp = ''
        if 属性.角色 == '圣职者(女)':
            temp += '智力 +66<br>'
            temp += '[勇气祝福]独立攻击力增加量 +4%<br>'
            temp += '[启示：圣歌]智力 +96<br>'
        elif 属性.角色 == '圣职者(男)':
            temp += '体力 +66<br>'
            temp += '精神 +66<br>'
            temp += '[荣誉祝福]独立攻击力增加量 +4%<br>'
            temp += '[守护恩赐]体力、精神 +106<br>'
        elif 属性.角色 == '魔法师(女)':
            temp += '智力 +66<br>'
            temp += '[禁忌诅咒]独立攻击力增加量 +4%<br>'
            temp += '[人偶操纵者]智力 +96<br>'
        temp += 'Lv60-80 技能等级 +1<br>'
        return temp

class 装备349(装备):
    名称 = '暗黑之翼：被蚕食的大地'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 44
    智力 = 44
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.10)
        self.属性描述 += 属性.技能攻击力加成(0.08)
        self.属性描述 += 属性.技能等级加成('所有', 48, 70, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +44<br>'
        temp += '智力 +44<br>'
        temp += '伤害增加 +10%<br>'
        temp += '技能攻击力 +8%<br>'
        temp += 'Lv48-70 技能等级+1<br>'
        return temp
    体力 = 44
    精神 = 44

    def 城镇属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 48, 70, 1)

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=84)
        self.属性描述 += 属性.被动增加(转职被动智力=94)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.04)
    def 装备描述_BUFF(self, 属性):
        temp = ''
        if 属性.角色 == '圣职者(女)':
            temp += '智力 +44<br>'
            temp += '[勇气祝福]魔法攻击力增加量 +4%<br>'
            temp += '[启示：圣歌]智力 +94<br>'
        elif 属性.角色 == '圣职者(男)':
            temp += '体力 +44<br>'
            temp += '精神 +44<br>'
            temp += '[荣誉祝福]魔法攻击力增加量 +4%<br>'
            temp += '[守护恩赐]体力、精神 +84<br>'
        elif 属性.角色 == '魔法师(女)':
            temp += '智力 +44<br>'
            temp += '[禁忌诅咒]魔法攻击力增加量 +4%<br>'
            temp += '[人偶操纵者]智力 +94<br>'
        temp += 'Lv48-70 技能等级 +1<br>'
        return temp

class 装备350(装备):
    名称 = '暗黑之风：分裂的大地'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.10)
        self.属性描述 += 属性.技能攻击力加成(0.15)
        self.属性描述 += 属性.技能等级加成('所有', 35, 50, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '暴击伤害 +10%<br>'
        temp += '技能攻击力 +15%<br>'
        temp += 'Lv35-50 技能等级+1<br>'
        return temp
    体力 = 66
    精神 = 66

    def 城镇属性_BUFF(self, 属性):
        self.属性描述 += 属性.技能等级加成('所有', 35, 50, 1)

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=111)
        self.属性描述 += 属性.被动增加(转职被动智力=106)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.06)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.06)
    def 装备描述_BUFF(self, 属性):
        temp = ''
        if 属性.角色 == '圣职者(女)':
            temp += '智力 +66<br>'
            temp += '[勇气祝福]力量、智力 +6%<br>'
            temp += '[启示：圣歌]智力 +106<br>'
        elif 属性.角色 == '圣职者(男)':
            temp += '体力 +66<br>'
            temp += '精神 +66<br>'
            temp += '[荣誉祝福]力量、智力 +6%<br>'
            temp += '[守护恩赐]体力、精神 +111<br>'
        elif 属性.角色 == '魔法师(女)':
            temp += '智力 +66<br>'
            temp += '[禁忌诅咒]力量、智力 +6%<br>'
            temp += '[人偶操纵者]智力 +106<br>'
        temp += 'Lv35-50 技能等级 +1<br>'
        return temp

class 装备351(装备):
    名称 = '暗黑之魂：被吞噬的天空'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.14)
        self.属性描述 += 属性.附加伤害加成(0.14)
        self.属性描述 += 属性.技能冷却缩减(1, 45, 0.12)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.03)
        self.属性描述 += 属性.释放速度增加(0.045)
        self.属性描述 += 属性.移动速度增加(0.03)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '伤害增加 +14%<br>'
        temp += '附加伤害 +14%<br>'
        temp += 'Lv1-45 技能CD-12%<br>'
        temp += '攻击速度 +3%<br>'
        temp += '释放速度 +4.5%<br>'
        temp += '移动速度 +3%<br>'
        return temp
    体力 = 66
    精神 = 66

    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=101)
        self.属性描述 += 属性.被动增加(转职被动智力=86)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.04)
    def 装备描述_BUFF(self, 属性):
        temp = ''
        if 属性.角色 == '圣职者(女)':
            temp += '智力 +66<br>'
            temp += '[勇气祝福]独立攻击力增加量 +4%<br>'
            temp += '[启示：圣歌]智力 +86<br>'
        elif 属性.角色 == '圣职者(男)':
            temp += '体力 +66<br>'
            temp += '精神 +66<br>'
            temp += '[荣誉祝福]独立攻击力增加量 +4%<br>'
            temp += '[守护恩赐]体力、精神 +101<br>'
        elif 属性.角色 == '魔法师(女)':
            temp += '智力 +66<br>'
            temp += '[禁忌诅咒]独立攻击力增加量 +4%<br>'
            temp += '[人偶操纵者]智力 +86<br>'
        return temp

class 装备352(装备):
    名称 = '暗黑之翼：被蚕食的天空'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 44
    智力 = 44
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.11)
        self.属性描述 += 属性.技能攻击力加成(0.08)
        self.属性描述 += 属性.技能冷却缩减(75, 80, 0.15)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.03)
        self.属性描述 += 属性.释放速度增加(0.045)
        self.属性描述 += 属性.移动速度增加(0.03)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +44<br>'
        temp += '智力 +44<br>'
        temp += '伤害增加 +11%<br>'
        temp += '技能攻击力 +8%<br>'
        temp += 'Lv75-80 技能CD-15%<br>'
        temp += '攻击速度 +3%<br>'
        temp += '释放速度 +4.5%<br>'
        temp += '移动速度 +3%<br>'
        return temp
    体力 = 44
    精神 = 44

    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=72)
        self.属性描述 += 属性.被动增加(转职被动智力=108)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.04)
        self.属性描述 += 属性.觉醒增加(一觉Lv=1)
    def 装备描述_BUFF(self, 属性):
        temp = ''
        if 属性.角色 == '圣职者(女)':
            temp += '智力 +44<br>'
            temp += '[圣光天启]技能等级 +1<br>'
            temp += '[勇气祝福]魔法攻击力增加量 +4%<br>'
            temp += '[启示：圣歌]智力 +108<br>'
        elif 属性.角色 == '圣职者(男)':
            temp += '体力 +44<br>'
            temp += '精神 +44<br>'
            temp += '[天启之珠]技能等级 +1<br>'
            temp += '[荣誉祝福]魔法攻击力增加量 +4%<br>'
            temp += '[守护恩赐]体力、精神 +72<br>'
        elif 属性.角色 == '魔法师(女)':
            temp += '智力 +44<br>'
            temp += '[开幕！人偶剧场]技能等级 +1<br>'
            temp += '[禁忌诅咒]魔法攻击力增加量 +4%<br>'
            temp += '[人偶操纵者]智力 +108<br>'
        return temp

class 装备353(装备):
    名称 = '暗黑之风：分裂的天空'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.11)
        self.属性描述 += 属性.技能攻击力加成(0.15)
        self.属性描述 += 属性.技能冷却缩减(60, 70, 0.15)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.攻击速度增加(0.03)
        self.属性描述 += 属性.释放速度增加(0.045)
        self.属性描述 += 属性.移动速度增加(0.03)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '暴击伤害 +11%<br>'
        temp += '技能攻击力 +15%<br>'
        temp += 'Lv60-70 技能CD-15%<br>'
        temp += '攻击速度 +3%<br>'
        temp += '释放速度 +4.5%<br>'
        temp += '移动速度 +3%<br>'
        return temp
    体力 = 66
    精神 = 66

    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=100)
        self.属性描述 += 属性.被动增加(转职被动智力=106)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.04)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.04)
        self.属性描述 += 属性.觉醒增加(一觉Lv=1)
    def 装备描述_BUFF(self, 属性):
        temp = ''
        if 属性.角色 == '圣职者(女)':
            temp += '智力 +66<br>'
            temp += '[圣光天启]技能等级 +1<br>'
            temp += '[勇气祝福]力量、智力 +4%<br>'
            temp += '[启示：圣歌]智力 +106<br>'
        elif 属性.角色 == '圣职者(男)':
            temp += '体力 +44<br>'
            temp += '精神 +44<br>'
            temp += '[天启之珠]技能等级 +1<br>'
            temp += '[荣誉祝福]力量、智力 +4%<br>'
            temp += '[守护恩赐]体力、精神 +100<br>'
        elif 属性.角色 == '魔法师(女)':
            temp += '智力 +66<br>'
            temp += '[开幕！人偶剧场]技能等级 +1<br>'
            temp += '[禁忌诅咒]力量、智力 +4%<br>'
            temp += '[人偶操纵者]智力 +106<br>'
        return temp

#endregion

# region  100改造&传说
class 装备358(装备):
    名称 = '轮回·腐蚀之黑色十字耳环'
    模式 = 1
    所属套装 = '智慧产物'
    所属套装2 = '暗之腐蚀'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    属性1描述 = '百分比力智:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比力智:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.百分比力智加成(0.03)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成(0.03)
        if 改造等级 >= 7:
            self.属性描述 += 属性.百分比力智加成(0.03)  
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.20)
        self.属性描述 += 属性.附加伤害加成(0.20)
        pass
    def 进图属性(self, 属性):
        属性.力量 += 25 * 属性.获取改造(self.部位)
        属性.智力 += 25 * 属性.获取改造(self.部位)
        self.属性描述 += 属性.百分比力智加成(0.02 * 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '伤害增加 +20%<br>'
        temp += '附加伤害 +20%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '力量 +' + str(25 * 改造等级) + '<br>'
            temp += '智力 +' + str(25 * 改造等级) + '<br>'
            temp += '百分比力智+' + str(2 * 改造等级) + '%<br>'
        return temp
    体力 = 69
    精神 = 69

    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        属性.智力 += 25 * 属性.获取改造(self.部位)
        属性.体力 += 25 * 属性.获取改造(self.部位)
        属性.精神 += 25 * 属性.获取改造(self.部位)
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=120)
        self.属性描述 += 属性.被动增加(转职被动智力=20)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.03)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.03)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.03)
    def 装备描述_BUFF(self, 属性):
        temp = ''
        改造等级 = 属性.获取改造(self.部位)
        if 属性.角色 == '圣职者(女)':
            temp += '智力 +169<br>'
            temp += '[勇气祝福]独立攻击力增加量 +3%<br>'
            temp += '[勇气祝福]力量、智力 +3%<br>'
            temp += '[启示：圣歌]智力 +20<br>'
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '智力 +{}<br>'.format(25 * 改造等级)
        elif 属性.角色 == '圣职者(男)':
            temp += '体力 +69<br>'
            temp += '精神 +69<br>'
            temp += '[荣誉祝福]独立攻击力增加量 +3%<br>'
            temp += '[荣誉祝福]力量、智力 +3%<br>'
            temp += '[守护恩赐]体力、精神 +120<br>'
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '体力 +{}<br>'.format(25 * 改造等级)
            temp += '精神 +{}<br>'.format(25 * 改造等级)
        elif 属性.角色 == '魔法师(女)':
            temp += '智力 +169<br>'
            temp += '[禁忌诅咒]独立攻击力增加量 +3%<br>'
            temp += '[禁忌诅咒]力量、智力 +3%<br>'
            temp += '[人偶操纵者]智力 +20<br>'
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '智力 +{}<br>'.format(25 * 改造等级)
        return temp

class 装备359(装备):
    名称 = '时空：腐蚀之黑色十字耳环'
    模式 = 1
    所属套装 = '暗之腐蚀'
    等级 = 100
    品质 = '传说'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 67
    智力 = 67
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.17)
        self.属性描述 += 属性.附加伤害加成(0.17)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +67<br>'
        temp += '智力 +67<br>'
        temp += '伤害增加 +17%<br>'
        temp += '附加伤害 +17%<br>'
        return temp
    体力 = 67
    精神 = 67

    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.被动增加(守护恩赐体精=100)
        self.属性描述 += 属性.被动增加(转职被动智力=100)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.03)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.03)
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.03)
    def 装备描述_BUFF(self, 属性):
        temp = ''
        if 属性.角色 == '圣职者(女)':
            temp += '智力 +67<br>'
            temp += '[勇气祝福]独立攻击力增加量 +3%<br>'
            temp += '[勇气祝福]力量、智力 +3%<br>'
            temp += '[启示：圣歌]智力 +100<br>'
        elif 属性.角色 == '圣职者(男)':
            temp += '体力 +67<br>'
            temp += '精神 +67<br>'
            temp += '[荣誉祝福]独立攻击力增加量 +3%<br>'
            temp += '[荣誉祝福]力量、智力 +3%<br>'
            temp += '[守护恩赐]体力、精神 +100<br>'
        elif 属性.角色 == '魔法师(女)':
            temp += '智力 +67<br>'
            temp += '[禁忌诅咒]独立攻击力增加量 +3%<br>'
            temp += '[禁忌诅咒]力量、智力 +3%<br>'
            temp += '[人偶操纵者]智力 +100<br>'
        return temp

class 装备360(装备):
    名称 = '腐蚀之黑色面具'
    模式 = 1
    所属套装 = '暗之腐蚀'
    等级 = 100
    品质 = '传说'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 45
    智力 = 45
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.15)
        self.属性描述 += 属性.技能攻击力加成(0.13)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +45<br>'
        temp += '智力 +45<br>'
        temp += '伤害增加 +15%<br>'
        temp += '技能攻击力 +13%<br>'
        return temp
    体力 = 45
    精神 = 45

    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.觉醒增加(一觉Lv=1)
        self.属性描述 += 属性.BUFF增加(BUFF魔攻per=1.03)
        self.属性描述 += 属性.被动增加(守护恩赐体精=108)
        self.属性描述 += 属性.被动增加(转职被动智力=128)
    def 装备描述_BUFF(self, 属性):
        temp = ''
        if 属性.角色 == '圣职者(女)':
            temp += '智力 +45<br>'
            temp += '[圣光天启]技能等级 +1<br>'
            temp += '[勇气祝福]魔法攻击力增加量 +3%<br>'
            temp += '[启示：圣歌]智力 +128<br>'
        elif 属性.角色 == '圣职者(男)':
            temp += '体力 +45<br>'
            temp += '精神 +45<br>'
            temp += '[天启之珠]技能等级 +1<br>'
            temp += '[荣誉祝福]魔法攻击力增加量 +3%<br>'
            temp += '[守护恩赐]体力、精神 +108<br>'
        elif 属性.角色 == '魔法师(女)':
            temp += '智力 +45<br>'
            temp += '[开幕！人偶剧场]技能等级 +1<br>'
            temp += '[禁忌诅咒]魔法攻击力增加量 +3%<br>'
            temp += '[人偶操纵者]智力 +128<br>'
        return temp

class 装备361(装备):
    名称 = '腐蚀之黑色尖角'
    模式 = 1
    所属套装 = '暗之腐蚀'
    等级 = 100
    品质 = '传说'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 67
    智力 = 67
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.暴击伤害加成(0.13)
        self.属性描述 += 属性.技能攻击力加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +67<br>'
        temp += '智力 +67<br>'
        temp += '暴击伤害 +13%<br>'
        temp += '技能攻击力 +15%<br>'
        return temp
    体力 = 67
    精神 = 67

    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.BUFF增加(BUFFLv=1)
        self.属性描述 += 属性.BUFF增加(BUFF力量per=1.03)
        self.属性描述 += 属性.BUFF增加(BUFF智力per=1.03)
        self.属性描述 += 属性.觉醒增加(一觉力智=20)
        self.属性描述 += 属性.被动增加(守护恩赐体精=120)
        self.属性描述 += 属性.被动增加(转职被动智力=126)
    def 装备描述_BUFF(self, 属性):
        temp = ''
        改造等级 = 属性.获取改造(self.部位)
        if 属性.角色 == '圣职者(女)':
            temp += '智力 +67<br>'
            temp += '[圣光天启]技能等级 +1<br>'
            temp += '[勇气祝福]力量、智力 +3%<br>'
            temp += '[启示：圣歌]智力 +126<br>'
        elif 属性.角色 == '圣职者(男)':
            temp += '体力 +67<br>'
            temp += '精神 +67<br>'
            temp += '[天启之珠]技能等级 +1<br>'
            temp += '[荣誉祝福]力量、智力 +3%<br>'
            temp += '[守护恩赐]体力、精神 +120<br>'
        elif 属性.角色 == '魔法师(女)':
            temp += '智力 +67<br>'
            temp += '[开幕！人偶剧场]技能等级 +1<br>'
            temp += '[禁忌诅咒]力量、智力 +3%<br>'
            temp += '[人偶操纵者]智力 +126<br>'
        return temp

class 装备369(装备):
    名称 = '腐蚀之黑色十字耳环'
    模式 = 1
    所属套装 = '暗之腐蚀'
    等级 = 100
    品质 = '传说'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 67
    智力 = 67
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.14)
        self.属性描述 += 属性.附加伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +67<br>'
        temp += '智力 +67<br>'
        temp += '伤害增加 +14%<br>'
        temp += '附加伤害 +14%<br>'
        return temp
    体力 = 67
    精神 = 67

    def 城镇属性_BUFF(self, 属性):
        pass

    def 进图属性_BUFF(self, 属性):
        pass

    def BUFF属性(self, 属性):
        self.属性描述 += 属性.BUFF增加(BUFF独立per=1.03)
        self.属性描述 += 属性.被动增加(守护恩赐体精=116)
        self.属性描述 += 属性.被动增加(转职被动智力=116)
    def 装备描述_BUFF(self, 属性):
        temp = ''
        if 属性.角色 == '圣职者(女)':
            temp += '智力 +67<br>'
            temp += '[勇气祝福]独立攻击力增加量 +3%<br>'
            temp += '[启示：圣歌]智力 +116<br>'
        elif 属性.角色 == '圣职者(男)':
            temp += '体力 +67<br>'
            temp += '精神 +67<br>'
            temp += '[荣誉祝福]独立攻击力增加量 +3%<br>'
            temp += '[守护恩赐]体力、精神 +116<br>'
        elif 属性.角色 == '魔法师(女)':
            temp += '智力 +67<br>'
            temp += '[禁忌诅咒]独立攻击力增加量 +3%<br>'
            temp += '[人偶操纵者]智力 +116<br>'
        return temp        
# endregion

# region 改造低级SS
class 装备393(装备):
    名称 = '转世：回溯的生命'
    所属套装 = '万物的生灭'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.12)
        self.属性描述 += 属性.暴击伤害加成(0.12)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '伤害增加 +12%<br>'
        temp += '暴击伤害 +12%<br>'
        return temp

class 装备394(装备):
    名称 = '循环：无尽的诞生'
    所属套装 = '万物的生灭'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 44
    智力 = 44
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.10)
        self.属性描述 += 属性.技能等级加成('所有', 1, 85, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +44<br>'
        temp += '智力 +44<br>'
        temp += '最终伤害 +10%<br>'
        temp += 'Lv1-85 技能等级+1<br>'
        return temp


class 装备395(装备):
    名称 = '轮回：周而复始的时间'
    所属套装 = '万物的生灭'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(50)
        self.属性描述 += 属性.技能攻击力加成(0.10)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '所有属性强化 +50<br>'
        temp += '技能攻击力 +10%<br>'
        return temp

class 装备396(改造产物):
    名称 = '江山如故'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    关联套装 = '江山如画[3]'
    属性1描述 = '最终伤害:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '最终伤害:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.最终伤害加成(0.3)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成(0.03)
        if 改造等级 >= 7:
            self.属性描述 += 属性.最终伤害加成(0.03)   
    def 改造属性(self, 属性, x):
        self.属性描述 += 属性.最终伤害加成(0.02 * x)
        if x >= 3:
            self.属性描述 += 属性.伤害增加加成(0.14)
            self.属性描述 += 属性.暴击伤害加成(0.28)
        if x >= 4:
            self.属性描述 += 属性.最终伤害加成(0.21)
            self.属性描述 += 属性.百分比三攻加成(0.38)
        pass
    def 其它属性(self, 属性):
        self.属性描述 += 属性.移动速度增加(0.08)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '移动速度 +8%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '最终伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 3:
           temp += '伤害增加 +14%<br>'
           temp += '暴击伤害 +28%<br>'
        if 改造等级 >= 4:
           temp += '最终伤害 +21%<br>'
           temp += '百分比三攻 +38%<br>'
        return temp

class 装备403(改造产物):
    名称 = '过往时光的轮回'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    关联套装 = '兵法之神[5]'
    关联套装2 = '无相轮回的希望[2]'
    关联套装3 = '流逝轮回的记忆[3]'
    def 基础属性(self, 属性):
        属性.爆伤 = max(属性.爆伤, 0.45)
    def 改造属性(self, 属性, x):
        self.属性描述 += 属性.技能攻击力加成(0.01 * x)
        if x >= 1:
            self.属性描述 += 属性.最终伤害加成(0.40)
        if x >= 3:
            self.属性描述 += 属性.暴击伤害加成(0.15)
            self.属性描述 += 属性.百分比力智加成(0.35)
            self.属性描述 += 属性.伤害增加加成(0.15)
        if x >= 4:
            self.属性描述 += 属性.技能攻击力加成(0.15)
        pass
    def 进图属性(self, 属性):
        if (self.关联套装 in 属性.套装栏) and (self.关联套装2 in 属性.套装栏) and (self.关联套装3 in 属性.套装栏):
            self.改造属性(属性, 属性.获取改造(self.部位))
        pass

    def 城镇属性(self, 属性):
        # 暂时先不解决
        # for i in 属性.装备栏:
        #     if 装备列表[装备序号[i]].所属套装 in self.关联套装:
        #         属性.力量 += 100
        #         属性.智力 += 100
        #     if 装备列表[装备序号[i]].所属套装 in self.关联套装2:
        #         属性.力量 += 100
        #         属性.智力 += 100
        #     if 装备列表[装备序号[i]].所属套装 in self.关联套装3:
        #         属性.力量 += 100
        #         属性.智力 += 100
        # self.基础属性(属性)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '爆伤 +45%(取最高值)<br>'
        if not ((self.关联套装 in 属性.套装栏) and (self.关联套装2 in 属性.套装栏) and (self.关联套装3 in 属性.套装栏)):
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '技能攻击力 +' + str(改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '最终伤害 +40%<br>'
        if 改造等级 >= 3:
           temp += '暴击伤害 +15%<br>'
           temp += '百分比力智 +35%<br>'
           temp += '伤害增加 +15%<br>'
        if 改造等级 >= 4:
           temp += '技能攻击力 +15%<br>'
        return temp

class 装备407(装备):
    名称 = '无相轮回的追忆'
    所属套装 = '无相轮回的希望'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.伤害增加加成(0.06)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    名称 = '无相轮回的追忆'
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '伤害增加 +6%<br>'
        return temp     

class 装备408(装备):
    名称 = '无相轮回的信念'
    所属套装 = '无相轮回的希望'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 105
    智力 = 105
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.物理攻击力 += 50
        属性.魔法攻击力 += 50
        属性.独立攻击力 += 50
        属性.黄字 = max(属性.黄字, 0.10)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +105<br>'
        temp += '智力 +105<br>'
        temp += '物理攻击力 +50<br>'
        temp += '魔法攻击力 +50<br>'
        temp += '独立攻击力 +50<br>'
        temp += '伤害增加 +10%<br>'
        return temp      

class 装备409(装备):
    名称 = '无相轮回的眼泪'
    所属套装 = '无相轮回的希望'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(16)
        self.属性描述 += 属性.暴击伤害加成(0.06)
    def 进图属性(self, 属性):
        self.属性描述 += 属性.所有属性强化加成(10)
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '所有属性强化 +16<br>'
        temp += '暴击伤害 +6%<br>'
        temp += '所有属性强化 +10<br>'
        return temp    

class 装备415(改造产物):
    名称 = '聚魔漩涡'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    关联套装 = '魔战无双[5]'
    属性1描述 = '最终伤害:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '最终伤害:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.最终伤害加成(0.3)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成(0.03)
        if 改造等级 >= 7:
            self.属性描述 += 属性.最终伤害加成(0.03)   
    def 改造属性(self, 属性, x):
        self.属性描述 += 属性.最终伤害加成(0.02 * x)
        if x >= 1:
            self.属性描述 += 属性.暴击伤害加成(0.40)
        if x >= 3:
            self.属性描述 += 属性.百分比三攻加成(0.10)
            self.属性描述 += 属性.百分比力智加成(0.33)
            self.属性描述 += 属性.技能攻击力加成(0.20)
        if x >= 5:
            self.属性描述 += 属性.最终伤害加成(0.08)
            self.属性描述 += 属性.技能攻击力加成(0.40)
        pass
    def 基础属性(self, 属性):
        self.属性描述 += 属性.附加伤害加成(0.35)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '附加伤害 +35%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '最终伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
            temp += '暴击伤害 +40%<br>'
        if 改造等级 >= 3:
            temp += '百分比三攻 +10%<br>'
            temp += '百分比力智 +33%<br>'
            temp += '技能攻击力 +20%<br>'
        if 改造等级 >= 5:
            temp += '最终伤害 +8%<br>'
            temp += '技能攻击力 +40%<br>'
        return temp     
class 装备433(改造产物):
    名称 = '禁断契约书'
    部位 = '辅助装备'
    类型 = '特殊装备'
    力量 = 146
    智力 = 146
    关联套装 = '誓血之盟[5]'
    属性1描述 = '最终伤害:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '最终伤害:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.最终伤害加成(0.3)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成(0.03)
        if 改造等级 >= 7:
            self.属性描述 += 属性.最终伤害加成(0.03)   
    def 改造属性(self, 属性, x):
        self.属性描述 += 属性.最终伤害加成(0.02 * x)
        if x >= 1:
            self.属性描述 += 属性.伤害增加加成(0.10)
            self.属性描述 += 属性.百分比力智加成(0.35)
        if x >= 3:
            self.属性描述 += 属性.最终伤害加成(0.05)
            self.属性描述 += 属性.百分比力智加成(0.15)
            self.属性描述 += 属性.技能攻击力加成(0.20)
            self.属性描述 += 属性.附加伤害加成(0.25)
        if x >= 5:
            self.属性描述 += 属性.最终伤害加成(0.27)
            self.属性描述 += 属性.暴击伤害加成(0.50)
            pass
    def 基础属性(self, 属性):
        属性.爆伤 = max(属性.爆伤, 0.45)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '爆伤 +45%(取最高值)<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '最终伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '伤害增加 +10%<br>'
           temp += '百分比力智 +35%<br>'
        if 改造等级 >= 3:
           temp += '最终伤害 +5%<br>'
           temp += '百分比力智 +15%<br>'
           temp += '技能攻击力 +20%<br>'
           temp += '附加伤害 +25%<br>'
        if 改造等级 >= 3:
           temp += '最终伤害 +27%<br>'
           temp += '暴击伤害 +50%<br>'
        return temp       
class 装备445(改造产物):
    名称 = '最佳球手之球'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    关联套装 = '最佳球手的绝杀[5]'
    属性1描述 = '百分比力智:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比力智:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.百分比力智加成(0.3)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成(0.03)
        if 改造等级 >= 7:
            self.属性描述 += 属性.百分比力智加成(0.03)  
    def 改造属性(self, 属性, x):
        self.属性描述 += 属性.百分比力智加成(0.02 * x)
        if x >= 1:
            self.属性描述 += 属性.暴击伤害加成(0.35)
            self.属性描述 += 属性.伤害增加加成(0.20)
        if x >= 3:
            self.属性描述 += 属性.百分比力智加成(0.20)
            self.属性描述 += 属性.技能攻击力加成(0.20)
            self.属性描述 += 属性.伤害增加加成(0.10)
        if x >= 5:
            self.属性描述 += 属性.附加伤害加成(0.65)
        pass
    def 基础属性(self, 属性):
        self.属性描述 += 属性.最终伤害加成(0.45)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '最终伤害 +45%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '百分比力智 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '暴击伤害 +35%<br>'
           temp += '伤害增加 +20%<br>'
        if 改造等级 >= 3:
           temp += '百分比力智 +20%<br>'
           temp += '技能攻击力 +20%<br>'
           temp += '伤害增加 +10%<br>'
        if 改造等级 >= 5:
           temp += '附加伤害 +65%<br>'
        
        return temp

class 装备451(改造产物):
    名称 = '战术之王的战术指挥棒'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    关联套装 = '战术之王的御敌[5]'
    属性1描述 = '百分比三攻:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比三攻:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.百分比三攻加成(0.3)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成(0.03)
        if 改造等级 >= 7:
            self.属性描述 += 属性.百分比三攻加成(0.03) 
    def 改造属性(self, 属性, x):
        self.属性描述 += 属性.百分比三攻加成(0.02 * x)
        if x >= 1:
            self.属性描述 += 属性.最终伤害加成(0.32)
            self.属性描述 += 属性.技能等级加成('所有', 60, 80, 3)
        if x >= 3:
            self.属性描述 += 属性.百分比三攻加成(0.30)
            self.属性描述 += 属性.技能攻击力加成(0.20)
        if x >= 5:
            self.属性描述 += 属性.技能攻击力加成(0.10)
        pass
    def 基础属性(self, 属性):
        属性.爆伤 = max(属性.爆伤, 0.42)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '爆伤 +42%(取最高值)<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '百分比三攻 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '最终伤害 +32%<br>'
           temp += 'Lv60-80 技能等级+3<br>'
        if 改造等级 >= 3:
           temp += '百分比三攻 +30%<br>'
           temp += '技能攻击力 +20%<br>'
        if 改造等级 >= 5:
           temp += '技能攻击力 +10%<br>'
        return temp

class 装备469(改造产物):
    名称 = '全元素水晶'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    关联套装 = '天劫[5]'
    属性1描述 = '最终伤害:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '最终伤害:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.最终伤害加成(0.3)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成(0.03)
        if 改造等级 >= 7:
            self.属性描述 += 属性.最终伤害加成(0.03)   
    def 改造属性(self, 属性, x):
        self.属性描述 += 属性.最终伤害加成(0.02 * x)
        if x >= 1:
            self.属性描述 += 属性.百分比力智加成(0.15)
            self.属性描述 += 属性.属性附加加成(0.35)
        if x >= 3:
            self.属性描述 += 属性.暴击伤害加成(0.20)
            self.属性描述 += 属性.最终伤害加成(0.26)
        if x >= 5:
            self.属性描述 += 属性.技能攻击力加成(0.10)
        pass
    def 基础属性(self, 属性):
        self.属性描述 += 属性.百分比力智加成(0.25)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '百分比力智 +25%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '最终伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '百分比力智 +15%<br>'
           temp += '属性附加 +35%<br>'
        if 改造等级 >= 3:
           temp += '暴击伤害 +20%<br>'
           temp += '最终伤害 +26%<br>'
        if 改造等级 >= 5:
           temp += '技能攻击力 +10%<br>'
        return temp      

class 装备473(改造产物):
    名称 = '冰雪公主的结晶'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    关联套装 = '冰雪公主的霜语首饰[3]'
    属性1描述 = '暴击伤害:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '暴击伤害:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.暴击伤害加成(0.3)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成(0.03)
        if 改造等级 >= 7:
            self.属性描述 += 属性.暴击伤害加成(0.03) 
    def 改造属性(self, 属性, x):
        self.属性描述 += 属性.暴击伤害加成(0.02 * x)
        if x >= 1:
            self.属性描述 += 属性.伤害增加加成(0.25)
        if x >= 3:
            self.属性描述 += 属性.最终伤害加成(0.28)
            self.属性描述 += 属性.百分比力智加成(0.22)
            self.属性描述 += 属性.技能攻击力加成(0.15)
        if x >= 4:
            self.属性描述 += 属性.最终伤害加成(0.58)
        pass
    def 基础属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '暴击伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '伤害增加 +25%<br>'
        if 改造等级 >= 3:
           temp += '最终伤害 +28%<br>'
           temp += '百分比力智 +22%<br>'
           temp += '技能攻击力 +15%<br>'
        if 改造等级 >= 5:
           temp += '最终伤害 +58%<br>'
        return temp 

class 装备477(改造产物):
    名称 = '扭曲的异界魔石'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    关联套装 = '精炼的异界魔石首饰[3]'
    属性1描述 = '伤害增加:'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力:'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '伤害增加:'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0
    def 产物升级(self,属性):
        self.属性描述 = ""
        self.属性描述 += '<font color="#FF8200">产物升级：</font><br>'
        self.属性描述 += 属性.伤害增加加成(0.3)
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 6:
            self.属性描述 += 属性.技能攻击力加成(0.03)
        if 改造等级 >= 7:
            self.属性描述 += 属性.伤害增加加成(0.03) 
    def 改造属性(self, 属性, x):
        self.属性描述 += 属性.伤害增加加成(0.02 * x)
        if x >= 1:
            self.属性描述 += 属性.暴击伤害加成(0.22)
        if x >= 3:
            self.属性描述 += 属性.百分比三攻加成(0.40)
            self.属性描述 += 属性.伤害增加加成(0.13)
            self.属性描述 += 属性.最终伤害加成(0.20)
        if x >= 4:
            self.属性描述 += 属性.所有属性强化加成(57)
            self.属性描述 += 属性.技能等级加成('所有', 1, 85, 2)
            self.属性描述 += 属性.技能等级加成('所有', 100, 100, 2)
        pass
    def 基础属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '伤害增加 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
            temp += '暴击伤害 +22%<br>'
        if 改造等级 >= 3:
            temp += '百分比三攻 +40%<br>'
            temp += '伤害增加 +13%<br>'
            temp += '最终伤害 +20%<br>'
        if 改造等级 >= 5:
            temp += '所有属性强化 +57<br>'
            temp += 'Lv1-85 技能等级+2<br>'
            temp += 'Lv100  技能等级+2<br>'
        return temp

class 装备478(装备):
    名称 = '感染者臂章'
    所属套装 = '无'
    模式 = 1
    等级 = 90
    品质 = '传说'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 41
    智力 = 41
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        if 属性.职业 == '街霸':
            for i in 属性.技能栏:
                if i.是否有伤害 == 1:
                    i.中毒倍率 += 0.5
                    if 属性.角色 == '格斗家(男)':
                        i.感电倍率 += 0.5
                    else:
                        i.涂毒倍率 += 0.5
                    i.出血倍率 += 0.5
                    i.灼伤倍率 += 0.5
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +41<br>'
        temp += '智力 +41<br>'
        temp += '中毒、涂毒伤害 +50%<br>'
        temp += '感电伤害 +50%<br>'
        temp += '出血伤害 +50%<br>'
        temp += '灼伤伤害 +50%<br>'
        return temp
# endregion

#region 100光环传说

# endregion
class 装备534(装备):
    名称 = '王座本源'
    模式 = 0
    所属套装 = '无'
    等级 = 90
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 63
    智力 = 63
    体力 = 63
    精神 = 63
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性_BUFF(self, 属性):
        属性.技能等级加成('所有',1,85,1)
    def BUFF属性(self, 属性):
        属性.百分比体精 += 0.05
    def 装备描述_BUFF(self, 属性):
        self.属性描述 = ''
        if 属性.角色 == '圣职者(女)' or 属性.角色 == '魔法师(女)' :
            self.属性描述 += '智力 +63<br>'
        else:
            self.属性描述 += '体力 +63<br>'
            self.属性描述 += '精神 +63<br>'
        self.属性描述 += 'lv1-85 技能等级+1<br>'
        self.属性描述 += '体力 +5%<br>'
        self.属性描述 += '精神 +5%<br>'
        return self.属性描述