#region  100SS首饰
class 装备180():
    名称 = '莱多：变幻的规律'
    模式 = 0
    所属套装 = '上古尘封术士'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.12)
        属性.技能攻击力加成(0.2)
        属性.所有属性强化加成(25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '附加伤害 +12%<br>'
        temp += '技能攻击力 +20%<br>'
        temp += '所有属性强化 +25<br>'
        temp += '移动速度 +10%<br>'
        return temp   

class 装备181():
    名称 = '拥抱晨曦之温暖'
    模式 = 0
    所属套装 = '破晓曦光'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.06)
        属性.技能攻击力加成(0.04 + 0.01 * min(13, 属性.获取强化(self.部位)))
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 1, 48, 1)
        属性.技能恢复加成(15, 30, 0.30)  
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '最终伤害 +6%<br>'
        temp += '技能攻击力 +' + str(4 + min(13,属性.获取强化(self.部位))) + '%<br>'
        temp += '所有属性强化 +28<br>'
        temp += 'Lv1-48  技能等级+1<br>'
        temp += 'Lv15-30 技能恢复+30%<br>'
        return temp      

class 装备182():
    名称 = '白象之庇护'
    模式 = 0
    所属套装 = '幸运三角'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.07)
        属性.伤害增加加成(0.07)
        属性.暴击伤害加成(0.07)
        属性.附加伤害加成(0.07)
        属性.技能攻击力加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '百分比力智 +7%<br>'
        temp += '伤害增加 +7%<br>'
        temp += '暴击伤害 +7%<br>'
        temp += '附加伤害 +7%<br>'
        temp += '技能攻击力 +7%<br>'
        return temp   

class 装备183():
    名称 = '火魔之焰-沙罗曼达'
    模式 = 0
    所属套装 = '精灵使的权能'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(38)
        属性.附加伤害加成(0.3)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '所有属性强化 +38<br>'
        temp += '附加伤害 +30%<br>'
        return temp     

class 装备184():
    名称 = '执着的探求'
    模式 = 0
    所属套装 = '黑魔法探求者'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.28)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '最终伤害 +28%<br>'
        temp += '所有属性强化 +40<br>'
        return temp      

class 装备185():
    名称 = '时间指引之针'
    模式 = 0
    所属套装 = '时空旅行者'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.2)
        属性.技能攻击力加成(0.14)
        属性.技能冷却缩减(50, 50, 0.10)
        属性.技能冷却缩减(85, 85, 0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '百分比力智 +20%<br>'
        temp += '技能攻击力 +14%<br>'
        temp += 'Lv50 技能CD-10%<br>'
        temp += 'Lv85 技能CD-10%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        return temp     

class 装备186():
    名称 = '支配战场的呐喊'
    模式 = 0
    所属套装 = '穿透命运的呐喊'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.12)
        属性.最终伤害加成(0.23)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '伤害增加 +12%<br>'
        temp += '最终伤害 +23%<br>'
        return temp     

class 装备187():
    名称 = '狂乱之坚如磐石'
    模式 = 0
    所属套装 = '狂乱追随者'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.3)
        属性.技能攻击力加成(0.11)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '百分比力智 +30%<br>'
        temp += '技能攻击力 +11%<br>'
        return temp     

class 装备188():
    名称 = '莱多：秩序创造者'
    模式 = 0
    所属套装 = '上古尘封术士'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '百分比三攻：'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力：'
    属性2范围 = [6, 1, 1]
    属性2选择 = 0
    属性3描述 = '暴击伤害：'
    属性3范围 = [9, 1, 1]
    属性3选择 = 0
    属性4描述 = '百分比力智：'
    属性4范围 = [6, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.06 - self.属性4选择 / 100)
        属性.百分比三攻加成(0.03 - self.属性1选择 / 100)
        属性.暴击伤害加成(0.09 - self.属性3选择 / 100)
        属性.附加伤害加成(0.12)
        属性.技能攻击力加成(0.20)
        属性.技能攻击力加成(0.06  - self.属性2选择 / 100)
        属性.所有属性强化加成(25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.移动速度 += 0.1
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +149<br>'
        temp += '智力 +100<br>'
        temp += '附加伤害 +12%<br>'
        temp += '技能攻击力 +20%<br>'
        temp += '所有属性强化 +25<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '百分比三攻 +%d%%<br>' % (3 - self.属性1选择)
        temp += '技能攻击力 +%d%%<br>' % (6 - self.属性2选择)
        temp += '暴击伤害 +%d%%<br>' % (9 - self.属性3选择)
        temp += '百分比力智 +%d%%<br>' % (6 - self.属性4选择)
        return temp        

class 装备189():
    名称 = '融化黑暗之温暖'
    模式 = 0
    所属套装 = '破晓曦光'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '物理/魔法/独立 +'
    属性1范围 = [110, 30, 10]
    属性1选择 = 0
    属性2描述 = '暴击伤害：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '伤害增加：'
    属性3范围 = [11, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.物理攻击力 += 110 - self.属性1选择 * 10
        属性.魔法攻击力 += 110 - self.属性1选择 * 10
        属性.独立攻击力 += 110 - self.属性1选择 * 10
        属性.伤害增加加成(0.11 - self.属性3选择 / 100)
        属性.暴击伤害加成(0.1 - self.属性2选择 / 100)
        属性.最终伤害加成(0.06)
        属性.技能攻击力加成(0.04 + 0.01 * min(13, 属性.获取强化(self.部位)))
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 1, 48, 1)
        属性.技能恢复加成(15, 30, 0.30)
        pass
    def 其它属性(self, 属性):
        x = int(min(sum(属性.强化等级), 150) / 6)
        属性.物理暴击率 += 0.005 * x
        属性.魔法暴击率 += 0.005 * x
        属性.攻击速度 += 0.008 * x
        属性.移动速度 += 0.008 * x
        属性.释放速度 += 0.012 * x
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +149<br>'
        temp += '智力 +100<br>'
        temp += '最终伤害 +6%<br>'
        temp += '技能攻击力 +' + str(4 + min(13,属性.获取强化(self.部位))) + '%<br>'
        temp += '所有属性强化 +28<br>'
        temp += 'Lv1-48  技能等级+1<br>'
        temp += 'Lv15-30 技能恢复+30%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '物理/魔法/独立 +%d<br>' % (110 - 10 * self.属性1选择)
        temp += '暴击伤害 +%d%%<br>' % (10 - self.属性2选择)
        temp += '伤害增加 +%d%%<br>' % (11 - self.属性3选择)
        return temp           

class 装备190():
    名称 = '伽内什的永恒庇护'
    模式 = 0
    所属套装 = '幸运三角'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '暴击伤害：'
    属性1范围 = [4, 1, 1]
    属性1选择 = 0
    属性2描述 = '百分比力智：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '伤害增加：'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '百分比三攻：'
    属性4范围 = [8, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.17 - self.属性2选择 / 100)
        属性.百分比三攻加成(0.08 - self.属性4选择 / 100)
        属性.伤害增加加成(0.1 - self.属性3选择 / 100)
        属性.暴击伤害加成(0.11 - self.属性1选择 / 100)
        属性.附加伤害加成(0.07)
        属性.技能攻击力加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.07
        属性.移动速度 += 0.07
        属性.释放速度 += 0.07
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +149<br>'
        temp += '智力 +100<br>'
        temp += '伤害增加 +7%<br>'
        temp += '百分比力智 +7%<br>'
        temp += '暴击伤害 +7%<br>'
        temp += '附加伤害 +7%<br>'
        temp += '技能攻击力 +7%<br>'
        temp += '攻击速度 +7%<br>'
        temp += '移动速度 +7%<br>'
        temp += '释放速度 +7%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '暴击伤害 +%d%%<br>' % (4 - self.属性1选择)
        temp += '百分比力智 +%d%%<br>' % (10 - self.属性2选择)
        temp += '伤害增加 +%d%%<br>' % (3 - self.属性3选择)
        temp += '百分比三攻 +%d%%<br>' % (8 - self.属性4选择)
        return temp
   
class 装备191():
    名称 = '至高之炎-伊弗利特'
    模式 = 0
    所属套装 = '精灵使的权能'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '力量/智力 +'
    属性1范围 = [160, 40, 20]
    属性1选择 = 0
    属性2描述 = '最终伤害：'
    属性2范围 = [12, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比三攻：'
    属性3范围 = [12, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.力量 += 160 - self.属性1选择 * 20
        属性.智力 += 160 - self.属性1选择 * 20
        属性.百分比三攻加成(0.12 - self.属性3选择 / 100)
        属性.附加伤害加成(0.3)
        属性.最终伤害加成(0.12 - self.属性2选择 / 100)
        属性.所有属性强化加成(38)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +149<br>'
        temp += '智力 +100<br>'
        temp += '附加伤害 +30%<br>'
        temp += '所有属性强化 +38<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '力量/智力 +%d<br>' % (160 - 20 * self.属性1选择)
        temp += '最终伤害 +%d%%<br>' % (12 - self.属性2选择)
        temp += '百分比三攻 +%d%%<br>' % (12 - self.属性3选择)
        return temp      

class 装备192():
    名称 = '无尽的探求'
    模式 = 0
    所属套装 = '黑魔法探求者'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '力量/智力 +'
    属性1范围 = [240, 20, 20]
    属性1选择 = 0
    属性2描述 = '附加伤害：'
    属性2范围 = [7, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比三攻：'
    属性3范围 = [12, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.力量 += 240 - self.属性1选择 * 20
        属性.智力 += 240 - self.属性1选择 * 20
        属性.百分比三攻加成(0.12 - self.属性3选择 / 100)
        属性.附加伤害加成(0.07 - self.属性2选择 / 100)
        属性.最终伤害加成(0.28)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +149<br>'
        temp += '智力 +100<br>'
        temp += '最终伤害 +28%<br>'
        temp += '所有属性强化 +40<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '力量/智力 +%d<br>' % (240 - 20 * self.属性1选择)
        temp += '附加伤害 +%d%%<br>' % (7 - self.属性2选择)
        temp += '百分比三攻 +%d%%<br>' % (12 - self.属性3选择)
        return temp     

class 装备193():
    名称 = '时间回溯之针'
    模式 = 0
    所属套装 = '时空旅行者'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '百分比力智：'
    属性1范围 = [4, 1, 1]
    属性1选择 = 0
    属性2描述 = '所有属性强化 +'
    属性2范围 = [20, 12, 4]
    属性2选择 = 0
    属性3描述 = '物理/魔法/独立 +'
    属性3范围 = [100, 10, 10]
    属性3选择 = 0
    属性4描述 = '最终伤害：'
    属性4范围 = [8, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.物理攻击力 += 100 - self.属性3选择 * 10
        属性.魔法攻击力 += 100 - self.属性3选择 * 10
        属性.独立攻击力 += 100 - self.属性3选择 * 10
        属性.百分比力智加成(0.24 - self.属性1选择 / 100)
        属性.最终伤害加成(0.08 - self.属性4选择 / 100)
        属性.技能攻击力加成(0.14)
        属性.所有属性强化加成(20 - self.属性2选择 * 4)
        属性.技能冷却缩减(50, 50, 0.15)
        属性.技能冷却缩减(85, 85, 0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +149<br>'
        temp += '智力 +100<br>'
        temp += '技能攻击力 +14%<br>'
        temp += '百分比力智 +20%<br>'
        temp += 'Lv50 技能CD-15%<br>'
        temp += 'Lv85 技能CD-15%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '百分比力智 +%d%%<br>' % (4 - self.属性1选择)
        temp += '所有属性强化 +%d<br>' % (20 - 4 * self.属性2选择)
        temp += '物理/魔法/独立 +%d<br>' % (100 - 10 * self.属性3选择)
        temp += '最终伤害 +%d%%<br>' % (8 - self.属性4选择)
        return temp     

class 装备194():
    名称 = '响彻天地的咆哮'
    模式 = 0
    所属套装 = '穿透命运的呐喊'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '技能攻击力：'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '附加伤害：'
    属性2范围 = [4, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比力智：'
    属性3范围 = [7, 1, 1]
    属性3选择 = 0
    属性4描述 = '百分比三攻：'
    属性4范围 = [12, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.07 - self.属性3选择 / 100)
        属性.百分比三攻加成(0.12 - self.属性4选择 / 100)
        属性.伤害增加加成(0.12)
        属性.附加伤害加成(0.04 - self.属性2选择 / 100)
        属性.最终伤害加成(0.23)
        属性.技能攻击力加成(0.03 - self.属性1选择 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.08
        属性.移动速度 += 0.08
        属性.释放速度 += 0.12
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +149<br>'
        temp += '智力 +100<br>'
        temp += '伤害增加 +12%<br>'
        temp += '最终伤害 +23%<br>'
        temp += '攻击速度 +8%<br>'
        temp += '移动速度 +8%<br>'
        temp += '释放速度 +12%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '技能攻击力 +%d%%<br>' % (3 - self.属性1选择)
        temp += '附加伤害 +%d%%<br>' % (4 - self.属性2选择)
        temp += '百分比力智 +%d%%<br>' % (7 - self.属性3选择)
        temp += '百分比三攻 +%d%%<br>' % (12 - self.属性4选择)
        return temp     

class 装备195():
    名称 = '狂乱之逆转宿命'
    模式 = 0
    所属套装 = '狂乱追随者'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '伤害增加：'
    属性1范围 = [10, 1, 1]
    属性1选择 = 0
    属性2描述 = '所有属性强化 +'
    属性2范围 = [32, 4, 4]
    属性2选择 = 0
    属性3描述 = '暴击伤害：'
    属性3范围 = [12, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.3)
        属性.伤害增加加成(0.1 - self.属性1选择 / 100)
        属性.暴击伤害加成(0.12 - self.属性3选择 / 100)
        属性.技能攻击力加成(0.11)
        属性.所有属性强化加成(32 - self.属性2选择 * 4)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +149<br>'
        temp += '智力 +100<br>'
        temp += '百分比力智 +30%<br>'
        temp += '技能攻击力 +11%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '伤害增加 +%d%%<br>' % (10 - self.属性1选择)
        temp += '所有属性强化 +%d<br>' % (32 - 4 * self.属性2选择)
        temp += '暴击伤害 +%d%%<br>' % (12 - self.属性3选择)
        return temp      

class 装备196():
    名称 = '肯那兹：精神燎原之火'
    模式 = 0
    所属套装 = '上古尘封术士'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.2)
        属性.附加伤害加成(0.12)
        属性.所有属性强化加成(25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '百分比三攻 +20%<br>'
        temp += '附加伤害 +12%<br>'
        temp += '所有属性强化 +25<br>'
        return temp    

class 装备197():
    名称 = '驱散月光之黎明'
    模式 = 0
    所属套装 = '破晓曦光'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.04  + 0.01 * min(13, 属性.获取强化(self.部位)))
        属性.百分比三攻加成(0.06)
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 50, 70, 1)
        属性.技能恢复加成(35, 45, 0.30)   
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '百分比三攻 +6%<br>'
        temp += '百分比力智 +' + str(4 + min(13,属性.获取强化(self.部位))) + '%<br>'
        temp += '所有属性强化 +28<br>'
        temp += 'Lv50-70 技能等级+1<br>'
        temp += 'Lv35-45 技能恢复+30%<br>'
        return temp     

class 装备198():
    名称 = '四叶草之初心'
    模式 = 0
    所属套装 = '幸运三角'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.07)
        属性.百分比三攻加成(0.07)
        属性.伤害增加加成(0.07)
        属性.暴击伤害加成(0.07)
        属性.最终伤害加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '百分比力智 +7%<br>'
        temp += '百分比三攻 +7%<br>'
        temp += '伤害增加 +7%<br>'
        temp += '暴击伤害 +7%<br>'
        temp += '最终伤害 +7%<br>'
        return temp      

class 装备199():
    名称 = '冷焰之冰-温蒂妮'
    模式 = 0
    所属套装 = '精灵使的权能'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(38)
        属性.百分比三攻加成(0.27)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '所有属性强化 +38<br>'
        temp += '百分比三攻 +27%<br>'
        return temp      

class 装备200():
    名称 = '堕落世界树之生命'
    模式 = 0
    所属套装 = '深渊窥视者'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.4)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '百分比力智 +40%<br>'
        return temp    

class 装备201():
    名称 = '引路者的四季项链'
    模式 = 0
    所属套装 = '圣者的黄昏'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.35)
        属性.技能冷却缩减(1, 45, 0.10)
        属性.技能冷却缩减(60, 80, 0.10)
        属性.技能冷却缩减(90, 95, 0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '附加伤害 +35%<br>'
        temp += 'Lv1-45  技能CD-10%<br>'
        temp += 'Lv60-80 技能CD-10%<br>'
        temp += 'Lv90-95 技能CD-10%<br>'
        temp += '移动速度 +10%<br>'
        return temp        

class 装备202():
    名称 = '悲痛者项链'
    模式 = 0
    所属套装 = '坎坷命运'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.1)
        属性.最终伤害加成(0.28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.04
        属性.移动速度 += 0.04
        属性.释放速度 += 0.06
        if 属性.装备检查('地狱边缘'):
            属性.攻击速度 -= 0.01
            属性.移动速度 -= 0.01
            属性.释放速度 -= 0.015
        if 属性.装备检查('悲情者遗物'):
            属性.攻击速度 -= 0.01
            属性.移动速度 -= 0.01
            属性.释放速度 -= 0.015
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '最终伤害 +28%<br>'
        temp += '攻击速度 +4%<br>'
        temp += '移动速度 +4%<br>'
        temp += '释放速度 +6%<br>'
        if 属性.装备检查('地狱边缘'):
            temp += '攻击速度 -1%<br>'
            temp += '移动速度 -1%<br>'
            temp += '释放速度 -1.5%<br>'
        if 属性.装备检查('悲情者遗物'):
            temp += '攻击速度 -1%<br>'
            temp += '移动速度 -1%<br>'
            temp += '释放速度 -1.5%<br>'
        return temp        

class 装备203():
    名称 = '激狂之怒'
    模式 = 0
    所属套装 = '吞噬愤怒'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.3)
        属性.持续伤害 += 0.1
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '百分比三攻 +30%<br>'
        temp += '持续伤害 +10%<br>'
        return temp        

class 装备204():
    名称 = '盖柏：完美的均衡'
    模式 = 0
    所属套装 = '上古尘封术士'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.2)
        属性.附加伤害加成(0.12)
        属性.所有属性强化加成(25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '百分比力智 +20%<br>'
        temp += '附加伤害 +12%<br>'
        temp += '所有属性强化 +25<br>'
        temp += '攻击速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        return temp        

class 装备205():
    名称 = '寂静无言之露珠'
    模式 = 0
    所属套装 = '破晓曦光'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.04  + 0.01 * min(13, 属性.获取强化(self.部位)))
        属性.所有属性强化加成(30)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 75, 85, 1)
        属性.技能恢复加成(60, 80, 0.30) 
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '技能伤害 +' +str(4 + min(13,属性.获取强化(self.部位))) +'<br>'
        temp += '所有属性强化 +30<br>'
        temp += 'Lv75-85 技能等级+1<br>'
        temp += 'Lv60-80 技能恢复+30%<br>'
        return temp        

class 装备206():
    名称 = '红兔之祝福'
    模式 = 0
    所属套装 = '幸运三角'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.07)
        属性.百分比三攻加成(0.07)
        属性.伤害增加加成(0.07)
        属性.暴击伤害加成(0.07)
        属性.最终伤害加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '百分比力智 +7%<br>'
        temp += '百分比三攻 +7%<br>'
        temp += '伤害增加 +7%<br>'
        temp += '暴击伤害 +7%<br>'
        temp += '最终伤害 +7%<br>'
        return temp        

class 装备207():
    名称 = '祝福之风-西尔芙'
    模式 = 0
    所属套装 = '精灵使的权能'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.27)
        属性.所有属性强化加成(38)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.04
        属性.移动速度 += 0.04
        属性.释放速度 += 0.06
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '最终伤害 +27%<br>'
        temp += '所有属性强化 +38<br>'
        temp += '攻击速度 +4%<br>'
        temp += '移动速度 +4%<br>'
        temp += '释放速度 +6%<br>'
        return temp        

class 装备208():
    名称 = '支配黑暗之环'
    模式 = 0
    所属套装 = '地狱求道者'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.4)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '暴击伤害 +40%<br>'
        return temp        

class 装备209():
    名称 = '次元穿越者之印'
    模式 = 0
    所属套装 = '次元旅行者'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.14)
        属性.技能攻击力加成(0.18)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 60, 80, 1)
        pass
    def 其它属性(self, 属性):
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '百分比力智 +14%<br>'
        temp += '技能攻击力 +18%<br>'
        temp += 'Lv60-80 技能等级+1<br>'
        temp += '释放速度 +15%<br>'
        return temp        

class 装备210():
    名称 = '命运的捉弄'
    模式 = 0
    所属套装 = '天命无常'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        if '天命无常[2]' in 属性.套装栏:
            if 属性.天命无常 == 0:
                if 属性.装备检查('命运反抗者'):
                    属性.伤害增加加成(0.12)
                else :
                    属性.伤害增加加成(0.10)
            else:
                if 属性.天命无常 >= 2:
                    属性.伤害增加加成(0.12)
        属性.最终伤害加成(0.06)
        属性.技能攻击力加成(0.19)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '最终伤害 +6%<br>'
        temp += '技能攻击力 +19%<br>'
        if '天命无常[2]' in 属性.套装栏:
            if 属性.天命无常 == 0:
                if 属性.装备检查('命运反抗者'):
                    temp += '伤害增加 +12%<br>'
                else :
                    temp += '伤害增加 +10%<br>'
            else:
                if 属性.天命无常 >= 2:
                    temp += '伤害增加 +12%<br>'
        return temp        

class 装备211():
    名称 = '蓬勃生命的落幕'
    模式 = 0
    所属套装 = '悲剧的残骸'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.27)
        if 属性.悲剧的残骸 == 0:
            if 属性.装备检查('心痛如绞的诀别'):
                属性.附加伤害加成(0.106)
            else:
                属性.附加伤害加成(0.10)
        if 属性.悲剧的残骸 == 1:
            if 属性.装备检查('心痛如绞的诀别'):
                属性.附加伤害加成(0.10)
            else:
                属性.附加伤害加成(0.08)
        if 属性.悲剧的残骸 == 2:
            属性.附加伤害加成(0.10)
        if 属性.悲剧的残骸 == 3:
            属性.附加伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.悲剧的残骸 == 0:
            属性.攻击速度 += 0.021
        if 属性.悲剧的残骸 >= 2:
            属性.攻击速度 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '暴击伤害 +27%<br>'
        if 属性.悲剧的残骸 == 0:
            if 属性.装备检查('心痛如绞的诀别'):
                temp += '附加伤害 +10.6%<br>'
            else:
                temp += '附加伤害 +10%<br>'
            temp += '攻击速度 +2.1%<br>'
        if 属性.悲剧的残骸 == 1:
            if 属性.装备检查('心痛如绞的诀别'):
                temp += '附加伤害 +10%<br>'
            else:
                temp += '附加伤害 +8%<br>'
        if 属性.悲剧的残骸 == 2:
            temp += '附加伤害 +10%<br>'
            temp += '攻击速度 +3%<br>'
        if 属性.悲剧的残骸 == 3:
            temp += '附加伤害 +12%<br>'
            temp += '攻击速度 +3%<br>'
        return temp
#endregion


# region 智慧产物
class 装备245():
    名称 = '噙毒手套'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        if 属性.获取改造(self.部位) >= 1:
            属性.暴击伤害加成(0.33)
        if 属性.获取改造(self.部位) >= 4:
            属性.技能攻击力加成(0.10)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(8 * 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.08
        属性.魔法暴击率 += 0.08
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '物理暴击率 +8%<br>'
        temp += '魔法暴击率 +8%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '所有属性强化 +%d<br>' % (8 * 改造等级)
        if 改造等级 >= 1:
            temp += '暴击伤害 +33%<br>'
        if 改造等级 >= 4:
            temp += '技能攻击力 +10%<br>'
        return temp        

class 装备246():
    名称 = '先知者的预言'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            属性.百分比力智加成(0.18)
        if 属性.获取改造(self.部位) >= 4:
            if 属性.先知者的预言 == 0:
                属性.属性附加加成(0.05 * 0.35)
                属性.技能攻击力加成(0 + (0.10 * 0.35 + 0.15 * 0.3))
            if 属性.先知者的预言 == 1:
                属性.属性附加加成(0.05)
            if 属性.先知者的预言 == 2:
                属性.技能攻击力加成(0.10)
            if 属性.先知者的预言 == 3:
                属性.技能攻击力加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.移动速度 += 0.1
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '伤害增加 +%d%%<br>' % (4*改造等级)
        if 改造等级 >= 1:
            temp += '百分比力智 +18%<br>'
        if 改造等级 >= 4:
            if 属性.先知者的预言 == 0:
                temp += '属性附加 +{:.2f}%<br>'.format(0.05 * 0.35 * 100, 3)
                temp += '技能攻击力 +{:.2f}%<br>'.format((0.10 * 0.35 + 0.15 * 0.3)* 100)
            if 属性.先知者的预言 == 1:
                temp += '属性附加 +5%<br>'
            if 属性.先知者的预言 == 2:
                temp += '技能攻击力 +10%<br>'
            if 属性.先知者的预言 == 3:
                temp += '技能攻击力 +15%<br>'
        return temp

class 装备247():
    名称 = '骸麒之戒'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        if 属性.获取改造(self.部位) >= 5:
            属性.附加伤害加成(0.58)
        if 属性.获取改造(self.部位) >= 1 and 属性.获取改造(self.部位) < 5:
            属性.附加伤害加成(0.40)
        pass
    def 进图属性(self, 属性):
        属性.力量 += 30 * 属性.获取改造(self.部位)
        属性.智力 += 30 * 属性.获取改造(self.部位)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '力量 +{}<br>'.format(30 * 改造等级)
            temp += '智力 +{}<br>'.format(30 * 改造等级)
        if 改造等级 >= 5:
            temp += '附加伤害 +58%<br>'
        if 改造等级>= 1 and 改造等级 < 5:
            temp += '附加伤害 +40%<br>'
        return temp     

class 装备528():
    名称 = '无言的愤怒'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(16 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            属性.百分比力智加成(0.05)
            属性.技能攻击力加成(0.13)
        if 属性.获取改造(self.部位) >= 4:
            属性.属性附加加成(0.05)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '所有属性强化 +%d<br>' % (16 * 改造等级)
        if 改造等级 >= 1:
            temp += '力量、智力 +5%<br>'
            temp += '技能攻击力 +13%<br>'
        if 改造等级 >= 4:
            temp += '属性附加伤害 +5%<br>'
        return temp        

class 装备529():
    名称 = '无形的象征'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            属性.伤害增加加成(0.12)
            属性.附加伤害加成(0.1)
        if 属性.获取改造(self.部位) >= 4:
            属性.持续伤害 +=0.1
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '伤害增加 +%d%%<br>' % (4*改造等级)
        if 改造等级 >= 1:
            temp += '伤害增加 +12%<br>'
            temp += '附加伤害 +10%<br>'
        if 改造等级 >= 4:
            temp += '持续伤害 +10%<br>'
        return temp

class 装备530():
    名称 = '无念的戒指'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 4:
            属性.附加伤害加成(0.1)
        if 属性.获取改造(self.部位) >= 1:
            属性.所有属性强化加成(40)
            属性.伤害增加加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '技能攻击力 +{}%<br>'.format(4 * 改造等级)
        if 改造等级>= 1:
            temp += '所有属性强化 +40<br>'
            temp += '伤害增加 +10%<br>'
        if 改造等级 >= 4:
            temp += '附加伤害 +10%<br>'
        return temp           
#endregion