#装备属性部分

#模式 = 1 仅在第五页面显示

from PublicReference.config import *
from PublicReference.equipment.装备_武器 import *
from PublicReference.equipment.装备_防具 import *
from PublicReference.equipment.装备_首饰 import *
from PublicReference.equipment.装备_特殊 import *
from PublicReference.equipment.装备_套装 import *

#region  100SS防具 
class 装备74():
    名称 = '魔法师[???]的长袍'
    模式 = 0
    所属套装 = '遗忘魔法师的馈赠'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.05)
        属性.百分比三攻加成(0.1)
        属性.最终伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有',1,45,1)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +5%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '最终伤害 +12%<br>'
        temp += 'Lv1-45 技能等级+1<br>'
        return temp      

class 装备75():
    名称 = '死亡阴影夹克'
    模式 = 0
    所属套装 = '死亡阴影'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.04)
        属性.伤害增加加成(0.18)
        属性.暴击伤害加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +4%<br>'
        temp += '伤害增加 +18%<br>'
        temp += '暴击伤害 +10%<br>'
        return temp     

class 装备76():
    名称 = '燃烧烈焰之勇气'
    模式 = 0
    所属套装 = '贫瘠沙漠的遗产'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(属性.技能栏空位 / 100)
        属性.暴击伤害加成(0.28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +' + str(属性.技能栏空位) + '%<br>'
        temp += '暴击伤害 +28%<br>'
        return temp      

class 装备77():
    名称 = '撒旦：沸腾之怒'
    模式 = 0
    所属套装 = '噩梦：地狱之路'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.16)
        属性.暴击伤害加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +16%<br>'
        temp += '暴击伤害 +16%<br>'
        return temp      

class 装备78():
    名称 = '奔流不息之岁月'
    模式 = 0
    所属套装 = '永恒不息之路'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.3)
        if 属性.职业 == '缔造者':
            属性.技能倍率加成(50, -0.3)
            属性.技能恢复加成(50, 50, 1.00)
        else:
            属性.技能倍率加成(45, -0.3)
            属性.技能恢复加成(45, 45, 1.00)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +30%<br>'
        if 属性.职业 == '缔造者':
            temp += 'Lv50技能：<br>攻击力-30%  恢复+100%<br>'
        else:
            temp += 'Lv45技能：<br>攻击力-30%  恢复+100%<br>'
        return temp      

class 装备79():
    名称 = '优雅旋律华尔兹'
    模式 = 0
    所属套装 = '天堂舞姬'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.17)
        属性.暴击伤害加成(0.14)
        属性.技能冷却缩减(1, 45, 0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +17%<br>'
        temp += '暴击伤害 +14%<br>'
        temp += 'Lv1-45 技能CD-10%<br>'
        return temp
     
class 装备80():
    名称 = '首席执行官裁决夹克'
    模式 = 0
    所属套装 = '皇家裁决者宣言'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.19)
        属性.暴击伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +19%<br>'
        temp += '暴击伤害 +14%<br>'
        return temp      

class 装备81():
    名称 = '炙炎：火龙果'
    模式 = 0
    所属套装 = '炙炎之盛宴'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.16)
        属性.暴击伤害加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +16%<br>'
        temp += '暴击伤害 +15%<br>'
        temp += '攻击速度 +10%<br>'
        return temp    

class 装备82():
    名称 = '妖精之姿'
    模式 = 0
    所属套装 = '传奇铁匠-封神'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '最终伤害 +34%<br>'
        temp += '移动速度 +10%<br>'
        return temp      

class 装备83():
    名称 = '人性的抉择'
    模式 = 0
    所属套装 = '命运歧路'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.11)
        属性.伤害增加加成(0.21)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +11%<br>'
        temp += '伤害增加 +21%<br>'
        return temp     

class 装备84():
    名称 = '大祭司的星祈礼袍'
    模式 = 0
    所属套装 = '古代祭祀的神圣仪式'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.1)
        属性.百分比三攻加成(0.1)
        属性.最终伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +10%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '最终伤害 +12%<br>'
        return temp      

class 装备85():
    名称 = '冲锋陷阵胸甲'
    模式 = 0
    所属套装 = '龙血玄黄'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            属性.百分比三攻加成(0.35)
        else:
            属性.百分比三攻加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            temp += '百分比三攻 +35%<br>'
        else:
            temp += '百分比三攻 +34%<br>'
        return temp    

class 装备86():
    名称 = '气吞山河战甲'
    模式 = 0
    所属套装 = '擎天战甲'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.34)
        if 属性.职业 == '缔造者':
            属性.技能等级加成('所有', 50, 50, 2)
        else:
            属性.技能等级加成('所有', 45, 45, 2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +34%<br>'
        if 属性.职业 == '缔造者':
            temp += 'Lv50 技能等级+2<br>'
        else:
            temp += 'Lv45 技能等级+2<br>'
        return temp

class 装备87():
    名称 = '千链锁灵战甲'
    模式 = 0
    所属套装 = '荆棘漫天'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +35%<br>'
        return temp     

class 装备88():
    名称 = '宽恕坚韧之地'
    模式 = 0
    所属套装 = '大自然的呼吸'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.28)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(24)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +28%<br>'
        temp += '所有属性强化 +24<br>'
        return temp    

class 装备89():
    名称 = '堕落深渊黑魔法衬衫'
    模式 = 0
    所属套装 = '深渊窥视者'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '最终伤害 +35%<br>'
        return temp     

class 装备90():
    名称 = '引路者的黄昏披风'
    模式 = 0
    所属套装 = '圣者的黄昏'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.2)
        属性.百分比三攻加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +20%<br>'
        temp += '百分比三攻 +12%<br>'
        return temp     

class 装备91():
    名称 = '地狱边缘'
    模式 = 0
    所属套装 = '坎坷命运'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.04
        属性.移动速度 += 0.04
        属性.释放速度 += 0.06
        if 属性.装备检查('悲痛者项链'):
            属性.攻击速度 -= 0.01
            属性.移动速度 -= 0.01
            属性.释放速度 -= 0.015
        if 属性.装备检查('悲情者遗物'):
            属性.攻击速度 -= 0.01
            属性.移动速度 -= 0.01
            属性.释放速度 -= 0.015
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +35%<br>'
        temp += '攻击速度 +4%<br>'
        temp += '移动速度 +4%<br>'
        temp += '释放速度 +6%<br>'
        if 属性.装备检查('悲痛者项链'):
            temp += '攻击速度 -1%<br>'
            temp += '移动速度 -1%<br>'
            temp += '释放速度 -1.5%<br>'
        if 属性.装备检查('悲情者遗物'):
            temp += '攻击速度 -1%<br>'
            temp += '移动速度 -1%<br>'
            temp += '释放速度 -1.5%<br>'
        return temp     

class 装备92():
    名称 = '泣血之恨'
    模式 = 0
    所属套装 = '吞噬愤怒'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.23)
        属性.持续伤害 += 0.1
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +23%<br>'
        temp += '持续伤害 +10%<br>'
        return temp      

class 装备93():
    名称 = '大魔法师[???]的长袍'
    模式 = 0
    所属套装 = '遗忘魔法师的馈赠'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '布甲'

    属性1描述 = '伤害增加：'
    属性1范围 = [11, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能等级Lv1 -'
    属性2范围 = [45, 5, 5]
    属性2选择 = 0
    属性3描述 = '百分比力智：'
    属性3范围 = [12, 3, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.05 + (12 - self.属性3选择) / 100)
        属性.百分比三攻加成(0.1)
        属性.伤害增加加成((11 - self.属性1选择) / 100)
        属性.最终伤害加成(0.12)
        属性.技能等级加成('所有', 1, (45 - self.属性2选择 * 5) , 1)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 1, 45, 1)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +5%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '最终伤害 +12%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '伤害增加 +%d%%<br>' % (11 - self.属性1选择)
        temp += 'Lv1-%d 技能等级+1<br>' % (45 - self.属性2选择 * 5)
        temp += '百分比力智 +%d%%<br>' % (12 - self.属性3选择)
        return temp 

class 装备94():
    名称 = '掌管生死之影夹克'
    模式 = 0
    所属套装 = '死亡阴影'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '皮甲'

    属性1描述 = '百分比力智：'
    属性1范围 = [10, 1, 1]
    属性1选择 = 0
    属性2描述 = '暴击伤害：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '物攻/魔攻/独立 +'
    属性3范围 = [170, 80, 10]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.物理攻击力 += 170 - self.属性3选择 * 10
        属性.魔法攻击力 += 170 - self.属性3选择 * 10
        属性.独立攻击力 += 170 - self.属性3选择 * 10
        属性.百分比力智加成(0.10 - self.属性1选择 / 100)
        属性.百分比三攻加成(0.04)
        属性.伤害增加加成(0.18)
        属性.暴击伤害加成(0.2 - self.属性2选择 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +4%<br>'
        temp += '伤害增加 +18%<br>'
        temp += '暴击伤害 +10%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '百分比力智 +%d%%<br>' % (10 - self.属性1选择)
        temp += '暴击伤害 +%d%%<br>' % (10 - self.属性2选择)
        temp += '物攻/魔攻/独立 +%d<br>' % (170 - 10 * self.属性3选择)
        return temp     

class 装备95():
    名称 = '爆裂大地之勇猛'
    模式 = 0
    所属套装 = '贫瘠沙漠的遗产'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '轻甲'

    属性1描述 = '百分比三攻：'
    属性1范围 = [8, 1, 1]
    属性1选择 = 0
    属性2描述 = '百分比力智：'
    属性2范围 = [8, 1, 1]
    属性2选择 = 0
    属性3描述 = '暴击伤害：'
    属性3范围 = [15, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.08 - self.属性2选择 / 100)
        属性.百分比三攻加成(0.08 - self.属性1选择 / 100)
        属性.伤害增加加成(属性.技能栏空位 / 100)
        属性.暴击伤害加成(0.43 - self.属性3选择 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +28%<br>'
        temp += '伤害增加 +' + str(属性.技能栏空位) + '%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '百分比三攻 +%d%%<br>' % (8 - self.属性1选择)
        temp += '百分比力智 +%d%%<br>' % (8 - self.属性2选择)
        temp += '暴击伤害 +%d%%<br>' % (15 - self.属性3选择)
        return temp     

class 装备96():
    名称 = '撒旦：愤怒之王'
    模式 = 0
    所属套装 = '噩梦：地狱之路'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '重甲'

    属性1描述 = '持续伤害：'
    属性1范围 = [5, 2, 1]
    属性1选择 = 0
    属性2描述 = '暴击伤害：'
    属性2范围 = [7, 1, 1]
    属性2选择 = 0
    属性3描述 = '附加伤害：'
    属性3范围 = [4, 1, 1]
    属性3选择 = 0
    属性4描述 = '伤害增加：'
    属性4范围 = [9, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.25 - self.属性4选择 / 100)
        属性.暴击伤害加成(0.23 - self.属性2选择 / 100)
        属性.附加伤害加成(0.04 - self.属性3选择 / 100)
        属性.持续伤害 += 0.05 - self.属性1选择 / 100
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +16%<br>'
        temp += '暴击伤害 +16%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '持续伤害 +%d%%<br>' % (5 - self.属性1选择)
        temp += '暴击伤害 +%d%%<br>' % (7 - self.属性2选择)
        temp += '附加伤害 +%d%%<br>' % (4 - self.属性3选择)
        temp += '伤害增加 +%d%%<br>' % (9 - self.属性4选择)
        return temp    

class 装备97():
    名称 = '英明循环之生命'
    模式 = 0
    所属套装 = '永恒不息之路'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '板甲'

    属性1描述 = '技能等级Lv25 -'
    属性1范围 = [45, 30, 5]
    属性1选择 = 0
    属性2描述 = '附加伤害：'
    属性2范围 = [5, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比力智：'
    属性3范围 = [8, 1, 1]
    属性3选择 = 0
    属性4描述 = '最终伤害：'
    属性4范围 = [6, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.08 - self.属性3选择 / 100)
        属性.伤害增加加成(0.3)
        属性.附加伤害加成(0.05 - self.属性2选择 / 100)
        属性.最终伤害加成(0.06 - self.属性4选择 / 100)
        if 属性.职业 == '缔造者':
            属性.技能倍率加成(50, -0.3)
            属性.技能恢复加成(50, 50, 1.00)
        else:
            属性.技能倍率加成(45, -0.3)
            属性.技能恢复加成(45, 45, 1.00)
        属性.技能等级加成('所有', 25, 45 - self.属性1选择 * 5, 1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +30%<br>'
        if 属性.职业 == '缔造者':
            temp += 'Lv50技能：<br>攻击力-30%  恢复+100%<br>'
        else:
            temp += 'Lv45技能：<br>攻击力-30%  恢复+100%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += 'Lv25-%d 技能等级+1<br>' % (45 - 5 * self.属性1选择)
        temp += '附加伤害 +%d%%<br>' % (5 - self.属性2选择)
        temp += '百分比力智 +%d%%<br>' % (8 - self.属性3选择)
        temp += '最终伤害 +%d%%<br>' % (6 - self.属性4选择)
        return temp       

class 装备98():
    名称 = '浪漫旋律华尔兹'
    模式 = 0
    所属套装 = '天堂舞姬'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '布甲'

    属性1描述 = '百分比三攻：'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '最终伤害：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '伤害增加：'
    属性3范围 = [8, 1, 1]
    属性3选择 = 0
    属性4描述 = '所有属性强化 +'
    属性4范围 = [24, 12, 4]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.03 - self.属性1选择 / 100)
        属性.伤害增加加成(0.25 - self.属性3选择 / 100)
        属性.暴击伤害加成(0.14)
        属性.最终伤害加成(0.1 - self.属性2选择 / 100)
        属性.所有属性强化加成(24 - self.属性4选择 * 4)
        属性.技能冷却缩减(1, 45, 0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +17%<br>'
        temp += '暴击伤害 +14%<br>'
        temp += 'Lv1-45 技能CD-10%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '百分比三攻 +%d%%<br>' % (3 - self.属性1选择)
        temp += '最终伤害 +%d%%<br>' % (10 - self.属性2选择)
        temp += '伤害增加 +%d%%<br>' % (8 - self.属性3选择)
        temp += '所有属性强化 +%d<br>' % (24 - 4 * self.属性4选择)
        return temp     

class 装备99():
    名称 = '皇家裁决者审判外套'
    模式 = 0
    所属套装 = '皇家裁决者宣言'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '皮甲'

    属性1描述 = '暴击伤害：'
    属性1范围 = [7, 1, 1]
    属性1选择 = 0
    属性2描述 = '伤害增加：'
    属性2范围 = [5, 1, 1]
    属性2选择 = 0
    属性3描述 = '附加伤害：'
    属性3范围 = [6, 1, 1]
    属性3选择 = 0
    属性4描述 = '最终伤害：'
    属性4范围 = [5, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.19)
        属性.伤害增加加成(0.05 - self.属性2选择 / 100)
        属性.暴击伤害加成(0.21 - self.属性1选择 / 100)
        属性.附加伤害加成(0.06 - self.属性3选择 / 100)
        属性.最终伤害加成(0.05 - self.属性4选择 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +19%<br>'
        temp += '暴击伤害 +14%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '暴击伤害 +%d%%<br>' % (7 - self.属性1选择)
        temp += '伤害增加 +%d%%<br>' % (5 - self.属性2选择)
        temp += '附加伤害 +%d%%<br>' % (6 - self.属性3选择)
        temp += '最终伤害 +%d%%<br>' % (5 - self.属性4选择)
        return temp
     
class 装备100():
    名称 = '炙炎：霸王树'
    模式 = 0
    所属套装 = '炙炎之盛宴'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '轻甲'

    属性1描述 = '最终伤害：'
    属性1范围 = [10, 1, 1]
    属性1选择 = 0
    属性2描述 = '暴击伤害：'
    属性2范围 = [8, 1, 1]
    属性2选择 = 0
    属性3描述 = '伤害增加：'
    属性3范围 = [4, 1, 1]
    属性3选择 = 0
    属性4描述 = '百分比力智：'
    属性4范围 = [3, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.03 - self.属性4选择 / 100)
        属性.百分比三攻加成(0.16)
        属性.伤害增加加成(0.04 - self.属性3选择 / 100)
        属性.暴击伤害加成(0.23 - self.属性2选择 / 100)
        属性.最终伤害加成(0.1 - self.属性1选择 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +16%<br>'
        temp += '暴击伤害 +15%<br>'
        temp += '攻击速度 +15%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '最终伤害 +%d%%<br>' % (10 - self.属性1选择)
        temp += '暴击伤害 +%d%%<br>' % (8 - self.属性2选择)
        temp += '伤害增加 +%d%%<br>' % (4 - self.属性3选择)
        temp += '百分比力智 +%d%%<br>' % (3 - self.属性4选择)
        return temp     

class 装备101():
    名称 = '天堂之翼'
    模式 = 0
    所属套装 = '传奇铁匠-封神'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '重甲'

    属性1描述 = '附加伤害：'
    属性1范围 = [9, 1, 1]
    属性1选择 = 0
    属性2描述 = '百分比力智：'
    属性2范围 = [4, 1, 1]
    属性2选择 = 0
    属性3描述 = '最终伤害：'
    属性3范围 = [4, 1, 1]
    属性3选择 = 0
    属性4描述 = '百分比三攻：'
    属性4范围 = [7, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.04 - self.属性2选择 / 100)
        属性.百分比三攻加成(0.07 - self.属性4选择 / 100)
        属性.附加伤害加成(0.09 - self.属性1选择 / 100)
        属性.最终伤害加成(0.38 - self.属性3选择 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.5
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '最终伤害 +34%<br>'
        temp += '移动速度 +5%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '附加伤害 +%d%%<br>' % (9 - self.属性1选择)
        temp += '百分比力智 +%d%%<br>' % (4 - self.属性2选择)
        temp += '最终伤害 +%d%%<br>' % (4 - self.属性3选择)
        temp += '百分比三攻 +%d%%<br>' % (7 - self.属性4选择)
        return temp     

class 装备102():
    名称 = '神赐的抉择'
    模式 = 0
    所属套装 = '命运歧路'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '板甲'

    属性1描述 = '伤害增加：'
    属性1范围 = [5, 1, 1]
    属性1选择 = 0
    属性2描述 = '暴击伤害：'
    属性2范围 = [7, 1, 1]
    属性2选择 = 0
    属性3描述 = '最终伤害：'
    属性3范围 = [6, 1, 1]
    属性3选择 = 0
    属性4描述 = '附加伤害：'
    属性4范围 = [5, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.21)
        属性.百分比三攻加成(0.11)
        属性.伤害增加加成(0.05 - self.属性1选择 / 100)
        属性.暴击伤害加成(0.07 - self.属性2选择 / 100)
        属性.附加伤害加成(0.05 - self.属性4选择 / 100)
        属性.最终伤害加成(0.06 - self.属性3选择 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +21%<br>'
        temp += '百分比三攻 +11%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '伤害增加 +%d%%<br>' % (5 - self.属性1选择)
        temp += '暴击伤害 +%d%%<br>' % (7 - self.属性2选择)
        temp += '最终伤害 +%d%%<br>' % (6 - self.属性3选择)
        temp += '附加伤害 +%d%%<br>' % (5 - self.属性4选择)
        return temp       

class 装备103():
    名称 = '大祭司的神启礼服'
    模式 = 0
    所属套装 = '古代祭祀的神圣仪式'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '布甲'

    属性1描述 = '附加伤害：'
    属性1范围 = [10, 2, 1]
    属性1选择 = 0
    属性2描述 = '百分比力智：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比三攻：'
    属性3范围 = [11, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.2 - self.属性2选择 / 100)
        属性.百分比三攻加成(0.21 - self.属性3选择 / 100)
        属性.附加伤害加成(0.1 - self.属性1选择 / 100)
        属性.最终伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +10%<br>'
        temp += '百分比三攻 +11%<br>'
        temp += '最终伤害 +12%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '附加伤害 +%d%%<br>' % (10 - self.属性1选择)
        temp += '百分比力智 +%d%%<br>' % (10 - self.属性2选择)
        temp += '百分比三攻 +%d%%<br>' % (11 - self.属性3选择)
        return temp    

class 装备104():
    名称 = '战无不胜上衣'
    模式 = 0
    所属套装 = '龙血玄黄'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '皮甲'

    属性1描述 = '伤害增加：'
    属性1范围 = [4, 1, 1]
    属性1选择 = 0
    属性2描述 = '百分比三攻：'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '暴击伤害：'
    属性3范围 = [10, 1, 1]
    属性3选择 = 0
    属性4描述 = '百分比力智：'
    属性4范围 = [8, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.08 - self.属性4选择 / 100)
        属性.百分比三攻加成(0.38 - self.属性2选择 / 100)
        属性.伤害增加加成(0.04 - self.属性1选择 / 100)
        属性.暴击伤害加成(0.1 - self.属性3选择 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +35%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '伤害增加 +%d%%<br>' % (4 - self.属性1选择)
        temp += '百分比三攻 +%d%%<br>' % (3 - self.属性2选择)
        temp += '暴击伤害 +%d%%<br>' % (10 - self.属性3选择)
        temp += '百分比力智 +%d%%<br>' % (8 - self.属性4选择)
        return temp     

class 装备105():
    名称 = '摧枯拉朽胸甲'
    模式 = 0
    所属套装 = '擎天战甲'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '轻甲'

    属性1描述 = '技能攻击力：'
    属性1范围 = [4, 1, 1]
    属性1选择 = 0
    属性2描述 = '最终伤害：'
    属性2范围 = [4, 1, 1]
    属性2选择 = 0
    属性3描述 = '伤害增加：'
    属性3范围 = [9, 1, 1]
    属性3选择 = 0
    属性4描述 = '暴击伤害：'
    属性4范围 = [7, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.43 - self.属性3选择 / 100)
        属性.暴击伤害加成(0.07 - self.属性4选择 / 100)
        属性.最终伤害加成(0.04 - self.属性2选择 / 100)
        属性.技能攻击力加成(0.04 - self.属性1选择 / 100)
        if 属性.职业 == '缔造者':
            属性.技能等级加成('所有', 50, 50, 2)
        else:
            属性.技能等级加成('所有', 45, 45, 2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +34%<br>'
        if 属性.职业 == '缔造者':
            temp += 'Lv50 技能等级+2<br>'
        else:
            temp += 'Lv45 技能等级+2<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '技能攻击力 +%d%%<br>' % (4 - self.属性1选择)
        temp += '最终伤害 +%d%%<br>' % (4 - self.属性2选择)
        temp += '伤害增加 +%d%%<br>' % (9 - self.属性3选择)
        temp += '暴击伤害 +%d%%<br>' % (7 - self.属性4选择)
        return temp    

class 装备106():
    名称 = '千链万化战甲'
    模式 = 0
    所属套装 = '荆棘漫天'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '重甲'

    属性1描述 = '暴击伤害：'
    属性1范围 = [10, 1, 1]
    属性1选择 = 0
    属性2描述 = '百分比三攻：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '附加伤害：'
    属性3范围 = [10, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.1 - self.属性2选择 / 100)
        属性.伤害增加加成(0.35)
        属性.暴击伤害加成(0.1 - self.属性1选择 / 100)
        属性.附加伤害加成(0.1 - self.属性3选择 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +35%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '暴击伤害 +%d%%<br>' % (10 - self.属性1选择)
        temp += '百分比三攻 +%d%%<br>' % (10 - self.属性2选择)
        temp += '附加伤害 +%d%%<br>' % (10 - self.属性3选择)
        return temp
    
class 装备107():
    名称 = '生命脉动之地'
    模式 = 0
    所属套装 = '大自然的呼吸'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '板甲'

    属性1描述 = '百分比力智：'
    属性1范围 = [12, 1, 1]
    属性1选择 = 0
    属性2描述 = '伤害增加：'
    属性2范围 = [9, 1, 1]
    属性2选择 = 0
    属性3描述 = '最终伤害：'
    属性3范围 = [9, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.4 - self.属性1选择 / 100)
        属性.伤害增加加成(0.09 - self.属性2选择 / 100)
        属性.最终伤害加成(0.09 - self.属性3选择 / 100)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(24)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +28%<br>'
        temp += '所有属性强化 +24<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '百分比力智 +%d%%<br>' % (12 - self.属性1选择)
        temp += '伤害增加 +%d%%<br>' % (9 - self.属性2选择)
        temp += '最终伤害 +%d%%<br>' % (9 - self.属性3选择)
        return temp

class 装备108():
    名称 = '深渊囚禁者长袍'
    模式 = 0
    所属套装 = '深渊窥视者'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '布甲'

    属性1描述 = '技能等级Lv5 -'
    属性1范围 = [100, 10, 5]
    属性1选择 = 0
    属性2描述 = '百分比三攻：'
    属性2范围 = [7, 1, 1]
    属性2选择 = 0
    属性3描述 = '物攻/魔攻/独立 +'
    属性3范围 = [80, 10, 10]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.物理攻击力 += 80 - self.属性3选择 * 10
        属性.魔法攻击力 += 80 - self.属性3选择 * 10
        属性.独立攻击力 += 80 - self.属性3选择 * 10
        属性.百分比三攻加成(0.07 - self.属性2选择 / 100)
        属性.最终伤害加成(0.35)
        属性.技能等级加成('所有', 5, 100 - self.属性1选择 * 5, 1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '最终伤害 +35%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += 'Lv5-%d 技能等级+1<br>' % (100 - 5 * self.属性1选择)
        temp += '百分比三攻 +%d%%<br>' % (7 - self.属性2选择)
        temp += '物攻/魔攻/独立 +%d<br>' % (80 - 10 * self.属性3选择)
        return temp      

class 装备109():
    名称 = '圣者的黄昏披风'
    模式 = 0
    所属套装 = '圣者的黄昏'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '皮甲'

    属性1描述 = '所有属性强化 +'
    属性1范围 = [40, 4, 4]
    属性1选择 = 0
    属性2描述 = '伤害增加：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '附加伤害：'
    属性3范围 = [10, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.2)
        属性.百分比三攻加成(0.12)
        属性.伤害增加加成(0.1 - self.属性2选择 / 100)
        属性.附加伤害加成(0.1 - self.属性3选择 / 100)
        属性.所有属性强化加成(40 - self.属性1选择 * 4)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +20%<br>'
        temp += '百分比三攻 +12%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '所有属性强化 +%d<br>' % (40 - 4 * self.属性1选择)
        temp += '伤害增加 +%d%%<br>' % (10 - self.属性2选择)
        temp += '附加伤害 +%d%%<br>' % (10 - self.属性3选择)
        return temp     

class 装备110():
    名称 = '逆转结局'
    模式 = 0
    所属套装 = '坎坷命运'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '轻甲'

    属性1描述 = '技能等级Lv30 -'
    属性1范围 = [48, 35, 5]
    属性1选择 = 0
    属性2描述 = '物攻/魔攻/独立 +'
    属性2范围 = [70, 10, 10]
    属性2选择 = 0
    属性3描述 = '最终伤害：'
    属性3范围 = [5, 1, 1]
    属性3选择 = 0
    属性4描述 = '力量/智力 +'
    属性4范围 = [160, 40, 20]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.力量 += 160 - self.属性4选择 * 20
        属性.智力 += 160 - self.属性4选择 * 20
        属性.物理攻击力 += 70 - self.属性2选择 * 10
        属性.魔法攻击力 += 70 - self.属性2选择 * 10
        属性.独立攻击力 += 70 - self.属性2选择 * 10
        if 属性.装备检查('悲痛者项链'):
            属性.百分比三攻加成(-0.10)
            属性.附加伤害加成(0.10)
        if 属性.装备检查('悲情者遗物'):
            属性.百分比三攻加成(-0.10)
            属性.附加伤害加成(0.10)
        属性.最终伤害加成(0.05 - self.属性3选择 / 100)
        属性.技能攻击力加成(0.35)
        属性.技能等级加成('所有', 30, min(48, 50 - self.属性1选择 * 5), 1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.06
        属性.移动速度 += 0.06
        属性.释放速度 += 0.09
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '技能攻击力 +35%<br>'
        temp += '攻击速度 +4%<br>'
        temp += '移动速度 +4%<br>'
        temp += '释放速度 +6%<br>'
        if 属性.装备检查('悲痛者项链'):
            temp += '百分比三攻 -10%<br>'
            temp += '附加伤害 +10%<br>'
        if 属性.装备检查('悲情者遗物'):
            temp += '百分比三攻 -10%<br>'
            temp += '附加伤害 +10%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += 'Lv30-%d 技能等级+1<br>' % (min(48, 50 - 5 * self.属性1选择))
        temp += '物攻/魔攻/独立 +%d<br>' % (70 - 10 * self.属性2选择)
        temp += '最终伤害 +%d%%<br>' % (5 - self.属性3选择)
        temp += '力量/智力 +%d<br>' % (160 - 20 * self.属性4选择)
        return temp        

class 装备111():
    名称 = '灭世之怒'
    模式 = 0
    所属套装 = '吞噬愤怒'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '重甲'

    属性1描述 = '最终伤害：'
    属性1范围 = [4, 1, 1]
    属性1选择 = 0
    属性2描述 = '百分比三攻：'
    属性2范围 = [13, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比力智：'
    属性3范围 = [4, 1, 1]
    属性3选择 = 0
    属性4描述 = '技能攻击力：'
    属性4范围 = [5, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.04 - self.属性3选择 / 100)
        属性.百分比三攻加成(0.13 - self.属性2选择 / 100)
        属性.附加伤害加成(0.23)
        属性.持续伤害 += 0.1
        属性.最终伤害加成(0.04 - self.属性1选择 / 100)
        属性.技能攻击力加成(0.05 - self.属性4选择 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +23%<br>'
        temp += '持续伤害 +10%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '最终伤害 +%d%%<br>' % (4 - self.属性1选择)
        temp += '百分比三攻 +%d%%<br>' % (13 - self.属性2选择)
        temp += '百分比力智 +%d%%<br>' % (4 - self.属性3选择)
        temp += '技能攻击力 +%d%%<br>' % (5 - self.属性4选择)
        return temp     

class 装备112():
    名称 = '魔法师[???]的护腿'
    模式 = 0
    所属套装 = '遗忘魔法师的馈赠'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.05)
        属性.百分比三攻加成(0.1)
        属性.伤害增加加成(0.12)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(18)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +5%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '伤害增加 +12%<br>'
        temp += '所有属性强化 +18<br>'
        return temp    

class 装备113():
    名称 = '死亡阴影短裤'
    模式 = 0
    所属套装 = '死亡阴影'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.04)
        属性.伤害增加加成(0.18)
        属性.暴击伤害加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +4%<br>'
        temp += '伤害增加 +18%<br>'
        temp += '暴击伤害 +10%<br>'
        return temp        

class 装备114():
    名称 = '肆虐狂风之意志'
    模式 = 0
    所属套装 = '贫瘠沙漠的遗产'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(属性.技能栏空位 / 100)
        属性.暴击伤害加成(0.16)
        属性.附加伤害加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +' + str(属性.技能栏空位) + '%<br>'
        temp += '暴击伤害 +16%<br>'
        temp += '附加伤害 +10%<br>'
        return temp    

class 装备115():
    名称 = '亚蒙：谎言之力'
    模式 = 0
    所属套装 = '噩梦：地狱之路'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.16)
        属性.最终伤害加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +16%<br>'
        temp += '最终伤害 +16%<br>'
        return temp 

class 装备116():
    名称 = '奔流不息之伽蓝'
    模式 = 0
    所属套装 = '永恒不息之路'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.31)
        属性.技能倍率加成(40, -0.3)
        属性.技能恢复加成(40, 40, 1.0)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +31%<br>'
        temp += 'Lv40技能：<br>攻击力-30%  恢复+100%<br>'
        return temp      

class 装备117():
    名称 = '魅惑律动伦巴'
    模式 = 0
    所属套装 = '天堂舞姬'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.14)
        属性.最终伤害加成(0.17)
        属性.技能冷却缩减(35, 45, 0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +14%<br>'
        temp += '最终伤害 +17%<br>'
        temp += 'Lv35-45 技能CD-15%<br>'
        return temp    

class 装备118():
    名称 = '首席执行官裁决短裤'
    模式 = 0
    所属套装 = '皇家裁决者宣言'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.16)
        属性.最终伤害加成(0.17)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +16%<br>'
        temp += '最终伤害 +17%<br>'
        return temp      

class 装备119():
    名称 = '炙炎：荔枝'
    模式 = 0
    所属套装 = '炙炎之盛宴'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.33)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +33%<br>'
        return temp      

class 装备120():
    名称 = '邪恶之角'
    模式 = 0
    所属套装 = '传奇铁匠-封神'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +34%<br>'
        return temp       

class 装备121():
    名称 = '命运的抉择'
    模式 = 0
    所属套装 = '命运歧路'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        if 属性.命运的抉择 == 0:
            属性.伤害增加加成(0.07)
            属性.暴击伤害加成(0.07)
            属性.附加伤害加成(0.07)
            属性.最终伤害加成(0.07)
            属性.百分比三攻加成(0.07)
        if 属性.命运的抉择 == 1:
            属性.伤害增加加成(0.35)
        if 属性.命运的抉择 == 2:
            属性.暴击伤害加成(0.35)
        if 属性.命运的抉择 == 3:
            属性.附加伤害加成(0.35)
        if 属性.命运的抉择 == 4:
            属性.最终伤害加成(0.35)
        if 属性.命运的抉择 == 5:
            属性.百分比三攻加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        if 属性.命运的抉择 == 0:
            temp += '期望属性：<br>'
            temp += '伤害增加 +7%<br>'
            temp += '暴击伤害 +7%<br>'
            temp += '附加伤害 +7%<br>'
            temp += '最终伤害 +7%<br>'
            temp += '百分比三攻 +7%<br>'
        if 属性.命运的抉择 == 1:
            temp += '伤害增加 +35%<br>'
        if 属性.命运的抉择 == 2:
            temp += '暴击伤害 +35%<br>'
        if 属性.命运的抉择 == 3:
            temp += '附加伤害 +35%<br>'
        if 属性.命运的抉择 == 4:
            temp += '最终伤害 +35%<br>'
        if 属性.命运的抉择 == 5:
            temp += '百分比三攻 +35%<br>'
        return temp      

class 装备122():
    名称 = '大祭司的星祈长裙'
    模式 = 0
    所属套装 = '古代祭祀的神圣仪式'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.1)
        属性.百分比三攻加成(0.1)
        属性.伤害增加加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +10%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '伤害增加 +12%<br>'
        return temp     

class 装备123():
    名称 = '破釜沉舟护腿'
    模式 = 0
    所属套装 = '龙血玄黄'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            属性.暴击伤害加成(0.35)
        else:
            属性.暴击伤害加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            temp += '暴击伤害 +35%<br>'
        else:
            temp += '暴击伤害 +34%<br>'
        return temp     

class 装备124():
    名称 = '雷霆万钧护腿'
    模式 = 0
    所属套装 = '擎天战甲'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.34)
        属性.技能等级加成('所有', 35, 35, 2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +34%<br>'
        temp += 'Lv35 技能等级+2<br>'
        return temp      

class 装备125():
    名称 = '千链锁灵护腿'
    模式 = 0
    所属套装 = '荆棘漫天'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +35%<br>'
        return temp     

class 装备126():
    名称 = '蚕食新绿之息'
    模式 = 0
    所属套装 = '大自然的呼吸'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.32)
        pass
    def 进图属性(self, 属性):
        属性.暗属性强化加成(24)
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.1
        属性.魔法暴击率 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '最终伤害 +32%<br>'
        temp += '暗属性强化 +24<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp      

class 装备127():
    名称 = '驱散黑暗短裤'
    模式 = 0
    所属套装 = '黑魔法探求者'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +35%<br>'
        return temp      

class 装备128():
    名称 = '时空漩涡护腿'
    模式 = 0
    所属套装 = '时空旅行者'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.32)
        属性.技能冷却缩减(60, 80, 0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '最终伤害 +32%<br>'
        temp += 'Lv60-80 技能CD-10%<br>'
        temp += '移动速度 +10%<br>'
        return temp
      
class 装备129():
    名称 = '灵魂的呐喊'
    模式 = 0
    所属套装 = '穿透命运的呐喊'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.14)
        属性.附加伤害加成(0.17)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +14%<br>'
        temp += '附加伤害 +17%<br>'
        return temp      

class 装备130():
    名称 = '疯狂之如影随形'
    模式 = 0
    所属套装 = '狂乱追随者'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.1)
        属性.暴击伤害加成(0.22)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '暴击伤害 +22%<br>'
        return temp     

class 装备131():
    名称 = '魔法师[???]的披风'
    模式 = 0
    所属套装 = '遗忘魔法师的馈赠'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.05)
        属性.百分比三攻加成(0.1)
        属性.技能攻击力加成(0.13)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +5%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '技能攻击力 +13%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp    

class 装备132():
    名称 = '死亡阴影护肩'
    模式 = 0
    所属套装 = '死亡阴影'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.04)
        属性.暴击伤害加成(0.18)
        属性.技能攻击力加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +4%<br>'
        temp += '暴击伤害 +18%<br>'
        temp += '技能攻击力 +10%<br>'
        return temp      

class 装备133():
    名称 = '艰难求生之斗志'
    模式 = 0
    所属套装 = '贫瘠沙漠的遗产'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(属性.技能栏空位 / 100)
        属性.附加伤害加成(0.16)
        属性.技能攻击力加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +' + str(属性.技能栏空位) + '%<br>'
        temp += '附加伤害 +16%<br>'
        temp += '技能攻击力 +10%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp       

class 装备134():
    名称 = '贝利亚尔：毁灭之种'
    模式 = 0
    所属套装 = '噩梦：地狱之路'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.16)
        属性.技能攻击力加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +16%<br>'
        temp += '技能攻击力 +16%<br>'
        return temp     

class 装备135():
    名称 = '奔流不息之山川'
    模式 = 0
    所属套装 = '永恒不息之路'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.1)
        属性.技能攻击力加成(0.2)
        属性.技能倍率加成(35, -0.3)
        属性.技能恢复加成(35, 35, 1.0)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '技能攻击力 +20%<br>'
        temp += 'Lv35技能：<br>攻击力-30%  恢复+100%<br>'
        return temp
      
class 装备136():
    名称 = '性感洒脱探戈'
    模式 = 0
    所属套装 = '天堂舞姬'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.17)
        属性.技能攻击力加成(0.14)
        属性.技能冷却缩减(75, 80, 0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +17%<br>'
        temp += '技能攻击力 +14%<br>'
        temp += 'Lv75-80 技能CD-15%<br>'
        return temp    

class 装备137():
    名称 = '首席执行官裁决肩甲'
    模式 = 0
    所属套装 = '皇家裁决者宣言'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.12)
        属性.技能攻击力加成(0.2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +12%<br>'
        temp += '技能攻击力 +20br>'
        return temp     

class 装备138():
    名称 = '炙炎：榴莲'
    模式 = 0
    所属套装 = '炙炎之盛宴'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.33)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '技能攻击力 +33%<br>'
        return temp    

class 装备139():
    名称 = '魔龙之心'
    模式 = 0
    所属套装 = '传奇铁匠-封神'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.12)
        属性.技能攻击力加成(0.2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.释放速度 += 0.16
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +12%<br>'
        temp += '技能攻击力 +20%<br>'
        temp += '释放速度 +16%<br>'
        return temp      

class 装备140():
    名称 = '矛盾的抉择'
    模式 = 0
    所属套装 = '命运歧路'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '技能攻击力 +34%<br>'
        return temp     

class 装备141():
    名称 = '大祭司的星祈披肩'
    模式 = 0
    所属套装 = '古代祭祀的神圣仪式'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.1)
        属性.百分比三攻加成(0.1)
        属性.技能攻击力加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('大祭司的神启礼服'):
            属性.释放速度 += 0.24
        else:
            属性.释放速度 += 0.18
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +10%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '技能攻击力 +12%<br>'
        if 属性.装备检查('大祭司的神启礼服'):
            temp += '释放速度 +24%<br>'
        else:
            temp += '释放速度 +18%<br>'
        return temp     

class 装备142():
    名称 = '枪林弹雨护肩'
    模式 = 0
    所属套装 = '龙血玄黄'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            属性.技能攻击力加成(0.35)
        else:
            属性.技能攻击力加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            temp += '技能攻击力 +35%<br>'
        else:
            temp += '技能攻击力 +34%<br>'
        return temp
   
class 装备143():
    名称 = '排山倒海护肩'
    模式 = 0
    所属套装 = '擎天战甲'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.34)
        属性.技能等级加成('所有', 60, 60, 2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '技能攻击力 +34%<br>'
        temp += 'Lv60 技能等级+2<br>'
        return temp     

class 装备144():
    名称 = '千链锁灵肩甲'
    模式 = 0
    所属套装 = '荆棘漫天'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += -0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '技能攻击力 +34%<br>'
        temp += '攻击速度 -10%<br>'
        return temp       

class 装备145():
    名称 = '猛烈燃烧之炎'
    模式 = 0
    所属套装 = '大自然的呼吸'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.32)
        pass
    def 进图属性(self, 属性):
        属性.火属性强化加成(24)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '技能攻击力 +32%<br>'
        temp += '火属性强化 +24<br>'
        temp += '攻击速度 +10%<br>'
        return temp      

class 装备146():
    名称 = '魔法师[???]的长靴'
    模式 = 0
    所属套装 = '遗忘魔法师的馈赠'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.05)
        属性.百分比三攻加成(0.1)
        属性.暴击伤害加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.移动速度 += 0.14
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +5%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '暴击伤害 +16%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +14%<br>'
        temp += '释放速度 +15%<br>'
        return temp      

class 装备147():
    名称 = '死亡阴影长靴'
    模式 = 0
    所属套装 = '死亡阴影'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.04)
        属性.暴击伤害加成(0.1)
        属性.附加伤害加成(0.18)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +4%<br>'
        temp += '暴击伤害 +10%<br>'
        temp += '附加伤害 +18%<br>'
        temp += '移动速度 +4%<br>'
        return temp     

class 装备148():
    名称 = '寂静寒夜之忍耐'
    模式 = 0
    所属套装 = '贫瘠沙漠的遗产'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.28)
        属性.伤害增加加成(属性.技能栏空位 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +28%<br>'
        temp += '伤害增加 +' + str(属性.技能栏空位) + '%<br>'
        temp += '移动速度 +4%<br>'
        return temp     

class 装备149():
    名称 = '巴尔：堕落之魂'
    模式 = 0
    所属套装 = '噩梦：地狱之路'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.16)
        属性.伤害增加加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +16%<br>'
        temp += '伤害增加 +16%<br>'
        temp += '移动速度 +4%<br>'
        return temp      

class 装备150():
    名称 = '奔流不息之银河'
    模式 = 0
    所属套装 = '永恒不息之路'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.28)
        属性.技能倍率加成(25, -0.3)
        属性.技能恢复加成(25, 25, 1.0)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +28%<br>'
        temp += 'Lv25技能：<br>攻击力-30%  恢复+100%<br>'
        temp += '移动速度 +4%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp     

class 装备151():
    名称 = '激烈欢动踢踏'
    模式 = 0
    所属套装 = '天堂舞姬'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.17)
        属性.附加伤害加成(0.14)
        属性.技能冷却缩减(1, 30, 0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +17%<br>'
        temp += '附加伤害 +14%<br>'
        temp += 'Lv1-30 技能CD-15%<br>'
        temp += '移动速度 +4%<br>'
        return temp   

class 装备152():
    名称 = '首席执行官裁决长靴'
    模式 = 0
    所属套装 = '皇家裁决者宣言'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.11)
        属性.最终伤害加成(0.21)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +11%<br>'
        temp += '最终伤害 +21%<br>'
        temp += '移动速度 +4%<br>'
        return temp     

class 装备153():
    名称 = '炙炎：木瓜'
    模式 = 0
    所属套装 = '炙炎之盛宴'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.3)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.19
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +30%<br>'
        temp += '移动速度 +19%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp      

class 装备154():
    名称 = '自然之核'
    模式 = 0
    所属套装 = '传奇铁匠-封神'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(70)
        属性.技能等级加成('所有', 1, 85, 1)
        属性.技能等级加成('所有', 100, 100, 1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '所有属性强化 +70<br>'
        temp += 'Lv1-85 技能等级+1<br>'
        temp += 'Lv100  技能等级+1<br>'
        temp += '移动速度 +4%<br>'
        return temp     

class 装备155():
    名称 = '守护的抉择'
    模式 = 0
    所属套装 = '命运歧路'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.17)
        if 属性.护石第一栏 != '无':
            属性.单技能修改(属性.护石第一栏, 1.55, 0.7)
        if 属性.护石第二栏 != '无':
            属性.单技能修改(属性.护石第二栏, 1.45, 0.75)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += 属性.护石第一栏 + '：<br>攻击力 +55% 冷却 -30%<br>'
        temp += 属性.护石第二栏 + '：<br>攻击力 +45% 冷却 -25%<br>'
        temp += '附加伤害 +17%<br>'
        temp += '移动速度 +4%<br>'
        return temp     

class 装备156():
    名称 = '大祭司的星祈凉鞋'
    模式 = 0
    所属套装 = '古代祭祀的神圣仪式'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.1)
        属性.百分比三攻加成(0.1)
        属性.附加伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('大祭司的神启礼服'):
            属性.移动速度 += 0.18
        else:
            属性.移动速度 += 0.12
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +10%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '附加伤害 +12%<br>'
        if 属性.装备检查('大祭司的神启礼服'):
            temp += '移动速度 +18%<br>'
        else:
            temp += '移动速度 +12%<br>'
        return temp      

class 装备157():
    名称 = '赤地千里战靴'
    模式 = 0
    所属套装 = '龙血玄黄'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            属性.百分比力智加成(0.35)
        else:
            属性.百分比力智加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            temp += '百分比力智 +35%<br>'
        else:
            temp += '百分比力智 +34%<br>'
        temp += '移动速度 +4%<br>'
        return temp     

class 装备158():
    名称 = '遮天蔽日长靴'
    模式 = 0
    所属套装 = '擎天战甲'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.34)
        属性.技能等级加成('所有', 70, 70, 2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '最终伤害 +34%<br>'
        temp += 'Lv70 技能等级+2<br>'
        temp += '移动速度 +4%<br>'
        return temp     

class 装备159():
    名称 = '千链锁灵战靴'
    模式 = 0
    所属套装 = '荆棘漫天'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += -0.06
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '最终伤害 +35%<br>'
        temp += '移动速度 -6%<br>'
        return temp      

class 装备160():
    名称 = '交织烈日之风'
    模式 = 0
    所属套装 = '大自然的呼吸'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.32)
        pass
    def 进图属性(self, 属性):
        属性.光属性强化加成(24)
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.14
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +32%<br>'
        temp += '光属性强化 +24<br>'
        temp += '移动速度 +14%<br>'
        return temp       

class 装备161():
    名称 = '堕入地狱之脚'
    模式 = 0
    所属套装 = '地狱求道者'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(70)
        属性.技能等级加成('所有', 1, 90, 1)
        属性.技能等级加成('所有', 100, 100, 1)
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '所有属性强化 +70<br>'
        temp += 'Lv1-90 技能等级+1<br>'
        temp += 'Lv100  技能等级+1<br>'
        temp += '移动速度 +4%<br>'
        return temp     

class 装备162():
    名称 = '次元漫步者长靴'
    模式 = 0
    所属套装 = '次元旅行者'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.1)
        属性.伤害增加加成(0.19)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 1, 45, 1)
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.14
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '伤害增加 +19%<br>'
        temp += 'Lv1-45 技能等级+1<br>'
        temp += '移动速度 +14%<br>'
        return temp    

class 装备163():
    名称 = '悲喜交加'
    模式 = 0
    所属套装 = '天命无常'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.29)
        pass
    def 进图属性(self, 属性):
        if '天命无常[2]' in 属性.套装栏:
            if 属性.天命无常 == 0:
                if 属性.装备检查('命运反抗者'):
                    属性.所有属性强化加成(24)
                else :
                    属性.所有属性强化加成(20)
            elif 属性.天命无常 % 2 == 0:
                    属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +29%<br>'
        temp += '移动速度 +4%<br>'
        if 属性.天命无常 == 0:
            if 属性.装备检查('命运反抗者'):
                temp += '所有属性强化 +24(期望)<br>'
            else:
                temp += '所有属性强化 +20(期望)<br>'
        elif 属性.天命无常 % 2 == 0:
            temp += '所有属性强化 +40<br>'
        return temp     

class 装备164():
    名称 = '崩溃世界的忧伤'
    模式 = 0
    所属套装 = '悲剧的残骸'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.17)
        if 属性.悲剧的残骸 == 0:
            if 属性.装备检查('心痛如绞的诀别'):
                属性.附加伤害加成(0.106)
            else:
                属性.附加伤害加成(0.10)
        elif 属性.悲剧的残骸 == 1:
            if 属性.装备检查('心痛如绞的诀别'):
                属性.附加伤害加成(0.10)
            else:
                属性.附加伤害加成(0.08)
        elif 属性.悲剧的残骸 == 2:
            属性.附加伤害加成(0.10)
        elif 属性.悲剧的残骸 == 3:
            属性.附加伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.悲剧的残骸 == 0:
            属性.攻击速度 += 0.021
        elif 属性.悲剧的残骸 >= 2:
            属性.攻击速度 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +17%<br>'
        if 属性.悲剧的残骸 == 0:
            if 属性.装备检查('心痛如绞的诀别'):        
                temp += '附加伤害 +10.6%(期望)<br>'
            else:
                temp += '附加伤害 +10%(期望)<br>'
        elif 属性.悲剧的残骸 == 1:
            if 属性.装备检查('心痛如绞的诀别'):
                temp += '附加伤害 +10%<br>'
            else:
                temp += '附加伤害 +8%<br>'
        elif 属性.悲剧的残骸 == 2:
            temp += '附加伤害 +10%<br>'
        elif 属性.悲剧的残骸 == 3:
            temp += '附加伤害 +12%<br>'
        if 属性.悲剧的残骸 == 0:
            temp += '攻击速度 +2.1%(期望)<br>'
        elif 属性.悲剧的残骸 >= 2:
            temp += '攻击速度 +3%<br>'
        return temp      

class 装备165():
    名称 = '魔法师[???]的腰带'
    模式 = 0
    所属套装 = '遗忘魔法师的馈赠'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.05)
        属性.百分比三攻加成(0.1)
        属性.附加伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +5%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '附加伤害 +14%<br>'
        return temp    

class 装备166():
    名称 = '死亡阴影腰带'
    模式 = 0
    所属套装 = '死亡阴影'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.04)
        属性.暴击伤害加成(0.10)
        属性.附加伤害加成(0.18)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +4%<br>'
        temp += '暴击伤害 +10%<br>'
        temp += '附加伤害 +18%<br>'
        return temp   

class 装备167():
    名称 = '守护战士之苦难'
    模式 = 0
    所属套装 = '贫瘠沙漠的遗产'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.16)
        属性.伤害增加加成(属性.技能栏空位 / 100)
        属性.附加伤害加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +16%<br>'
        temp += '伤害增加 +' + str(属性.技能栏空位) + '%<br>'
        temp += '附加伤害 +10%<br>'
        return temp      

class 装备168():
    名称 = '亚巴顿：绝望地狱'
    模式 = 0
    所属套装 = '噩梦：地狱之路'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.16)
        属性.暴击伤害加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +16%<br>'
        temp += '暴击伤害 +16%<br>'
        return temp      

class 装备169():
    名称 = '奔流不息之狂风'
    模式 = 0
    所属套装 = '永恒不息之路'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.32)
        属性.技能倍率加成(30, -0.3)
        属性.技能恢复加成(30, 30, 1.0)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +32%<br>'
        temp += 'Lv30技能：<br>攻击力-30%  恢复+100%<br>'
        return temp     

class 装备170():
    名称 = '热情舞动桑巴'
    模式 = 0
    所属套装 = '天堂舞姬'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.17)
        属性.最终伤害加成(0.14)
        属性.技能冷却缩减(60, 70, 0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +17%<br>'
        temp += '最终伤害 +14%<br>'
        temp += 'Lv60-70 技能CD-15%<br>'
        return temp    

class 装备171():
    名称 = '首席执行官裁决腰带'
    模式 = 0
    所属套装 = '皇家裁决者宣言'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.18)
        属性.暴击伤害加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +18%<br>'
        temp += '暴击伤害 +15%<br>'
        return temp      

class 装备172():
    名称 = '炙炎：山竹'
    模式 = 0
    所属套装 = '炙炎之盛宴'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(60)
        属性.百分比三攻加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '所有属性强化 +60<br>'
        temp += '百分比三攻 +16%<br>'
        temp += '释放速度 +15%<br>'
        return temp     

class 装备173():
    名称 = '碎钢之牙'
    模式 = 0
    所属套装 = '传奇铁匠-封神'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +34%<br>'
        temp += '攻击速度 +10%<br>'
        return temp      

class 装备174():
    名称 = '正义的抉择'
    模式 = 0
    所属套装 = '命运歧路'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.2)
        属性.技能倍率加成(50, 0.25)
        属性.技能倍率加成(85, 0.45)
        属性.技能冷却缩减(85, 85, 0.20)
        属性.技能倍率加成(100, 0.13)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +20%<br>'
        temp += 'Lv50 技能攻击力+25%<br>'
        temp += 'Lv85 技能：<br>攻击力+45% 冷却-20%<br>'
        temp += 'Lv100 (主动)技能攻击力+13%<br>'
        return temp    

class 装备175():
    名称 = '大祭司的星祈腰带'
    模式 = 0
    所属套装 = '古代祭祀的神圣仪式'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.1)
        属性.百分比三攻加成(0.1)
        属性.暴击伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('大祭司的神启礼服'):
            属性.攻击速度 += 0.18
        else:
            属性.攻击速度 += 0.12
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +10%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '暴击伤害 +12%<br>'
        temp += '攻击速度 +18%<br>'
        temp += '攻击速度 +12%<br>'
        return temp      

class 装备176():
    名称 = '浴血奋战腰带'
    模式 = 0
    所属套装 = '龙血玄黄'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.技能等级加成('所有', 1, 85, 1)
        属性.技能等级加成('所有', 100, 100, 1)
        pass
    def 进图属性(self, 属性):
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            属性.所有属性强化加成(72)
        else:
            属性.所有属性强化加成(68)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += 'Lv1-85 技能等级+1<br>'
        temp += 'Lv100  技能等级+1<br>'
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            temp += '所有属性强化 +72<br>'
        else:    
            temp += '所有属性强化 +68<br>'
        return temp     

class 装备177():
    名称 = '风起云涌腰带'
    模式 = 0
    所属套装 = '擎天战甲'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.34)
        属性.技能等级加成('所有', 40, 40, 2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +34%<br>'
        temp += 'Lv40 技能等级+2<br>'
        return temp      

class 装备178():
    名称 = '千链锁灵腰带'
    模式 = 0
    所属套装 = '荆棘漫天'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.释放速度 += -0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +35%<br>'
        temp += '释放速度 -15%<br>'
        return temp     

class 装备179():
    名称 = '宁静苍翠之水'
    模式 = 0
    所属套装 = '大自然的呼吸'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.32)
        pass
    def 进图属性(self, 属性):
        属性.冰属性强化加成(24)
        pass
    def 其它属性(self, 属性):
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +32%<br>'
        temp += '冰属性强化 +24<br>'
        temp += '释放速度 +15%<br>'
        return temp
#endregion

#region  100SS首饰
class 装备180():
    名称 = '莱多：变幻的规律'
    模式 = 0
    所属套装 = '上古尘封术士'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.12)
        属性.技能攻击力加成(0.2)
        属性.所有属性强化加成(25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '附加伤害 +12%<br>'
        temp += '技能攻击力 +20%<br>'
        temp += '所有属性强化 +25<br>'
        temp += '移动速度 +10%<br>'
        return temp   

class 装备181():
    名称 = '拥抱晨曦之温暖'
    模式 = 0
    所属套装 = '破晓曦光'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.06)
        属性.技能攻击力加成(0.04 + 0.01 * min(13, 属性.获取强化(self.部位)))
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 1, 48, 1)
        属性.技能恢复加成(15, 30, 0.30)  
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '最终伤害 +6%<br>'
        temp += '技能攻击力 +' + str(4 + min(13,属性.获取强化(self.部位))) + '%<br>'
        temp += '所有属性强化 +28<br>'
        temp += 'Lv1-48  技能等级+1<br>'
        temp += 'Lv15-30 技能恢复+30%<br>'
        return temp      

class 装备182():
    名称 = '白象之庇护'
    模式 = 0
    所属套装 = '幸运三角'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.07)
        属性.伤害增加加成(0.07)
        属性.暴击伤害加成(0.07)
        属性.附加伤害加成(0.07)
        属性.技能攻击力加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '百分比力智 +7%<br>'
        temp += '伤害增加 +7%<br>'
        temp += '暴击伤害 +7%<br>'
        temp += '附加伤害 +7%<br>'
        temp += '技能攻击力 +7%<br>'
        return temp   

class 装备183():
    名称 = '火魔之焰-沙罗曼达'
    模式 = 0
    所属套装 = '精灵使的权能'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(38)
        属性.附加伤害加成(0.3)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '所有属性强化 +38<br>'
        temp += '附加伤害 +30%<br>'
        return temp     

class 装备184():
    名称 = '执着的探求'
    模式 = 0
    所属套装 = '黑魔法探求者'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.28)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '最终伤害 +28%<br>'
        temp += '所有属性强化 +40<br>'
        return temp      

class 装备185():
    名称 = '时间指引之针'
    模式 = 0
    所属套装 = '时空旅行者'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.2)
        属性.技能攻击力加成(0.14)
        属性.技能冷却缩减(50, 50, 0.10)
        属性.技能冷却缩减(85, 85, 0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '百分比力智 +20%<br>'
        temp += '技能攻击力 +14%<br>'
        temp += 'Lv50 技能CD-10%<br>'
        temp += 'Lv85 技能CD-10%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        return temp     

class 装备186():
    名称 = '支配战场的呐喊'
    模式 = 0
    所属套装 = '穿透命运的呐喊'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.12)
        属性.最终伤害加成(0.23)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '伤害增加 +12%<br>'
        temp += '最终伤害 +23%<br>'
        return temp     

class 装备187():
    名称 = '狂乱之坚如磐石'
    模式 = 0
    所属套装 = '狂乱追随者'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.3)
        属性.技能攻击力加成(0.11)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '百分比力智 +30%<br>'
        temp += '技能攻击力 +11%<br>'
        return temp     

class 装备188():
    名称 = '莱多：秩序创造者'
    模式 = 0
    所属套装 = '上古尘封术士'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '百分比三攻：'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力：'
    属性2范围 = [6, 1, 1]
    属性2选择 = 0
    属性3描述 = '暴击伤害：'
    属性3范围 = [9, 1, 1]
    属性3选择 = 0
    属性4描述 = '百分比力智：'
    属性4范围 = [6, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.06 - self.属性4选择 / 100)
        属性.百分比三攻加成(0.03 - self.属性1选择 / 100)
        属性.暴击伤害加成(0.09 - self.属性3选择 / 100)
        属性.附加伤害加成(0.12)
        属性.技能攻击力加成(0.20)
        属性.技能攻击力加成(0.06  - self.属性2选择 / 100)
        属性.所有属性强化加成(25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.移动速度 += 0.1
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +149<br>'
        temp += '智力 +100<br>'
        temp += '附加伤害 +12%<br>'
        temp += '技能攻击力 +20%<br>'
        temp += '所有属性强化 +25<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '百分比三攻 +%d%%<br>' % (3 - self.属性1选择)
        temp += '技能攻击力 +%d%%<br>' % (6 - self.属性2选择)
        temp += '暴击伤害 +%d%%<br>' % (9 - self.属性3选择)
        temp += '百分比力智 +%d%%<br>' % (6 - self.属性4选择)
        return temp        

class 装备189():
    名称 = '融化黑暗之温暖'
    模式 = 0
    所属套装 = '破晓曦光'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '物理/魔法/独立 +'
    属性1范围 = [110, 30, 10]
    属性1选择 = 0
    属性2描述 = '暴击伤害：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '伤害增加：'
    属性3范围 = [11, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.物理攻击力 += 110 - self.属性1选择 * 10
        属性.魔法攻击力 += 110 - self.属性1选择 * 10
        属性.独立攻击力 += 110 - self.属性1选择 * 10
        属性.伤害增加加成(0.11 - self.属性3选择 / 100)
        属性.暴击伤害加成(0.1 - self.属性2选择 / 100)
        属性.最终伤害加成(0.06)
        属性.技能攻击力加成(0.04 + 0.01 * min(13, 属性.获取强化(self.部位)))
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 1, 48, 1)
        属性.技能恢复加成(15, 30, 0.30)
        pass
    def 其它属性(self, 属性):
        x = int(min(sum(属性.强化等级), 150) / 6)
        属性.物理暴击率 += 0.005 * x
        属性.魔法暴击率 += 0.005 * x
        属性.攻击速度 += 0.008 * x
        属性.移动速度 += 0.008 * x
        属性.释放速度 += 0.012 * x
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +149<br>'
        temp += '智力 +100<br>'
        temp += '最终伤害 +6%<br>'
        temp += '技能攻击力 +' + str(4 + min(13,属性.获取强化(self.部位))) + '%<br>'
        temp += '所有属性强化 +28<br>'
        temp += 'Lv1-48  技能等级+1<br>'
        temp += 'Lv15-30 技能恢复+30%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '物理/魔法/独立 +%d<br>' % (110 - 10 * self.属性1选择)
        temp += '暴击伤害 +%d%%<br>' % (10 - self.属性2选择)
        temp += '伤害增加 +%d%%<br>' % (11 - self.属性3选择)
        return temp           

class 装备190():
    名称 = '伽内什的永恒庇护'
    模式 = 0
    所属套装 = '幸运三角'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '暴击伤害：'
    属性1范围 = [4, 1, 1]
    属性1选择 = 0
    属性2描述 = '百分比力智：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '伤害增加：'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '百分比三攻：'
    属性4范围 = [8, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.17 - self.属性2选择 / 100)
        属性.百分比三攻加成(0.08 - self.属性4选择 / 100)
        属性.伤害增加加成(0.1 - self.属性3选择 / 100)
        属性.暴击伤害加成(0.11 - self.属性1选择 / 100)
        属性.附加伤害加成(0.07)
        属性.技能攻击力加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.07
        属性.移动速度 += 0.07
        属性.释放速度 += 0.07
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +149<br>'
        temp += '智力 +100<br>'
        temp += '伤害增加 +7%<br>'
        temp += '百分比力智 +7%<br>'
        temp += '暴击伤害 +7%<br>'
        temp += '附加伤害 +7%<br>'
        temp += '技能攻击力 +7%<br>'
        temp += '攻击速度 +7%<br>'
        temp += '移动速度 +7%<br>'
        temp += '释放速度 +7%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '暴击伤害 +%d%%<br>' % (4 - self.属性1选择)
        temp += '百分比力智 +%d%%<br>' % (10 - self.属性2选择)
        temp += '伤害增加 +%d%%<br>' % (3 - self.属性3选择)
        temp += '百分比三攻 +%d%%<br>' % (8 - self.属性4选择)
        return temp
   
class 装备191():
    名称 = '至高之炎-伊弗利特'
    模式 = 0
    所属套装 = '精灵使的权能'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '力量/智力 +'
    属性1范围 = [160, 40, 20]
    属性1选择 = 0
    属性2描述 = '最终伤害：'
    属性2范围 = [12, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比三攻：'
    属性3范围 = [12, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.力量 += 160 - self.属性1选择 * 20
        属性.智力 += 160 - self.属性1选择 * 20
        属性.百分比三攻加成(0.12 - self.属性3选择 / 100)
        属性.附加伤害加成(0.3)
        属性.最终伤害加成(0.12 - self.属性2选择 / 100)
        属性.所有属性强化加成(38)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +149<br>'
        temp += '智力 +100<br>'
        temp += '附加伤害 +30%<br>'
        temp += '所有属性强化 +38<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '力量/智力 +%d<br>' % (160 - 20 * self.属性1选择)
        temp += '最终伤害 +%d%%<br>' % (12 - self.属性2选择)
        temp += '百分比三攻 +%d%%<br>' % (12 - self.属性3选择)
        return temp      

class 装备192():
    名称 = '无尽的探求'
    模式 = 0
    所属套装 = '黑魔法探求者'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '力量/智力 +'
    属性1范围 = [240, 20, 20]
    属性1选择 = 0
    属性2描述 = '附加伤害：'
    属性2范围 = [7, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比三攻：'
    属性3范围 = [12, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.力量 += 240 - self.属性1选择 * 20
        属性.智力 += 240 - self.属性1选择 * 20
        属性.百分比三攻加成(0.12 - self.属性3选择 / 100)
        属性.附加伤害加成(0.07 - self.属性2选择 / 100)
        属性.最终伤害加成(0.28)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +149<br>'
        temp += '智力 +100<br>'
        temp += '最终伤害 +28%<br>'
        temp += '所有属性强化 +40<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '力量/智力 +%d<br>' % (240 - 20 * self.属性1选择)
        temp += '附加伤害 +%d%%<br>' % (7 - self.属性2选择)
        temp += '百分比三攻 +%d%%<br>' % (12 - self.属性3选择)
        return temp     

class 装备193():
    名称 = '时间回溯之针'
    模式 = 0
    所属套装 = '时空旅行者'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '百分比力智：'
    属性1范围 = [4, 1, 1]
    属性1选择 = 0
    属性2描述 = '所有属性强化 +'
    属性2范围 = [20, 12, 4]
    属性2选择 = 0
    属性3描述 = '物理/魔法/独立 +'
    属性3范围 = [100, 10, 10]
    属性3选择 = 0
    属性4描述 = '最终伤害：'
    属性4范围 = [8, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.物理攻击力 += 100 - self.属性3选择 * 10
        属性.魔法攻击力 += 100 - self.属性3选择 * 10
        属性.独立攻击力 += 100 - self.属性3选择 * 10
        属性.百分比力智加成(0.24 - self.属性1选择 / 100)
        属性.最终伤害加成(0.08 - self.属性4选择 / 100)
        属性.技能攻击力加成(0.14)
        属性.所有属性强化加成(20 - self.属性2选择 * 4)
        属性.技能冷却缩减(50, 50, 0.15)
        属性.技能冷却缩减(85, 85, 0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +149<br>'
        temp += '智力 +100<br>'
        temp += '技能攻击力 +14%<br>'
        temp += '百分比力智 +20%<br>'
        temp += 'Lv50 技能CD-15%<br>'
        temp += 'Lv85 技能CD-15%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '百分比力智 +%d%%<br>' % (4 - self.属性1选择)
        temp += '所有属性强化 +%d<br>' % (20 - 4 * self.属性2选择)
        temp += '物理/魔法/独立 +%d<br>' % (100 - 10 * self.属性3选择)
        temp += '最终伤害 +%d%%<br>' % (8 - self.属性4选择)
        return temp     

class 装备194():
    名称 = '响彻天地的咆哮'
    模式 = 0
    所属套装 = '穿透命运的呐喊'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '技能攻击力：'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '附加伤害：'
    属性2范围 = [4, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比力智：'
    属性3范围 = [7, 1, 1]
    属性3选择 = 0
    属性4描述 = '百分比三攻：'
    属性4范围 = [12, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.07 - self.属性3选择 / 100)
        属性.百分比三攻加成(0.12 - self.属性4选择 / 100)
        属性.伤害增加加成(0.12)
        属性.附加伤害加成(0.04 - self.属性2选择 / 100)
        属性.最终伤害加成(0.23)
        属性.技能攻击力加成(0.03 - self.属性1选择 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.08
        属性.移动速度 += 0.08
        属性.释放速度 += 0.12
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +149<br>'
        temp += '智力 +100<br>'
        temp += '伤害增加 +12%<br>'
        temp += '最终伤害 +23%<br>'
        temp += '攻击速度 +8%<br>'
        temp += '移动速度 +8%<br>'
        temp += '释放速度 +12%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '技能攻击力 +%d%%<br>' % (3 - self.属性1选择)
        temp += '附加伤害 +%d%%<br>' % (4 - self.属性2选择)
        temp += '百分比力智 +%d%%<br>' % (7 - self.属性3选择)
        temp += '百分比三攻 +%d%%<br>' % (12 - self.属性4选择)
        return temp     

class 装备195():
    名称 = '狂乱之逆转宿命'
    模式 = 0
    所属套装 = '狂乱追随者'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '伤害增加：'
    属性1范围 = [10, 1, 1]
    属性1选择 = 0
    属性2描述 = '所有属性强化 +'
    属性2范围 = [32, 4, 4]
    属性2选择 = 0
    属性3描述 = '暴击伤害：'
    属性3范围 = [12, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.3)
        属性.伤害增加加成(0.1 - self.属性1选择 / 100)
        属性.暴击伤害加成(0.12 - self.属性3选择 / 100)
        属性.技能攻击力加成(0.11)
        属性.所有属性强化加成(32 - self.属性2选择 * 4)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +149<br>'
        temp += '智力 +100<br>'
        temp += '百分比力智 +30%<br>'
        temp += '技能攻击力 +11%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '伤害增加 +%d%%<br>' % (10 - self.属性1选择)
        temp += '所有属性强化 +%d<br>' % (32 - 4 * self.属性2选择)
        temp += '暴击伤害 +%d%%<br>' % (12 - self.属性3选择)
        return temp      

class 装备196():
    名称 = '肯那兹：精神燎原之火'
    模式 = 0
    所属套装 = '上古尘封术士'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.2)
        属性.附加伤害加成(0.12)
        属性.所有属性强化加成(25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '百分比三攻 +20%<br>'
        temp += '附加伤害 +12%<br>'
        temp += '所有属性强化 +25<br>'
        return temp    

class 装备197():
    名称 = '驱散月光之黎明'
    模式 = 0
    所属套装 = '破晓曦光'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.04  + 0.01 * min(13, 属性.获取强化(self.部位)))
        属性.百分比三攻加成(0.06)
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 50, 70, 1)
        属性.技能恢复加成(35, 45, 0.30)   
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '百分比三攻 +6%<br>'
        temp += '百分比力智 +' + str(4 + min(13,属性.获取强化(self.部位))) + '%<br>'
        temp += '所有属性强化 +28<br>'
        temp += 'Lv50-70 技能等级+1<br>'
        temp += 'Lv35-45 技能恢复+30%<br>'
        return temp     

class 装备198():
    名称 = '四叶草之初心'
    模式 = 0
    所属套装 = '幸运三角'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.07)
        属性.百分比三攻加成(0.07)
        属性.伤害增加加成(0.07)
        属性.暴击伤害加成(0.07)
        属性.最终伤害加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '百分比力智 +7%<br>'
        temp += '百分比三攻 +7%<br>'
        temp += '伤害增加 +7%<br>'
        temp += '暴击伤害 +7%<br>'
        temp += '最终伤害 +7%<br>'
        return temp      

class 装备199():
    名称 = '冷焰之冰-温蒂妮'
    模式 = 0
    所属套装 = '精灵使的权能'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(38)
        属性.百分比三攻加成(0.27)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '所有属性强化 +38<br>'
        temp += '百分比三攻 +27%<br>'
        return temp      

class 装备200():
    名称 = '堕落世界树之生命'
    模式 = 0
    所属套装 = '深渊窥视者'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.4)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '百分比力智 +40%<br>'
        return temp    

class 装备201():
    名称 = '引路者的四季项链'
    模式 = 0
    所属套装 = '圣者的黄昏'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.35)
        属性.技能冷却缩减(1, 45, 0.10)
        属性.技能冷却缩减(60, 80, 0.10)
        属性.技能冷却缩减(90, 95, 0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '附加伤害 +35%<br>'
        temp += 'Lv1-45  技能CD-10%<br>'
        temp += 'Lv60-80 技能CD-10%<br>'
        temp += 'Lv90-95 技能CD-10%<br>'
        temp += '移动速度 +10%<br>'
        return temp        

class 装备202():
    名称 = '悲痛者项链'
    模式 = 0
    所属套装 = '坎坷命运'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.1)
        属性.最终伤害加成(0.28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.04
        属性.移动速度 += 0.04
        属性.释放速度 += 0.06
        if 属性.装备检查('地狱边缘'):
            属性.攻击速度 -= 0.01
            属性.移动速度 -= 0.01
            属性.释放速度 -= 0.015
        if 属性.装备检查('悲情者遗物'):
            属性.攻击速度 -= 0.01
            属性.移动速度 -= 0.01
            属性.释放速度 -= 0.015
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '最终伤害 +28%<br>'
        temp += '攻击速度 +4%<br>'
        temp += '移动速度 +4%<br>'
        temp += '释放速度 +6%<br>'
        if 属性.装备检查('地狱边缘'):
            temp += '攻击速度 -1%<br>'
            temp += '移动速度 -1%<br>'
            temp += '释放速度 -1.5%<br>'
        if 属性.装备检查('悲情者遗物'):
            temp += '攻击速度 -1%<br>'
            temp += '移动速度 -1%<br>'
            temp += '释放速度 -1.5%<br>'
        return temp        

class 装备203():
    名称 = '激狂之怒'
    模式 = 0
    所属套装 = '吞噬愤怒'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.3)
        属性.持续伤害 += 0.1
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '百分比三攻 +30%<br>'
        temp += '持续伤害 +10%<br>'
        return temp        

class 装备204():
    名称 = '盖柏：完美的均衡'
    模式 = 0
    所属套装 = '上古尘封术士'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.2)
        属性.附加伤害加成(0.12)
        属性.所有属性强化加成(25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '百分比力智 +20%<br>'
        temp += '附加伤害 +12%<br>'
        temp += '所有属性强化 +25<br>'
        temp += '攻击速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        return temp        

class 装备205():
    名称 = '寂静无言之露珠'
    模式 = 0
    所属套装 = '破晓曦光'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.04  + 0.01 * min(13, 属性.获取强化(self.部位)))
        属性.所有属性强化加成(30)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 75, 85, 1)
        属性.技能恢复加成(60, 80, 0.30) 
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '技能伤害 +' +str(4 + min(13,属性.获取强化(self.部位))) +'<br>'
        temp += '所有属性强化 +30<br>'
        temp += 'Lv75-85 技能等级+1<br>'
        temp += 'Lv60-80 技能恢复+30%<br>'
        return temp        

class 装备206():
    名称 = '红兔之祝福'
    模式 = 0
    所属套装 = '幸运三角'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.07)
        属性.百分比三攻加成(0.07)
        属性.伤害增加加成(0.07)
        属性.暴击伤害加成(0.07)
        属性.最终伤害加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '百分比力智 +7%<br>'
        temp += '百分比三攻 +7%<br>'
        temp += '伤害增加 +7%<br>'
        temp += '暴击伤害 +7%<br>'
        temp += '最终伤害 +7%<br>'
        return temp        

class 装备207():
    名称 = '祝福之风-西尔芙'
    模式 = 0
    所属套装 = '精灵使的权能'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.27)
        属性.所有属性强化加成(38)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.04
        属性.移动速度 += 0.04
        属性.释放速度 += 0.06
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '最终伤害 +27%<br>'
        temp += '所有属性强化 +38<br>'
        temp += '攻击速度 +4%<br>'
        temp += '移动速度 +4%<br>'
        temp += '释放速度 +6%<br>'
        return temp        

class 装备208():
    名称 = '支配黑暗之环'
    模式 = 0
    所属套装 = '地狱求道者'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.4)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '暴击伤害 +40%<br>'
        return temp        

class 装备209():
    名称 = '次元穿越者之印'
    模式 = 0
    所属套装 = '次元旅行者'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.14)
        属性.技能攻击力加成(0.18)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 60, 80, 1)
        pass
    def 其它属性(self, 属性):
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '百分比力智 +14%<br>'
        temp += '技能攻击力 +18%<br>'
        temp += 'Lv60-80 技能等级+1<br>'
        temp += '释放速度 +15%<br>'
        return temp        

class 装备210():
    名称 = '命运的捉弄'
    模式 = 0
    所属套装 = '天命无常'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        if '天命无常[2]' in 属性.套装栏:
            if 属性.天命无常 == 0:
                if 属性.装备检查('命运反抗者'):
                    属性.伤害增加加成(0.12)
                else :
                    属性.伤害增加加成(0.10)
            else:
                if 属性.天命无常 >= 2:
                    属性.伤害增加加成(0.12)
        属性.最终伤害加成(0.06)
        属性.技能攻击力加成(0.19)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '最终伤害 +6%<br>'
        temp += '技能攻击力 +19%<br>'
        if '天命无常[2]' in 属性.套装栏:
            if 属性.天命无常 == 0:
                if 属性.装备检查('命运反抗者'):
                    temp += '伤害增加 +12%<br>'
                else :
                    temp += '伤害增加 +10%<br>'
            else:
                if 属性.天命无常 >= 2:
                    temp += '伤害增加 +12%<br>'
        return temp        

class 装备211():
    名称 = '蓬勃生命的落幕'
    模式 = 0
    所属套装 = '悲剧的残骸'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.27)
        if 属性.悲剧的残骸 == 0:
            if 属性.装备检查('心痛如绞的诀别'):
                属性.附加伤害加成(0.106)
            else:
                属性.附加伤害加成(0.10)
        if 属性.悲剧的残骸 == 1:
            if 属性.装备检查('心痛如绞的诀别'):
                属性.附加伤害加成(0.10)
            else:
                属性.附加伤害加成(0.08)
        if 属性.悲剧的残骸 == 2:
            属性.附加伤害加成(0.10)
        if 属性.悲剧的残骸 == 3:
            属性.附加伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.悲剧的残骸 == 0:
            属性.攻击速度 += 0.021
        if 属性.悲剧的残骸 >= 2:
            属性.攻击速度 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '暴击伤害 +27%<br>'
        if 属性.悲剧的残骸 == 0:
            if 属性.装备检查('心痛如绞的诀别'):
                temp += '附加伤害 +10.6%<br>'
            else:
                temp += '附加伤害 +10%<br>'
            temp += '攻击速度 +2.1%<br>'
        if 属性.悲剧的残骸 == 1:
            if 属性.装备检查('心痛如绞的诀别'):
                temp += '附加伤害 +10%<br>'
            else:
                temp += '附加伤害 +8%<br>'
        if 属性.悲剧的残骸 == 2:
            temp += '附加伤害 +10%<br>'
            temp += '攻击速度 +3%<br>'
        if 属性.悲剧的残骸 == 3:
            temp += '附加伤害 +12%<br>'
            temp += '攻击速度 +3%<br>'
        return temp
#endregion

#region  100SS特殊
class 装备212():
    名称 = '军神的遗书'
    模式 = 0
    所属套装 = '军神的隐秘遗产'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.25)
        属性.附加伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '伤害增加 +25%<br>'
        temp += '附加伤害 +14%<br>'
        temp += '移动速度 +5%<br>'
        return temp        

class 装备213():
    名称 = '末日之刻'
    模式 = 0
    所属套装 = '时间战争的残骸'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.15)
        属性.技能攻击力加成(0.12)
        for i in range(6):
            属性.技能冷却缩减(1, 100, 0.02)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '百分比力智 +15%<br>'
        temp += '技能攻击力 +12%<br>'
        temp += 'Lv1-100 技能CD-2% * 6<br>'
        return temp          

class 装备214():
    名称 = '高贵之天'
    模式 = 0
    所属套装 = '灵宝：世间真理'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.12)
        属性.技能攻击力加成(0.12)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '最终伤害 +12%<br>'
        temp += '技能攻击力 +12%<br>'
        temp += '所有属性强化 +40<br>'
        temp += '移动速度 +10%<br>'
        return temp        

class 装备215():
    名称 = '能量回流控制者'
    模式 = 0
    所属套装 = '能量主宰'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.16)
        属性.伤害增加加成(0.2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '百分比力智 +16%<br>'
        temp += '伤害增加 +20%<br>'
        temp += '攻击速度 +10%<br>'
        return temp        

class 装备216():
    名称 = '暗黑术士亲笔古书'
    模式 = 0
    所属套装 = '深渊窥视者'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.42)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '百分比三攻 +42%<br>'
        return temp        

class 装备217():
    名称 = '引路者的旅行书'
    模式 = 0
    所属套装 = '圣者的黄昏'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.22)
        属性.所有属性强化加成(64)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '暴击伤害 +22%<br>'
        temp += '所有属性强化 +64<br>'
        temp += '攻击速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        return temp        

class 装备218():
    名称 = '悲情者遗物'
    模式 = 0
    所属套装 = '坎坷命运'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.16)
        属性.百分比三攻加成(0.1)
        属性.伤害增加加成(0.11)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.04
        属性.移动速度 += 0.04
        属性.释放速度 += 0.06
        if 属性.装备检查('地狱边缘'):
            属性.攻击速度 -= 0.01
            属性.移动速度 -= 0.01
            属性.释放速度 -= 0.015
        if 属性.装备检查('悲痛者项链'):
            属性.攻击速度 -= 0.01
            属性.移动速度 -= 0.01
            属性.释放速度 -= 0.015
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '百分比力智 +16%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '伤害增加 +11%<br>'
        temp += '攻击速度 +4%<br>'
        temp += '移动速度 +4%<br>'
        temp += '释放速度 +6%<br>'
        if 属性.装备检查('地狱边缘'):
            temp += '攻击速度 -1%<br>'
            temp += '移动速度 -1%<br>'
            temp += '释放速度 -1.5%<br>'
        if 属性.装备检查('悲痛者项链'):
            temp += '攻击速度 -1%<br>'
            temp += '移动速度 -1%<br>'
            temp += '释放速度 -1.5%<br>'
        return temp        

class 装备219():
    名称 = '失控之怒'
    模式 = 0
    所属套装 = '吞噬愤怒'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.持续伤害 += 0.1
        属性.最终伤害加成(0.3)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '持续伤害 +10%<br>'
        temp += '最终伤害 +30%<br>'
        return temp        

class 装备220():
    名称 = '军神的庇护宝石'
    模式 = 0
    所属套装 = '军神的隐秘遗产'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.21)
        属性.技能攻击力加成(0.17)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '暴击伤害 +21%<br>'
        temp += '技能攻击力 +17%<br>'
        return temp        

class 装备221():
    名称 = '时之漩涡'
    模式 = 0
    所属套装 = '时间战争的残骸'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.24)
        属性.最终伤害加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '百分比三攻 +24%<br>'
        temp += '最终伤害 +15%<br>'
        return temp        

class 装备222():
    名称 = '智慧之地'
    模式 = 0
    所属套装 = '灵宝：世间真理'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.12)
        属性.最终伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '百分比力智 +12%<br>'
        temp += '最终伤害 +12%<br>'
        temp += '所有属性强化 +40<br>'
        temp += '攻击速度 +10%<br>'
        return temp        

class 装备223():
    名称 = '电光能量支配者'
    模式 = 0
    所属套装 = '能量主宰'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.13)
        属性.技能攻击力加成(0.24)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '最终伤害 +13%<br>'
        temp += '技能攻击力 +24%<br>'
        temp += '释放速度 +15%<br>'
        return temp        

class 装备224():
    名称 = '暗黑术士的精髓'
    模式 = 0
    所属套装 = '黑魔法探求者'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.35)
        属性.技能攻击力加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '暴击伤害 +35%<br>'
        temp += '技能攻击力 +7%<br>'
        return temp        

class 装备225():
    名称 = '被困的时之沙'
    模式 = 0
    所属套装 = '时空旅行者'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.17)
        属性.所有属性强化加成(80)
        属性.技能冷却缩减(1, 45, 0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '百分比力智 +17%<br>'
        temp += '所有属性强化 +80<br>'
        temp += 'Lv1-45 技能CD-10%<br>'
        return temp        

class 装备226():
    名称 = '寂寞的呼喊'
    模式 = 0
    所属套装 = '穿透命运的呐喊'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.23)
        属性.技能攻击力加成(0.13)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '暴击伤害 +23%<br>'
        temp += '技能攻击力 +13%<br>'
        return temp        

class 装备227():
    名称 = '狂乱之天灾降临'
    模式 = 0
    所属套装 = '狂乱追随者'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.2)
        属性.伤害增加加成(0.2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '百分比三攻 +20%<br>'
        temp += '伤害增加 +20%<br>'
        return temp        

class 装备228():
    名称 = '军神的古怪耳环'
    模式 = 0
    所属套装 = '军神的隐秘遗产'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        if 属性.装备检查('军神的遗书'):
            属性.百分比力智加成(0.10)
        属性.百分比三攻加成(0.15)
        属性.最终伤害加成(0.17)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('军神的遗书'):
            属性.移动速度 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '百分比三攻 +15%<br>'
        temp += '最终伤害 +17%<br>'
        if 属性.装备检查('军神的遗书'):
            temp += '百分比力智 +10%<br>'
            temp += '移动速度 +10%<br>'
        return temp        

class 装备229():
    名称 = '时之矛盾'
    模式 = 0
    所属套装 = '时间战争的残骸'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.15)
        属性.暴击伤害加成(0.24)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '伤害增加 +15%<br>'
        temp += '暴击伤害 +24%<br>'
        return temp

class 装备230():
    名称 = '宽容之海'
    模式 = 0
    所属套装 = '灵宝：世间真理'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.16)
        属性.附加伤害加成(0.1)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.移动速度 += 0.05
        属性.释放速度 += 0.225
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '伤害增加 +16%<br>'
        temp += '附加伤害 +10%<br>'
        temp += '所有属性强化 +40<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +5%<br>'
        temp += '释放速度 +22.5%<br>'
        return temp        

class 装备231():
    名称 = '电磁能量传送者'
    模式 = 0
    所属套装 = '能量主宰'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        if 属性.装备检查('能量回流控制者'):
            属性.附加伤害加成(0.1)
        属性.百分比力智加成(0.1)
        属性.百分比三攻加成(0.12)
        pass
    def 进图属性(self, 属性):
        if 属性.装备检查('电光能量支配者'):
            属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '百分比力智 +10%<br>'
        temp += '百分比三攻 +12%<br>'
        if 属性.装备检查('能量回流控制者'):
            temp += '附加伤害 +10%<br>'
        if 属性.装备检查('电光能量支配者'):
            temp += '所有属性强化 +40<br>'
        return temp        

class 装备232():
    名称 = '无尽地狱黑暗之印'
    模式 = 0
    所属套装 = '地狱求道者'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.42)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '最终伤害 +42%<br>'
        return temp        

class 装备233():
    名称 = '次元流星坠'
    模式 = 0
    所属套装 = '次元旅行者'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.1)
        属性.最终伤害加成(0.19)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 50, 50, 1)
        属性.技能等级加成('所有', 85, 85, 1)
        属性.技能等级加成('所有', 100, 100, 1)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '暴击伤害 +10%<br>'
        temp += '最终伤害 +19%<br>'
        temp += 'Lv50  技能等级+1<br>'
        temp += 'Lv85  技能等级+1<br>'
        temp += 'Lv100 技能等级+1<br>'
        temp += '攻击速度 +10%<br>'
        return temp        

class 装备234():
    名称 = '命运挑战者'
    模式 = 0
    所属套装 = '天命无常'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.1)
        属性.暴击伤害加成(0.22)
        if '天命无常[2]' in 属性.套装栏:
            if 属性.天命无常 == 0:
                属性.最终伤害加成(0.05)
            if 属性.天命无常 == 6:
                属性.最终伤害加成(0.30)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '百分比力智 +10%<br>'
        temp += '暴击伤害 +22%<br>'
        if '天命无常[2]' in 属性.套装栏:
            if 属性.天命无常 == 0:
                temp += '最终伤害 +5%<br>'
            if 属性.天命无常 == 6:
                temp += '最终伤害 +30%<br>'
        return temp        

class 装备235():
    名称 = '悲剧人生的归寂'
    模式 = 0
    所属套装 = '悲剧的残骸'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.15)
        属性.暴击伤害加成(0.1)
        if 属性.悲剧的残骸 == 0:
            属性.附加伤害加成(0.10)
        if 属性.悲剧的残骸 == 1:
            属性.附加伤害加成(0.08)
        if 属性.悲剧的残骸 == 2:
            属性.附加伤害加成(0.10)
        if 属性.悲剧的残骸 == 3:
            属性.附加伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.悲剧的残骸 == 0:
            属性.攻击速度 += 0.021
        if 属性.悲剧的残骸 >= 2:
            属性.攻击速度 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '伤害增加 +15%<br>'
        temp += '暴击伤害 +10%<br>'
        if 属性.悲剧的残骸 == 0:
            temp += '附加伤害 +10%<br>'
            temp += '攻击速度 +2.1%<br>'
        if 属性.悲剧的残骸 == 1:
            temp += '附加伤害 +8%<br>'
        if 属性.悲剧的残骸 == 2:
            temp += '附加伤害 +10%<br>'
            temp += '攻击速度 +3%<br>'
        if 属性.悲剧的残骸 == 3:
            temp += '附加伤害 +12%<br>'
            temp += '攻击速度 +3%<br>'
        return temp        

class 装备236():
    名称 = '军神的心之所念'
    模式 = 0
    所属套装 = '军神的隐秘遗产'
    等级 = 100
    品质 = '神话'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '附加伤害：'
    属性1范围 = [4, 1, 1]
    属性1选择 = 0
    属性2描述 = '百分比三攻：'
    属性2范围 = [9, 1, 1]
    属性2选择 = 0
    属性3描述 = '技能攻击力：'
    属性3范围 = [4, 1, 1]
    属性3选择 = 0
    属性4描述 = '最终伤害：'
    属性4范围 = [7, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.24 - self.属性2选择 / 100)
        属性.附加伤害加成(0.04 - self.属性1选择 / 100)
        属性.最终伤害加成(0.24 - self.属性4选择 / 100)
        属性.技能攻击力加成(0.10)
        属性.技能攻击力加成(0.04 - self.属性3选择 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '技能攻击力 +10%<br>'
        temp += '百分比三攻 +15%<br>'
        temp += '最终伤害 +17%<br>'
        temp += '移动速度 +15%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '附加伤害 +%d%%<br>' % (4 -self.属性1选择)
        temp += '百分比三攻 +%d%%<br>' % (9 -self.属性2选择)
        temp += '技能攻击力 +%d%%<br>' % (4 -self.属性3选择)
        temp += '最终伤害 +%d%%<br>' % (7 -self.属性4选择)
        return temp        

class 装备237():
    名称 = '时之魅影'
    模式 = 0
    所属套装 = '时间战争的残骸'
    等级 = 100
    品质 = '神话'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '百分比三攻：'
    属性1范围 = [6, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力：'
    属性2范围 = [4, 1, 1]
    属性2选择 = 0
    属性3描述 = '附加伤害：'
    属性3范围 = [8, 1, 1]
    属性3选择 = 0
    属性4描述 = '百分比力智：'
    属性4范围 = [5, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.05 - self.属性4选择 / 100)
        属性.百分比三攻加成(0.06 - self.属性1选择 / 100)
        属性.伤害增加加成(0.15)
        属性.暴击伤害加成(0.24)
        属性.附加伤害加成(0.08 - self.属性3选择 / 100)
        属性.技能攻击力加成(0.04 - self.属性2选择 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '伤害增加 +15%<br>'
        temp += '暴击伤害 +24%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '百分比三攻 +%d%%<br>' % (6 -self.属性1选择)
        temp += '技能攻击力 +%d%%<br>' % (4 -self.属性2选择)
        temp += '附加伤害 +%d%%<br>' % (8 -self.属性3选择)
        temp += '百分比力智 +%d%%<br>' % (5 -self.属性4选择)
        return temp        

class 装备238():
    名称 = '永恒之海'
    模式 = 0
    所属套装 = '灵宝：世间真理'
    等级 = 100
    品质 = '神话'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '所有属性强化 +'
    属性1范围 = [40, 20, 4]
    属性1选择 = 0
    属性2描述 = '最终伤害：'
    属性2范围 = [8, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比力智：'
    属性3范围 = [5, 1, 1]
    属性3选择 = 0
    属性4描述 = '伤害增加：'
    属性4范围 = [4, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.05 - self.属性3选择 / 100)
        属性.伤害增加加成(0.2 - self.属性4选择 / 100)
        属性.附加伤害加成(0.1)
        属性.最终伤害加成(0.08 - self.属性2选择 / 100)
        属性.所有属性强化加成(40 - self.属性1选择 * 4)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        属性.释放速度 += 0.375
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '附加伤害 +10%<br>'
        temp += '伤害增加 +16%<br>'
        temp += '所有属性强化 +40<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        temp += '释放速度 +37.5%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '所有属性强化 +%d<br>' % (40 -4*self.属性1选择)
        temp += '最终伤害 +%d%%<br>' % (8 -self.属性2选择)
        temp += '百分比力智 +%d%%<br>' % (5 -self.属性3选择)
        temp += '伤害增加 +%d%%<br>' % (4 -self.属性4选择)
        return temp        

class 装备239():
    名称 = '等离子操控者'
    模式 = 0
    所属套装 = '能量主宰'
    等级 = 100
    品质 = '神话'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '伤害增加：'
    属性1范围 = [12, 1, 1]
    属性1选择 = 0
    属性2描述 = '力量/智力 +'
    属性2范围 = [220, 100, 20]
    属性2选择 = 0
    属性3描述 = '附加伤害：'
    属性3范围 = [12, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.力量 += 220 - self.属性2选择 * 20
        属性.智力 += 220 - self.属性2选择 * 20
        属性.百分比力智加成(0.1)
        属性.百分比三攻加成(0.12)
        if 属性.装备检查('能量回流控制者'):
            属性.附加伤害加成(0.1)
        属性.伤害增加加成(0.12 - self.属性1选择 / 100)
        属性.附加伤害加成(0.12 - self.属性3选择 / 100)
        pass
    def 进图属性(self, 属性):
        if 属性.装备检查('电光能量支配者'):
            属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('能量回流控制者'):
            属性.移动速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '百分比力智 +10%<br>'
        temp += '百分比三攻 +12%<br>'
        if 属性.装备检查('能量回流控制者'):
            temp += '附加伤害 +10%<br>'
            temp += '移动速度 +10%<br>'
        if 属性.装备检查('电光能量支配者'):
            temp += '所有属性强化 +40<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '伤害增加 +%d%%<br>' % (12 -self.属性1选择)
        temp += '力量/智力 +%d<br>' % (220 -20*self.属性2选择)
        temp += '附加伤害 +%d%%<br>' % (12 -self.属性3选择)
        return temp        

class 装备240():
    名称 = '永恒地狱黑暗之印'
    模式 = 0
    所属套装 = '地狱求道者'
    等级 = 100
    品质 = '神话'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '最终伤害：'
    属性1范围 = [12, 1, 1]
    属性1选择 = 0
    属性2描述 = '所有属性强化 +'
    属性2范围 = [40, 8, 4]
    属性2选择 = 0
    属性3描述 = '附加伤害：'
    属性3范围 = [9, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.09  - self.属性3选择 / 100)
        属性.最终伤害加成(0.12 - self.属性1选择 / 100)
        属性.所有属性强化加成(40 - self.属性2选择 * 4)
        属性.最终伤害加成(0.42)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '最终伤害 +42%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '最终伤害 +%d%%<br>' % (12 -self.属性1选择)
        temp += '所有属性强化 +%d<br>' % (40 -4*self.属性2选择)
        temp += '附加伤害 +%d%%<br>' % (9 -self.属性3选择)
        return temp        

class 装备241():
    名称 = '次元穿越者之星'
    模式 = 0
    所属套装 = '次元旅行者'
    等级 = 100
    品质 = '神话'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '力量/智力 +'
    属性1范围 = [300, 20, 20]
    属性1选择 = 0
    属性2描述 = '暴击伤害：'
    属性2范围 = [11, 1, 1]
    属性2选择 = 0
    属性3描述 = '技能等级Lv60 -'
    属性3范围 = [100, 70, 5]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.力量 += 300 - self.属性1选择 * 20
        属性.智力 += 300 - self.属性1选择 * 20
        属性.暴击伤害加成(0.21 - self.属性2选择 / 100)
        属性.最终伤害加成(0.19)
        属性.技能等级加成('所有', 60, 100 - self.属性3选择 * 5, 1)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 50, 50, 1)
        属性.技能等级加成('所有', 85, 85, 1)
        属性.技能等级加成('所有', 100, 100, 1)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '最终伤害 +19%<br>'
        temp += '暴击伤害 +10%<br>'
        temp += 'Lv50  技能等级+1<br>'
        temp += 'Lv85  技能等级+1<br>'
        temp += 'Lv100 技能等级+1<br>'
        temp += '攻击速度 +15%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '力量/智力 +%d<br>' % (300 -20*self.属性1选择)
        temp += '暴击伤害 +%d%%<br>' % (11 -self.属性2选择)
        temp += 'Lv60-%d 技能等级+1<br>' % (100 -5*self.属性3选择)
        return temp        

class 装备242():
    名称 = '命运反抗者'
    模式 = 0
    所属套装 = '天命无常'
    等级 = 100
    品质 = '神话'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '物攻/魔攻/独立 +'
    属性1范围 = [120, 40, 10]
    属性1选择 = 0
    属性2描述 = '技能等级Lv25 -'
    属性2范围 = [45, 30, 5]
    属性2选择 = 0
    属性3描述 = '百分比力智：'
    属性3范围 = [4, 1, 1]
    属性3选择 = 0
    属性4描述 = '附加伤害：'
    属性4范围 = [7, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.物理攻击力 += 120 - self.属性1选择 * 10
        属性.魔法攻击力 += 120 - self.属性1选择 * 10
        属性.独立攻击力 += 120 - self.属性1选择 * 10
        属性.百分比力智加成(0.14 - self.属性3选择 / 100)
        属性.暴击伤害加成(0.22)
        属性.附加伤害加成(0.07 - self.属性4选择 / 100)
        if '天命无常[2]' in 属性.套装栏:
            if 属性.天命无常 == 0:
                属性.最终伤害加成(0.06)
            if 属性.天命无常 == 6:
                属性.最终伤害加成(0.30)
        属性.技能等级加成('所有', 25, 45 - self.属性2选择 * 5, 1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '暴击伤害 +22%<br>'
        temp += '百分比力智 +10%<br>'
        if '天命无常[2]' in 属性.套装栏:
            if 属性.天命无常 == 0:
                temp += '最终伤害 +6%<br>'
            if 属性.天命无常 == 6:
                temp += '最终伤害 +30%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '物攻/魔攻/独立 +%d<br>' % (120 - self.属性1选择 * 10)
        temp += 'Lv25-%d 技能等级+1<br>' % (45 -5*self.属性2选择)
        temp += '百分比力智 +%d%%<br>' % (4 -self.属性3选择)
        temp += '附加伤害 +%d%%<br>' % (7 -self.属性4选择)        
        return temp        

class 装备243():
    名称 = '心痛如绞的诀别'
    模式 = 0
    所属套装 = '悲剧的残骸'
    等级 = 100
    品质 = '神话'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '所有属性强化 +'
    属性1范围 = [16, 8, 4]
    属性1选择 = 0
    属性2描述 = '持续伤害：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '暴击伤害：'
    属性3范围 = [8, 1, 1]
    属性3选择 = 0
    属性4描述 = '力量/智力 +'
    属性4范围 = [140, 80, 20]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.力量 += 140 - self.属性4选择 * 20
        属性.智力 += 140 - self.属性4选择 * 20
        属性.伤害增加加成(0.15)
        属性.暴击伤害加成(0.18 - self.属性3选择 / 100)
        属性.持续伤害 += 0.1 - self.属性2选择 / 100
        属性.所有属性强化加成(16 - self.属性1选择 * 4)
        if 属性.悲剧的残骸 == 0:
            属性.附加伤害加成(0.106)
        if 属性.悲剧的残骸 == 1:
            属性.附加伤害加成(0.10)
        if 属性.悲剧的残骸 == 2:
            属性.附加伤害加成(0.10)
        if 属性.悲剧的残骸 == 3:
            属性.附加伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.悲剧的残骸 == 0:
            属性.移动速度 += 0.0315
        if 属性.悲剧的残骸 >= 2:
            属性.移动速度 += 0.045
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '伤害增加 +15%<br>'
        temp += '暴击伤害 +10%<br>'
        if 属性.悲剧的残骸 == 0:
            temp += '附加伤害 +10.6%<br>'
            temp += '移动速度 +3.15%<br>'
        if 属性.悲剧的残骸 == 1:
            temp += '附加伤害 +10%<br>'
        if 属性.悲剧的残骸 == 2:
            temp += '附加伤害 +10%<br>'
            temp += '移动速度 +4.5%<br>'
        if 属性.悲剧的残骸 == 3:
            temp += '附加伤害 +12%<br>'
            temp += '移动速度 +4.5%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '所有属性强化 +%d<br>' % (16 -4*self.属性1选择)
        temp += '持续伤害 +%d%%<br>' % (10 -self.属性2选择)
        temp += '暴击伤害 +%d%%<br>' % (8 -self.属性3选择)
        temp += '力量/智力 +%d<br>' % (140 - self.属性4选择 * 20)
        return temp
#endregion

#region  智慧产物
class 装备244():
    名称 = '完美掌控'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        if 属性.获取改造(self.部位) >= 5:
            for i in range(20):
                属性.技能攻击力加成(0.01)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 1, 85, 1)
        属性.技能等级加成('所有', 100, 100, 1)
        属性.所有属性强化加成(20 * 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        if 属性.获取改造(self.部位) >= 5:
            属性.攻击速度 += 0.15
            属性.移动速度 += 0.15
            属性.释放速度 += 0.225
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += 'Lv1-85 技能等级+1<br>'
        temp += 'Lv100  技能等级+1<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '所有属性强化 +%d x 20<br>' % (改造等级)
        if 改造等级 >= 5:
            temp += '技能攻击力 +1% x 20 <br>'
            temp += '攻击速度 +15%<br>'
            temp += '移动速度 +15%<br>'
            temp += '释放速度 +22.5%<br>'
        return temp        

class 装备245():
    名称 = '噙毒手套'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        if 属性.获取改造(self.部位) >= 1:
            属性.暴击伤害加成(0.33)
        if 属性.获取改造(self.部位) >= 4:
            属性.技能攻击力加成(0.10)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(8 * 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.08
        属性.魔法暴击率 += 0.08
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '物理暴击率 +8%<br>'
        temp += '魔法暴击率 +8%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '所有属性强化 +%d<br>' % (8 * 改造等级)
        if 改造等级 >= 1:
            temp += '暴击伤害 +33%<br>'
        if 改造等级 >= 4:
            temp += '技能攻击力 +10%<br>'
        return temp        

class 装备246():
    名称 = '先知者的预言'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            属性.百分比力智加成(0.18)
        if 属性.获取改造(self.部位) >= 4:
            if 属性.先知者的预言 == 0:
                属性.属性附加加成(0.05 * 0.35)
                属性.技能攻击力加成(0 + (0.10 * 0.35 + 0.15 * 0.3))
            if 属性.先知者的预言 == 1:
                属性.属性附加加成(0.05)
            if 属性.先知者的预言 == 2:
                属性.技能攻击力加成(0.10)
            if 属性.先知者的预言 == 3:
                属性.技能攻击力加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.移动速度 += 0.1
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '伤害增加 +%d%%<br>' % (4*改造等级)
        if 改造等级 >= 1:
            temp += '百分比力智 +18%<br>'
        if 改造等级 >= 4:
            if 属性.先知者的预言 == 0:
                temp += '属性附加 +{:.2f}%<br>'.format(0.05 * 0.35 * 100, 3)
                temp += '技能攻击力 +{:.2f}%<br>'.format((0.10 * 0.35 + 0.15 * 0.3)* 100)
            if 属性.先知者的预言 == 1:
                temp += '属性附加 +5%<br>'
            if 属性.先知者的预言 == 2:
                temp += '技能攻击力 +10%<br>'
            if 属性.先知者的预言 == 3:
                temp += '技能攻击力 +15%<br>'
        return temp

class 装备247():
    名称 = '骸麒之戒'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        if 属性.获取改造(self.部位) >= 5:
            属性.附加伤害加成(0.58)
        if 属性.获取改造(self.部位) >= 1 and 属性.获取改造(self.部位) < 5:
            属性.附加伤害加成(0.40)
        pass
    def 进图属性(self, 属性):
        属性.力量 += 30 * 属性.获取改造(self.部位)
        属性.智力 += 30 * 属性.获取改造(self.部位)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '力量 +{}<br>'.format(30 * 改造等级)
            temp += '智力 +{}<br>'.format(30 * 改造等级)
        if 改造等级 >= 5:
            temp += '附加伤害 +58%<br>'
        if 改造等级>= 1 and 改造等级 < 5:
            temp += '附加伤害 +40%<br>'
        return temp        

class 装备248():
    名称 = '窥视未来耳环'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        if 属性.获取改造(self.部位) >= 1:
            属性.伤害增加加成(0.40)
        if 属性.获取改造(self.部位) >= 5:
            属性.所有属性强化加成(40) 
    def 进图属性(self, 属性):
        属性.物理攻击力 +=  40 * 属性.获取改造(self.部位)
        属性.魔法攻击力 +=  40 * 属性.获取改造(self.部位)
        属性.独立攻击力 +=  40 * 属性.获取改造(self.部位)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
        if 改造等级 >= 1:
            temp += '伤害增加 +40%<br>'
        if 改造等级 >= 5:
            temp += '所有属性强化 +40<br>'
        temp += '物理攻击力 +{}<br>'.format(40 * 改造等级)
        temp += '魔法攻击力 +{}<br>'.format(40 * 改造等级)
        temp += '独立攻击力 +{}<br>'.format(40 * 改造等级)
        return temp        

class 装备249():
    名称 = '青面修罗的面具'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        if 属性.获取改造(self.部位) >= 1:
            属性.技能等级加成('所有', 1, 85, 2)
            属性.技能等级加成('所有', 100, 100, 2)
        if 属性.获取改造(self.部位) >= 4:
            属性.百分比力智加成(0.13)
        属性.所有属性强化加成(8 * 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.08
        属性.移动速度 += 0.08
        属性.释放速度 += 0.12
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '攻击速度 +8%<br>'
        temp += '移动速度 +8%<br>'
        temp += '释放速度 +12%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '所有属性强化 +{}<br>'.format(8 * 改造等级)
        if 改造等级 >= 1:
            temp += 'Lv1-85 技能等级+2<br>'
            temp += 'Lv100  技能等级+2<br>'
        if 改造等级 >= 4:
            temp += '百分比力智 +13%<br>'
        return temp        

class 装备250():
    名称 = '赤鬼的次元石'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            属性.百分比三攻加成(0.18)
        if 属性.获取改造(self.部位) >= 4:
            属性.伤害增加加成(0.14)
        if 属性.装备检查('青面修罗的面具') or 属性.装备检查('噙毒手套'):
            属性.附加伤害加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        if 属性.装备检查('青面修罗的面具') or 属性.装备检查('噙毒手套'):
            temp += '附加伤害 +7%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '暴击伤害 +{}%<br>'.format(4*改造等级)
        if 改造等级 >= 1:
            temp += '百分比三攻 +18%<br>'
        if 改造等级 >= 4:
            temp += '伤害增加 +14%<br>'
        return temp        

class 装备252():
    名称 = '无念之仪服'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.伤害增加加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            属性.技能等级加成('所有', 50, 50, 2)
            属性.技能等级加成('所有', 85, 85, 2)
            属性.技能等级加成('所有', 100, 100, 2)
            属性.属性附加加成(0.04)
        if 属性.获取改造(self.部位) >= 5:
            属性.伤害增加加成(0.10)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.12
        属性.移动速度 += 0.12
        属性.释放速度 += 0.18
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '攻击速度 +12%<br>'
        temp += '移动速度 +12%<br>'
        temp += '释放速度 +18%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '伤害增加 +{}%<br>'.format(4 * 改造等级)
        if 改造等级 >= 1:
            temp += 'Lv50  技能等级+2<br>'
            temp += 'Lv85  技能等级+2<br>'
            temp += 'Lv100 技能等级+2<br>'
            temp += '属性附加 +4%<br>'
        if 改造等级 >= 5:
            temp += '伤害增加 +10%<br>'
        return temp        

class 装备253():
    名称 = '无欲之花'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.0 + 0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            属性.技能倍率加成(50, 0.30)
            属性.技能倍率加成(85, 0.25)
            属性.技能倍率加成(100, 0.16)
            属性.伤害增加加成(0.07)
        if 属性.获取改造(self.部位) >= 5:
            属性.技能攻击力加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 +=0.05
        属性.魔法暴击率 +=0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '技能攻击力 +{}%<br>'.format(4*改造等级)
        if 改造等级 >= 1:
            temp += 'Lv50 技能攻击力+30%<br>'
            temp += 'Lv85 技能攻击力+25%<br>'
            temp += 'Lv100 (主动)技能攻击力+16%<br>'
            temp += '伤害增加 +7%<br>'
        if 改造等级 >= 5:
            temp += '技能攻击力 +12%<br>'
        return temp        

class 装备254():
    名称 = '无形之气韵'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.暴击伤害加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            属性.暴击伤害加成(0.05)
            属性.所有属性强化加成(30)
            属性.技能等级加成('所有',50,85,1)
            属性.技能等级加成('所有',100,100,1)
        if 属性.获取改造(self.部位) >= 5:
            属性.暴击伤害加成(0.10)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '暴击伤害 +{}%<br>'.format(4 * 改造等级)
        if 改造等级 >= 1:
            temp += '暴击伤害 +5%<br>'
            temp += '所有属性强化 +30<br>'
            temp += 'Lv50-85 技能等级+1<br>'
            temp += 'Lv100   技能等级+1<br>'
        if 改造等级 >= 5:
            temp += '暴击伤害 +10%<br>'
        return temp        

class 装备255():
    名称 = '无言之罪恶'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            属性.百分比力智加成(0.22)
        if 属性.获取改造(self.部位) >= 5:
            属性.最终伤害加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 +=0.20
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '移动速度 +20%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '最终伤害 +{}%<br>'.format(4 *改造等级)
        if 改造等级 >= 1:
            temp += '百分比力智 +22%<br>'
        if 改造等级 >= 5:
            temp += '最终伤害 +10%<br>'
        return temp        

class 装备256():
    名称 = '无我之轮回'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            属性.最终伤害加成(0.10)
            属性.百分比三攻加成(0.11)
        if 属性.获取改造(self.部位) >= 5:
            属性.附加伤害加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.移动速度 += 0.05
        属性.释放速度 += 0.075
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +5%<br>'
        temp += '释放速度 +7.5%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '百分比三攻 +{}%<br>'.format(4 *改造等级)
        if 改造等级 >= 1:
            temp += '最终伤害 +10%<br>'
            temp += '百分比三攻 +11%<br>'
        if 改造等级 >= 5:
            temp += '附加伤害 +10%<br>'
        return temp        
#endregion
#region 新增传说两件套 &光环套
class 套装效果119():
    名称 = '维度崩坏'
    件数 = 2
    类型 = '首饰'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·维度冲击臂环'):
            pass
        elif 属性.装备检查('时空：维度冲击臂环'):
            属性.百分比力智加成(0.10)
            属性.附加伤害加成(0.05)
        else:
            属性.百分比力智加成(0.04)
            属性.附加伤害加成(0.04)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·维度冲击臂环'):
            pass
        else:
            属性.物理暴击率 += 0.03
            属性.魔法暴击率 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·维度冲击臂环'):
            temp += '无<br>'
        elif 属性.装备检查('时空：维度冲击臂环'):
            temp += '百分比力智 +10%<br>'
            temp += '附加伤害 +5%<br>'
            temp += '物理暴击率 +3%<br>'
            temp += '魔法暴击率 +3%<br>'
        else:
            temp += '百分比力智 +4%<br>'
            temp += '附加伤害 +4%<br>'
            temp += '物理暴击率 +3%<br>'
            temp += '魔法暴击率 +3%<br>'
        return temp   


class 套装效果120():
    名称 = '暗之腐蚀'
    件数 = 2
    类型 = '特殊'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·腐蚀之黑色十字耳环'):
            pass
        elif 属性.装备检查('时空：腐蚀之黑色十字耳环'):
            属性.百分比力智加成(0.10)
            属性.暴击伤害加成(0.05)
        else:
            属性.暴击伤害加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·腐蚀之黑色十字耳环'):
            pass
        else:
            属性.物理暴击率 += 0.04
            属性.魔法暴击率 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·腐蚀之黑色十字耳环'):
            temp += '无<br>'
        elif 属性.装备检查('时空：腐蚀之黑色十字耳环'):
            temp += '百分比力智 +10%<br>'
            temp += '暴击伤害 +5%<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        else:
            temp += '暴击伤害 +10%<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        return temp   

class 套装效果121():
    名称 = '先贤的馈赠'
    件数 = 2
    类型 = '首饰'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·先贤的馈赠手镯'):
            pass
        elif 属性.装备检查('时空：先贤的馈赠手镯'):
            属性.百分比力智加成(0.10)
            属性.附加伤害加成(0.05)
        else:
            属性.百分比力智加成(0.04)
            属性.附加伤害加成(0.04)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·先贤的馈赠手镯'):
            pass
        else:
            属性.物理暴击率 += 0.03
            属性.魔法暴击率 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·先贤的馈赠手镯'):
            temp += '无<br>'
        elif 属性.装备检查('时空：先贤的馈赠手镯'):
            temp += '百分比力智 +10%<br>'
            temp += '附加伤害 +5%<br>'
            temp += '物理暴击率 +3%<br>'
            temp += '魔法暴击率 +3%<br>'
        else:
            temp += '百分比力智 +4%<br>'
            temp += '附加伤害 +4%<br>'
            temp += '物理暴击率 +3%<br>'
            temp += '魔法暴击率 +3%<br>'
        return temp      

class 套装效果122():
    名称 = '先贤的馈赠'
    件数 = 3
    类型 = '首饰'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·先贤的馈赠手镯'):
            属性.力量 += 200
            属性.智力 += 200
            属性.百分比力智加成(0.15)
            属性.附加伤害加成(0.10)
            属性.技能攻击力加成(0.05)
            属性.百分比三攻加成(0.13)
        elif 属性.装备检查('时空：先贤的馈赠手镯'):
            属性.附加伤害加成(0.05)
            属性.技能攻击力加成(0.05)
        else:
            属性.百分比力智加成(0.04)
            属性.附加伤害加成(0.04)
            属性.技能攻击力加成(0.05)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·先贤的馈赠手镯'):
            属性.物理暴击率 += 0.03
            属性.魔法暴击率 += 0.03
        else:
            pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·先贤的馈赠手镯'):
            temp += '力量 +200<br>'
            temp += '智力 +200<br>'
            temp += '百分比力智 +15%<br>'
            temp += '附加伤害 +10%<br>'
            temp += '技能攻击力 +5%<br>'
            temp += '百分比三攻 +13%<br>'
            temp += '物理暴击率 +3%<br>'
            temp += '魔法暴击率 +3%<br>'
        elif 属性.装备检查('时空：先贤的馈赠手镯'):
            temp += '附加伤害 +5%<br>'
            temp += '技能攻击力 +5%<br>'
        else:
            temp += '百分比力智 +4%<br>'
            temp += '附加伤害 +4%<br>'
            temp += '技能攻击力 +5%<br>'
        return temp      

class 套装效果123():
    名称 = '堕落的暗黑之力'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·黑暗幽灵紫杉胸甲'):
            pass
        elif 属性.装备检查('时空：黑暗幽灵紫杉胸甲'):
            属性.最终伤害加成(0.05)
            属性.附加伤害加成(0.07)
        else:
            属性.百分比三攻加成(0.05)
            属性.附加伤害加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·黑暗幽灵紫杉胸甲'):
            pass
        else:
            属性.物理暴击率 += 0.04
            属性.魔法暴击率 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·黑暗幽灵紫杉胸甲'):
            temp += '无<br>'
        elif 属性.装备检查('时空：黑暗幽灵紫杉胸甲'):
            temp += '最终伤害 +5%<br>'
            temp += '附加伤害 +7%<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        else:
            temp += '百分比三攻 +5%<br>'
            temp += '附加伤害 +7%<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        return temp

class 套装效果124():
    名称 = '鲜红血纹'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            pass
        elif 属性.装备检查('时空：鲜红血纹皮甲胸铠'):
            属性.百分比力智加成(0.10)
            属性.所有属性强化加成(25)
        else:
            属性.百分比力智加成(0.05)
            属性.所有属性强化加成(25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            pass
        else:
            属性.物理暴击率 += 0.04
            属性.魔法暴击率 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            temp += '无<br>'
        elif 属性.装备检查('时空：鲜红血纹皮甲胸铠'):
            temp += '百分比力智 +10%<br>'
            temp += '所有属性强化 +25<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        else:
            temp += '百分比力智 +5%<br>'
            temp += '所有属性强化 +25<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        return temp    

class 套装效果125():
    名称 = '鲜红血纹'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            属性.力量 += 200
            属性.智力 += 200
            属性.附加伤害加成(0.10)
            属性.最终伤害加成(0.10)
            属性.所有属性强化加成(20)
            属性.百分比三攻加成(0.05)
        elif 属性.装备检查('时空：鲜红血纹皮甲胸铠'):
            属性.附加伤害加成(0.10)
            属性.最终伤害加成(0.08)
            属性.所有属性强化加成(15)
            属性.百分比三攻加成(0.05)
        else:
            属性.附加伤害加成(0.10)
            属性.所有属性强化加成(10)
            属性.百分比三攻加成(0.05)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            pass
        else:
            属性.物理暴击率 += 0.04
            属性.魔法暴击率 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            temp += '力量 +200<br>'
            temp += '智力 +200<br>'
            temp += '附加伤害 +10%<br>'
            temp += '最终伤害 +10%<br>'
            temp += '所有属性强化 +20<br>'
            temp += '百分比三攻 +5%<br>'
        elif 属性.装备检查('时空：鲜红血纹皮甲胸铠'):
            temp += '附加伤害 +10%<br>'
            temp += '最终伤害 +8%<br>'
            temp += '所有属性强化 +15<br>'
            temp += '百分比三攻 +5%<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        else:
            temp += '附加伤害 +10%<br>'
            temp += '所有属性强化 +10<br>'
            temp += '百分比三攻 +5%<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        return temp        

class 套装效果126():
    名称 = '鲜红血纹'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            属性.力量 += 200
            属性.智力 += 200
            属性.所有属性强化加成(30)
            属性.最终伤害加成(0.06)
            属性.百分比力智加成(0.10)
            属性.技能攻击力加成(0.16)
            属性.百分比三攻加成(0.15)
        elif 属性.装备检查('时空：鲜红血纹皮甲胸铠'):
            属性.所有属性强化加成(10)
            属性.最终伤害加成(0.05)
            属性.技能攻击力加成(0.10)
            属性.百分比三攻加成(0.15)
        else:
            属性.所有属性强化加成(15)
            属性.百分比力智加成(0.05)
            属性.百分比三攻加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            属性.物理暴击率 += 0.08
            属性.魔法暴击率 += 0.08
        else:
            pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            temp += '力量 +200<br>'
            temp += '智力 +200<br>'
            temp += '所有属性强化 +30<br>'
            temp += '最终伤害 +6%<br>'
            temp += '百分比力智 +10%<br>'
            temp += '技能攻击力 +16%<br>'
            temp += '百分比三攻 +15%<br>'
            temp += '物理暴击率 +8%<br>'
            temp += '魔法暴击率 +8%<br>'
        elif 属性.装备检查('时空：鲜红血纹皮甲胸铠'):
            temp += '所有属性强化 +10<br>'
            temp += '最终伤害 +5%<br>'
            temp += '技能攻击力 +10%<br>'
            temp += '百分比三攻 +15%<br>'
        else:
            temp += '所有属性强化 +15<br>'
            temp += '百分比力智 +5%<br>'
            temp += '百分比三攻 +15%<br>'
        return temp    
#endregion

#region 希洛克挑战模式智慧产物
class 装备528():
    名称 = '无言的愤怒'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(16 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            属性.百分比力智加成(0.05)
            属性.技能攻击力加成(0.13)
        if 属性.获取改造(self.部位) >= 4:
            属性.属性附加加成(0.05)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '所有属性强化 +%d<br>' % (16 * 改造等级)
        if 改造等级 >= 1:
            temp += '力量、智力 +5%<br>'
            temp += '技能攻击力 +13%<br>'
        if 改造等级 >= 4:
            temp += '属性附加伤害 +5%<br>'
        return temp        

class 装备529():
    名称 = '无形的象征'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            属性.伤害增加加成(0.12)
            属性.附加伤害加成(0.1)
        if 属性.获取改造(self.部位) >= 4:
            属性.持续伤害 +=0.1
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '伤害增加 +%d%%<br>' % (4*改造等级)
        if 改造等级 >= 1:
            temp += '伤害增加 +12%<br>'
            temp += '附加伤害 +10%<br>'
        if 改造等级 >= 4:
            temp += '持续伤害 +10%<br>'
        return temp

class 装备530():
    名称 = '无念的戒指'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 4:
            属性.附加伤害加成(0.1)
        if 属性.获取改造(self.部位) >= 1:
            属性.所有属性强化加成(40)
            属性.伤害增加加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '技能攻击力 +{}%<br>'.format(4 * 改造等级)
        if 改造等级>= 1:
            temp += '所有属性强化 +40<br>'
            temp += '伤害增加 +10%<br>'
        if 改造等级 >= 4:
            temp += '附加伤害 +10%<br>'
        return temp        

class 装备531():
    名称 = '支配者的王冠'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.移动速度 += 0.1
        属性.百分比三攻加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            属性.百分比三攻加成(0.14)
            属性.最终伤害加成(0.08)
        if 属性.获取改造(self.部位) >= 4:
            属性.技能攻击力加成(0.1)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '移动速度 +10%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '百分比三攻 +{}%<br>'.format(4 * 改造等级)
        if 改造等级 >= 1:
            temp += '百分比三攻 +14%<br>'
            temp += '最终伤害 +8%<br>'
        if 改造等级 >= 4:
            temp += '技能攻击力 +10%<br>'
        return temp        

class 装备532():
    名称 = '灵魂的掠夺者'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            属性.暴击伤害加成(0.18)
        if 属性.获取改造(self.部位) >= 4:
            属性.附加伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.释放速度 += 0.225
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '技能攻击力 +{}%<br>'.format(4*改造等级)
        if 改造等级 >= 1:
            temp += '暴击伤害 +18%<br>'
        if 改造等级 >= 4:
            temp += '附加伤害 +14%<br>'
        return temp        

class 装备533():
    名称 = '无我的宝贝'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            属性.百分比力智加成(0.18)
        if 属性.获取改造(self.部位) >= 4:
            属性.技能攻击力加成(0.13) 
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
        if 改造等级 >= 1:
            temp += '力量、智力 +18%<br>'
        if 改造等级 >= 4:
            temp += '技能攻击力 +13%<br>'
        temp += '暴击伤害 +{}%<br>'.format(4 * 改造等级)
        return temp        

#endregion

装备列表 = []
i = 0
while i >= 0:
    try: exec('装备列表.append(装备'+str(i)+'())'); i += 1
    except: i = -1

装备序号 = dict()
套装映射 = dict()
for i in range(len(装备列表)):
    装备序号[装备列表[i].名称] = i
    套装映射[装备列表[i].所属套装 + '-' + 装备列表[i].品质 + '-' + 装备列表[i].部位] = i

套装列表 = []
i = 0
while i >= 0:
    try: exec('套装列表.append(套装效果'+str(i)+'())'); i += 1
    except: i = -1

套装序号 = dict()
for i in range(len(套装列表)):
    套装序号[套装列表[i].名称 + '[' + str(套装列表[i].件数) + ']'] = i

