#装备属性部分

#模式 = 1 仅在第五页面显示

from PublicReference.config import *

#region  100SS武器
class 装备0():
    名称 = '信念徽章：自由'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '短剑'
    力量 = 0
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.26)
        属性.百分比三攻加成(0.22)
        属性.伤害增加加成(0.22)
        属性.技能攻击力加成(0.3)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.移动速度 += 0.1
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1414<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +26%<br>'
        temp += '百分比三攻 +22%<br>'
        temp += '伤害增加 +22%<br>'
        temp += '技能攻击力 +30%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        return temp    

class 装备1():
    名称 = '太极天帝剑'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '太刀'
    力量 = 81
    智力 = 122
    物理攻击力 = 1167
    魔法攻击力 = 1290
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.1)
        属性.百分比三攻加成(0.4)
        属性.技能攻击力加成(0.3)
        if 属性.太极天帝剑 == 0:
            属性.技能攻击力加成(0.23)
        if 属性.太极天帝剑 == 1:
            属性.最终伤害加成(0.21)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.太极天帝剑 == 0:
            属性.攻击速度 += -0.5
            属性.移动速度 += -0.5
            属性.释放速度 += -0.5
        if 属性.太极天帝剑 == 1:
            属性.攻击速度 += 0.2
            属性.移动速度 += 0.2
            属性.释放速度 += 0.35
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1290<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +10%<br>'
        temp += '百分比三攻 +40%<br>'
        temp += '技能攻击力 +30%<br>'
        if 属性.太极天帝剑 == 0:
            temp += '<font color="#00A2E8">阳之气息：</font><br>'
            temp += '技能攻击力 +23%<br>'
            temp += '攻击速度 -50%<br>'
            temp += '移动速度 -50%<br>'
            temp += '释放速度 -50%<br>'
        elif 属性.太极天帝剑 == 1:
            temp += '<font color="#00A2E8">阴之气息：</font><br>'
            temp += '最终伤害 +21%<br>'
            temp += '攻击速度 +20%<br>'
            temp += '移动速度 +20%<br>'
            temp += '释放速度 +35%<br>'        
        return temp      

class 装备2():
    名称 = '哈蒂-赎月者'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '钝器'
    力量 = 122
    智力 = 0
    物理攻击力 = 1352
    魔法攻击力 = 1167
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.16)
        属性.暴击伤害加成(0.41)
        属性.附加伤害加成(0.12)
        属性.技能攻击力加成(0.32)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +122<br>'
        temp += '物理攻击力 +1352<br>'
        temp += '魔法攻击力 +1167<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +16%<br>'
        temp += '暴击伤害 +41%<br>'
        temp += '附加伤害 +12%<br>'
        temp += '技能攻击力 +32%<br>'
        temp += '攻击速度 +15%<br>'
        return temp    

class 装备3():
    名称 = '卡西姆的大剑'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '巨剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.2)
        属性.最终伤害加成(0.43)
        属性.技能攻击力加成(0.3)
        属性.技能冷却缩减(1, 45, 0.20)
        属性.技能冷却缩减(60, 80, 0.20)
        属性.技能冷却缩减(90, 95, 0.20)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        属性.释放速度 += 0.225
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1475<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '附加伤害 +20%<br>'
        temp += '最终伤害 +43%<br>'
        temp += '技能攻击力 +30%<br>'
        temp += 'Lv1-45  技能CD-20%<br>'
        temp += 'Lv60-80 技能CD-20%<br>'
        temp += 'Lv90-95 技能CD-20%<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        temp += '释放速度 +22.5%<br>'
        return temp     

class 装备4():
    名称 = '星之海：巴德纳尔'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '光剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1143
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.26)
        属性.属性附加加成(0.2)
        属性.技能攻击力加成(0.22)
        属性.所有属性强化加成(25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        属性.释放速度 += 0.225
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1143<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +26%<br>'
        temp += '属性附加 +20%<br>'
        temp += '技能攻击力 +22%<br>'
        temp += '所有属性强化 +25<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        temp += '释放速度 +22.5%<br>'
        return temp   

class 装备5():
    名称 = '白虎啸魂手套'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '手套'
    力量 = 0
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.5)
        if 属性.职业 == '气功师':
           属性.技能攻击力加成(0.4)
           属性.单技能修改('狮子吼',1.20,0.70)
        pass
    def 进图属性(self, 属性):
        if 属性.职业 == '气功师':
           属性.所有属性强化加成(56)
        pass
    def 其它属性(self, 属性):
        if 属性.职业 == '气功师':
           属性.攻击速度 += 0.1
           属性.移动速度 += 0.1
           属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1414<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +50%<br>'
        if 属性.职业 == '气功师':
           temp += '技能攻击力 +40%<br>'
           temp += '所有属性强化 +56<br>'
           temp += '狮子吼攻击力 +20% 冷却 -30%<br>'
           temp += '攻击速度 +10%<br>'
           temp += '移动速度 +10%<br>'
           temp += '释放速度 +15%<br>'
        return temp      

class 装备6():
    名称 = '太阴神：灵龟'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '臂铠'
    力量 = 122
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.14)
        属性.暴击伤害加成(0.25)
        属性.最终伤害加成(0.26)
        属性.技能攻击力加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +122<br>'
        temp += '物理攻击力 +1475<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +14%<br>'
        temp += '暴击伤害 +25%<br>'
        temp += '最终伤害 +26%<br>'
        temp += '技能攻击力 +35%<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        return temp   

class 装备7():
    名称 = '疯狂飓风'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '爪'
    力量 = 81
    智力 = 41
    物理攻击力 = 1229
    魔法攻击力 = 1229
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.16)
        属性.伤害增加加成(0.47)
        属性.持续伤害 += 0.1
        属性.技能攻击力加成(0.22)
        属性.单技能等级加成('爪精通', 3)
        属性.单技能等级加成('万毒噬心诀', 1)
        属性.单技能等级加成('燃火轰天炮', 1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +41<br>'
        temp += '物理攻击力 +1229<br>'
        temp += '魔法攻击力 +1229<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +16%<br>'
        temp += '伤害增加 +47%<br>'
        temp += '持续伤害 +10%<br>'
        temp += '技能攻击力 +22%<br>'
        temp += '爪精通 Lv+3<br>'
        temp += '万毒噬心诀 Lv+1<br>'
        temp += '燃火轰天炮 Lv+1<br>'
        temp += '移动速度 +15%<br>'
        return temp     

class 装备8():
    名称 = '猎焰追魂拳套'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '拳套'
    力量 = 81
    智力 = 0
    物理攻击力 = 1290
    魔法攻击力 = 1167
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.35)
        属性.伤害增加加成(0.24)
        属性.最终伤害加成(0.12)
        属性.技能攻击力加成(0.3)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1290<br>'
        temp += '魔法攻击力 +1167<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +35%<br>'
        temp += '伤害增加 +24%<br>'
        temp += '最终伤害 +12%<br>'
        temp += '技能攻击力 +30%<br>'
        return temp      

class 装备9():
    名称 = '青沙棍'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '东方棍'
    力量 = 81
    智力 = 122
    物理攻击力 = 1167
    魔法攻击力 = 1229
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.4)
        属性.附加伤害加成(0.34)
        属性.技能攻击力加成(0.3)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.06
        属性.魔法暴击率 += 0.06
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1229<br>'
        temp += '独立攻击力 +770<br>'
        temp += '暴击伤害 +40%<br>'
        temp += '附加伤害 +34%<br>'
        temp += '技能攻击力 +30%<br>'
        temp += '物理暴击率 +6%<br>'
        temp += '魔法暴击率 +6%<br>'
        return temp        

class 装备10():
    名称 = '午夜生死轮盘'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '左轮枪'
    力量 = 81
    智力 = 0
    物理攻击力 = 1238
    魔法攻击力 = 1042
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.18)
        属性.暴击伤害加成(0.54)
        属性.技能攻击力加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1238<br>'
        temp += '魔法攻击力 +1042<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +18%<br>'
        temp += '暴击伤害 +54%<br>'
        temp += '技能攻击力 +35%<br>'
        return temp    

class 装备11():
    名称 = '雷霆怒啸手枪'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '自动手枪'
    力量 = 0
    智力 = 81
    物理攻击力 = 868
    魔法攻击力 = 1273
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.29)
        属性.最终伤害加成(0.22)
        属性.技能攻击力加成(0.38)
        属性.所有属性强化加成(40)
        属性.单技能修改('光反应能量模块',1.2,1)
        属性.单技能等级加成('TN80终结者',3)
        属性.单技能等级加成('GSP猎鹰捕食者形态',3)
        属性.单技能等级加成('GSP猎鹰科罗纳形态',3)
        属性.单技能等级加成('GSP猎鹰旋雷者形态',3)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +868<br>'
        temp += '魔法攻击力 +1273<br>'
        temp += '独立攻击力 +770<br>'
        temp += '附加伤害 +29%<br>'
        temp += '最终伤害 +22%<br>'
        temp += '技能攻击力 +38%<br>'
        temp += '所有属性强化 +40<br>'
        temp += '光反应能量模块攻击力 +20%<br>'
        temp += 'TN80终结者 Lv+3<br>'
        temp += 'GSP猎鹰 Lv+3<br>'
        return temp     

class 装备12():
    名称 = '强力打击-X'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '步枪'
    力量 = 81
    智力 = 122
    物理攻击力 = 1331
    魔法攻击力 = 1157
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.27)
        属性.伤害增加加成(0.2)
        属性.暴击伤害加成(0.2)
        属性.技能攻击力加成(0.3)
        属性.单技能等级加成('战地勋章',2)
        属性.单技能等级加成('重火力支援',2)
        属性.单技能等级加成('制空掌握',2)
        属性.单技能等级加成('开火',2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1331<br>'
        temp += '魔法攻击力 +1157<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +27%<br>'
        temp += '伤害增加 +20%<br>'
        temp += '暴击伤害 +20%<br>'
        temp += '技能攻击力 +30%<br>'
        temp += '战地勋章 Lv+2<br>'
        temp += '重火力支援 Lv+2<br>'
        temp += '制空掌握 Lv+2<br>'
        temp += '开火 Lv+2<br>'
        return temp     

class 装备13():
    名称 = '绝杀：无人生还'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '手炮'
    力量 = 122
    智力 = 0
    物理攻击力 = 1447
    魔法攻击力 = 868
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.32)
        属性.百分比三攻加成(0.16)
        属性.技能攻击力加成(0.3)
        属性.所有属性强化加成(40)
        属性.技能等级加成('所有',50,50,2)
        属性.技能等级加成('所有',85,85,2)
        属性.技能等级加成('所有',100,100,2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +122<br>'
        temp += '物理攻击力 +1447<br>'
        temp += '魔法攻击力 +868<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +32%<br>'
        temp += '百分比三攻 +16%<br>'
        temp += '技能攻击力 +30%<br>'
        temp += '所有属性强化 +40<br>'
        temp += 'Lv50  技能等级+2<br>'
        temp += 'Lv85  技能等级+2<br>'
        temp += 'Lv100 技能等级+2<br>'
        return temp      

class 装备14():
    名称 = '激光流星弓'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '手弩'
    力量 = 81
    智力 = 41
    物理攻击力 = 1042
    魔法攻击力 = 1157
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.36)
        属性.附加伤害加成(0.35)
        属性.技能攻击力加成(0.3)
        属性.单技能等级加成('弹夹改装',1)
        属性.单技能等级加成('单兵推进器',1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.命中率 += 0.03
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +41<br>'
        temp += '物理攻击力 +1042<br>'
        temp += '魔法攻击力 +1157<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +36%<br>'
        temp += '附加伤害 +35%<br>'
        temp += '技能攻击力 +30%<br>'
        temp += '弹夹改装 Lv+1<br>'
        temp += '单兵推进器 Lv+1<br>'
        temp += '攻击速度 +10%<br>'
        temp += '命中率 +3%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp     

class 装备15():
    名称 = '歼灵灭魂矛'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '矛'
    力量 = 122
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1045
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.属性附加加成(0.15)
        属性.最终伤害加成(0.33)
        属性.技能攻击力加成(0.35)
        if 属性.职业 == '战斗法师':
            属性.技能栏[属性.技能序号['碎霸']].额外倍率 = 5
        elif 属性.职业 == '血法师':
            属性.技能栏[属性.技能序号['狱血之牙']].额外倍率 = 5
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +122<br>'
        temp += '物理攻击力 +1475<br>'
        temp += '魔法攻击力 +1045<br>'
        temp += '独立攻击力 +770<br>'
        temp += '属性附加 +15%<br>'
        temp += '最终伤害 +33%<br>'
        temp += '技能攻击力 +35%<br>'
        temp += '释放碎霸/狱血之牙时<br>10%概率攻击力 +500%<br>'
        return temp     

class 装备16():
    名称 = '混沌之种'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '棍棒'
    力量 = 81
    智力 = 81
    物理攻击力 = 1328
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.35)
        属性.附加伤害加成(0.35)
        属性.技能攻击力加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1328<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +35%<br>'
        temp += '附加伤害 +35%<br>'
        temp += '技能攻击力 +35%<br>'
        return temp    

class 装备17():
    名称 = '火焰地狱'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '魔杖'
    力量 = 0
    智力 = 122
    物理攻击力 = 1106
    魔法攻击力 = 1352
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.属性附加加成(0.15)
        属性.最终伤害加成(0.34)
        属性.技能攻击力加成(0.33)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1106<br>'
        temp += '魔法攻击力 +1352<br>'
        temp += '独立攻击力 +770<br>'
        temp += '属性附加 +15%<br>'
        temp += '最终伤害 +34%<br>'
        temp += '技能攻击力 +33%<br>'
        return temp     

class 装备18():
    名称 = '世界树的根须'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '法杖'
    力量 = 0
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1475
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.24)
        属性.百分比三攻加成(0.2)
        属性.附加伤害加成(0.1)
        属性.技能攻击力加成(0.32)
        属性.技能冷却缩减(1,100,0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.释放速度 += 0.2
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1475<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +24%<br>'
        temp += '百分比三攻 +20%<br>'
        temp += '附加伤害 +10%<br>'
        temp += '技能攻击力 +32%<br>'
        temp += 'Lv1-100 技能CD-10%<br>'
        temp += '释放速度 +20%<br>'
        return temp    

class 装备19():
    名称 = '纯白的祈祷'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '扫把'
    力量 = 0
    智力 = 81
    物理攻击力 = 1229
    魔法攻击力 = 1352
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.15)
        属性.百分比三攻加成(0.15)
        属性.伤害增加加成(0.15)
        属性.暴击伤害加成(0.15)
        属性.技能攻击力加成(0.3)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(26)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        属性.释放速度 += 0.225
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1229<br>'
        temp += '魔法攻击力 +1352<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +15%<br>'
        temp += '百分比三攻 +15%<br>'
        temp += '伤害增加 +15%<br>'
        temp += '暴击伤害 +15%<br>'
        temp += '技能攻击力 +30%<br>'
        temp += '所有属性强化 +26<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        temp += '释放速度 +22.5%<br>'
        return temp     

class 装备20():
    名称 = '圣者的慈悲'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '十字架'
    力量 = 0
    智力 = 81
    物理攻击力 = 1229
    魔法攻击力 = 1167
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.36)
        属性.百分比三攻加成(0.36)
        属性.技能攻击力加成(0.31)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.16
        属性.移动速度 += 0.16
        属性.释放速度 += 0.24
        属性.物理暴击率 += 0.08
        属性.魔法暴击率 += 0.08
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1229<br>'
        temp += '魔法攻击力 +1167<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +36%<br>'
        temp += '百分比三攻 +36%<br>'
        temp += '技能攻击力 +31%<br>'
        temp += '攻击速度 +16%<br>'
        temp += '移动速度 +16%<br>'
        temp += '释放速度 +24%<br>'
        temp += '物理暴击率 +8%<br>'
        temp += '魔法暴击率 +8%<br>'
        return temp     

class 装备21():
    名称 = '轮回之环：桓龙'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '念珠'
    力量 = 0
    智力 = 122
    物理攻击力 = 1106
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.34)
        属性.伤害增加加成(0.2)
        属性.技能攻击力加成(0.34)
        属性.技能冷却缩减(1,100,0.1)
        if 属性.职业 in ['驱魔师', '巫女']:
            属性.技能等级加成('所有',48,80,1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1106<br>'
        temp += '魔法攻击力 +1414<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +34%<br>'
        temp += '伤害增加 +20%<br>'
        temp += '技能攻击力 +34%<br>'
        temp += 'Lv1-100 技能CD-10%<br>'
        temp += '驱魔师、巫女装备时：<br>'
        temp += 'Lv48-80 技能等级+1<br>'
        return temp     

class 装备22():
    名称 = '暗战终结者'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '图腾'
    力量 = 122
    智力 = 0
    物理攻击力 = 1290
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.12)
        属性.暴击伤害加成(0.16)
        属性.附加伤害加成(0.38)
        属性.技能攻击力加成(0.36)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +122<br>'
        temp += '物理攻击力 +1290<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +12%<br>'
        temp += '暴击伤害 +16%<br>'
        temp += '附加伤害 +38%<br>'
        temp += '技能攻击力 +36%<br>'
        return temp      

class 装备23():
    名称 = '泯灭之灵'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '镰刀'
    力量 = 81
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1229
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.28)
        属性.附加伤害加成(0.18)
        属性.最终伤害加成(0.18)
        属性.技能攻击力加成(0.38)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1229<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +28%<br>'
        temp += '附加伤害 +18%<br>'
        temp += '最终伤害 +18%<br>'
        temp += '技能攻击力 +38%<br>'
        return temp   

class 装备24():
    名称 = '弗卡奴斯的第二个痕迹'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '战斧'
    力量 = 81
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1045
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.41)
        属性.持续伤害 += 0.1
        属性.最终伤害加成(0.17)
        属性.技能攻击力加成(0.28)
        属性.单技能等级加成('苍龙逐日',3)
        属性.单技能等级加成('火刑',3)
        属性.单技能修改('无双击',1.40,1)
        属性.单技能修改('行刑',1.40,1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1475<br>'
        temp += '魔法攻击力 +1045<br>'
        temp += '独立攻击力 +770<br>'
        temp += '附加伤害 +41%<br>'
        temp += '持续伤害 +10%<br>'
        temp += '最终伤害 +17%<br>'
        temp += '技能攻击力 +28%<br>'
        temp += '苍龙逐日 Lv+3<br>'
        temp += '火刑 Lv+3<br>'
        temp += '无双击攻击力 +40%<br>'
        temp += '行刑攻击力 +40%<br>'        
        return temp     

class 装备25():
    名称 = '匿影'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '匕首'
    力量 = 81
    智力 = 0
    物理攻击力 = 1167
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.属性附加加成(0.18)
        属性.最终伤害加成(0.26)
        属性.技能攻击力加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        属性.释放速度 += 0.225
        属性.命中率 += 0.15
        属性.回避率 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '属性附加 +18%<br>'
        temp += '最终伤害 +26%<br>'
        temp += '技能攻击力 +34%<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        temp += '释放速度 +22.5%<br>'
        temp += '命中率 +15%<br>'
        temp += '回避率 +15%<br>'
        return temp      

class 装备26():
    名称 = '一叶障目'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '双剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1343
    魔法攻击力 = 983
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.32)
        属性.最终伤害加成(0.32)
        属性.技能攻击力加成(0.32)
        属性.技能倍率加成(40,0.32)
        属性.技能倍率加成(45,0.32)
        属性.技能倍率加成(70,0.32)
        属性.单技能修改('忍法：影分身',0.68,0.68)
        属性.单技能修改('弧光闪',0.68,0.68)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1343<br>'
        temp += '魔法攻击力 +983<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +32%<br>'
        temp += '最终伤害 +32%<br>'
        temp += '技能攻击力 +32%<br>'
        temp += '忍法：影分身攻击和冷却 -32%<br>'
        temp += '弧光闪攻击和冷却 -32%<br>'
        return temp      

class 装备27():
    名称 = '绿色生命的面容'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '手杖'
    力量 = 0
    智力 = 81
    物理攻击力 = 1086
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.19)
        属性.附加伤害加成(0.19)
        属性.最终伤害加成(0.2)
        属性.技能攻击力加成(0.4)
        if 属性.绿色生命的面容 == 1:
            属性.最终伤害加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.绿色生命的面容 == 1:
            属性.释放速度 += 0.21
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1086<br>'
        temp += '魔法攻击力 +1414<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +19%<br>'
        temp += '附加伤害 +19%<br>'
        temp += '最终伤害 +20%<br>'
        temp += '技能攻击力 +40%<br>'
        if 属性.绿色生命的面容 == 1:
            temp += '<font color="#00A2E8">绿色生命的阴暗面：</font><br>'
            temp += '最终伤害 +10%<br>'
            temp += '释放速度 +21%<br>'
        return temp     

class 装备28():
    名称 = '血腥红宝石之眼'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '苦无'
    力量 = 0
    智力 = 122
    物理攻击力 = 1029
    魔法攻击力 = 1352
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.3)
        属性.暴击伤害加成(0.2)
        属性.技能攻击力加成(0.35)
        属性.火属性强化加成(40)
        属性.单技能等级加成('火遁·蟾蜍油炎弹',5)
        属性.单技能等级加成('八岐大蛇',5)
        属性.单技能等级加成('天照',5)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1029<br>'
        temp += '魔法攻击力 +1352<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +30%<br>'
        temp += '暴击伤害 +20%<br>'
        temp += '技能攻击力 +35%<br>'
        temp += '火属性强化 +40<br>'
        temp += '火遁·蟾蜍油炎弹 Lv+5<br>'
        temp += '八岐大蛇 Lv+5<br>'
        temp += '天照 Lv+5<br>'
        return temp     

class 装备29():
    名称 = '幻影狂欢长枪'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '长枪'
    力量 = 122
    智力 = 0
    物理攻击力 = 1290
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.4)
        属性.附加伤害加成(0.12)
        属性.最终伤害加成(0.12)
        属性.技能攻击力加成(0.28)
        属性.单技能等级加成('行云：沐',2)
        属性.单技能等级加成('行云：启',2)
        属性.单技能等级加成('行云：冥',2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +122<br>'
        temp += '物理攻击力 +1290<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '暴击伤害 +40%<br>'
        temp += '附加伤害 +12%<br>'
        temp += '最终伤害 +12%<br>'
        temp += '技能攻击力 +28%<br>'
        temp += '行云：沐 Lv+2<br>'
        temp += '行云：启 Lv+2<br>'
        temp += '行云：冥 Lv+2<br>'
        return temp     

class 装备30():
    名称 = '万夫之勇'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '战戟'
    力量 = 81
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1045
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.属性附加加成(0.14)
        属性.最终伤害加成(0.29)
        属性.技能攻击力加成(0.16)
        属性.单技能等级加成('战戟之魂',3)
        属性.单技能等级加成('战神之力',3)
        属性.单技能等级加成('千魂弑',2)
        属性.单技能等级加成('血战天狱',2)
        属性.技能等级加成('所有',100,100,2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1475<br>'
        temp += '魔法攻击力 +1045<br>'
        temp += '独立攻击力 +770<br>'
        temp += '属性附加 +14%<br>'
        temp += '最终伤害 +29%<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '战戟之魂 Lv+3<br>'
        temp += '战神之力 Lv+3<br>'
        temp += '千魂弑 Lv+2<br>'
        temp += '血战天狱 Lv+2<br>'
        temp += 'Lv100 技能等级+2<br>'
        return temp      

class 装备31():
    名称 = '千芒闪爆枪'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '光枪'
    力量 = 81
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.18)
        属性.百分比三攻加成(0.16)
        属性.附加伤害加成(0.32)
        属性.技能攻击力加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1414<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +18%<br>'
        temp += '百分比三攻 +16%<br>'
        temp += '附加伤害 +32%<br>'
        temp += '技能攻击力 +35%<br>'
        return temp      

class 装备32():
    名称 = '寂灭剧毒矛'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '暗矛'
    力量 = 81
    智力 = 122
    物理攻击力 = 1167
    魔法攻击力 = 1290
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.24)
        属性.最终伤害加成(0.4)
        属性.技能攻击力加成(0.3)
        属性.单技能等级加成('黑暗本源',3)
        属性.单技能等级加成('坠蚀之雨',2)
        属性.单技能等级加成('冥夜裂空',2)
        属性.单技能等级加成('冥蚀脉冲',2)
        属性.单技能修改('幽影暗蚀：寂灭',1.114000616,1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1290<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +24%<br>'
        temp += '最终伤害 +40%<br>'
        temp += '技能攻击力 +30%<br>'
        temp += '黑暗本源 Lv+3<br>'
        temp += '坠蚀之雨 Lv+2<br>'
        temp += '冥夜裂空 Lv+2<br>'
        temp += '冥蚀脉冲 Lv+2<br>'
        temp += '幽影暗蚀：寂灭攻击力 +11.4%<br>'
        return temp      

class 装备33():
    名称 = '金刚密藏刀'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '长刀'
    力量 = 81
    智力 = 81
    物理攻击力 = 1328
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.1)
        属性.百分比三攻加成(0.1)
        属性.伤害增加加成(0.1)
        属性.暴击伤害加成(0.1)
        属性.技能攻击力加成(0.28)
        属性.所有属性强化加成(50)
        属性.技能等级加成('所有',1,85,1)
        属性.技能等级加成('所有',100,100,1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        属性.释放速度 += 0.225
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1328<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +10%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '伤害增加 +10%<br>'
        temp += '暴击伤害 +10%<br>'
        temp += '技能攻击力 +28%<br>'
        temp += '所有属性强化 +50<br>'
        temp += 'Lv1-85 技能等级+1<br>'
        temp += 'Lv100  技能等级+1<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        temp += '释放速度 +22.5%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp      

class 装备34():
    名称 = '冰洁的红焰'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '小太刀'
    力量 = 81
    智力 = 41
    物理攻击力 = 1229
    魔法攻击力 = 1229
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.11)
        属性.伤害增加加成(0.21)
        属性.最终伤害加成(0.3)
        属性.技能攻击力加成(0.4)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +41<br>'
        temp += '物理攻击力 +1229<br>'
        temp += '魔法攻击力 +1229<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +11%<br>'
        temp += '伤害增加 +21%<br>'
        temp += '最终伤害 +30%<br>'
        temp += '技能攻击力 +40%<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        return temp     

class 装备35():
    名称 = '聚能擎天剑'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '重剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.15)
        属性.暴击伤害加成(0.55)
        属性.技能攻击力加成(0.3)
        属性.所有属性强化加成(22)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.40
        属性.移动速度 += 0.3
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1475<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +15%<br>'
        temp += '暴击伤害 +55%<br>'
        temp += '技能攻击力 +30%<br>'
        temp += '所有属性强化 +22<br>'
        temp += '攻击速度 +40%<br>'
        temp += '移动速度 +30%<br>'
        return temp      

class 装备36():
    名称 = '远古御神战剑'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '源力剑'
    力量 = 0
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.23)
        属性.附加伤害加成(0.24)
        属性.最终伤害加成(0.2)
        属性.技能攻击力加成(0.33)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1414<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +23%<br>'
        temp += '附加伤害 +24%<br>'
        temp += '最终伤害 +20%<br>'
        temp += '技能攻击力 +33%<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        return temp     

class 装备37():
    名称 = '战场的热血：安格巴迪'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '短剑'
    力量 = 0
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.3)
        属性.附加伤害加成(0.34)
        属性.技能攻击力加成(0.4)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.移动速度 += 0.05
        属性.释放速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1414<br>'
        temp += '独立攻击力 +770<br>'
        temp += '暴击伤害 +30%<br>'
        temp += '附加伤害 +34%<br>'
        temp += '技能攻击力 +40%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +5%<br>'
        temp += '释放速度 +10%<br>'
        return temp     

class 装备38():
    名称 = '前瞻守卫者'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '太刀'
    力量 = 81
    智力 = 122
    物理攻击力 = 1167
    魔法攻击力 = 1290
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.25)
        属性.伤害增加加成(0.14)
        属性.暴击伤害加成(0.26)
        属性.技能攻击力加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.移动速度 += 0.3
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1290<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +25%<br>'
        temp += '伤害增加 +14%<br>'
        temp += '暴击伤害 +26%<br>'
        temp += '技能攻击力 +35%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +30%<br>'
        return temp     

class 装备39():
    名称 = '骚动的冥焰'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '钝器'
    力量 = 122
    智力 = 0
    物理攻击力 = 1352
    魔法攻击力 = 1167
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.2)
        属性.附加伤害加成(0.32)
        属性.技能攻击力加成(0.36)
        属性.所有属性强化加成(55)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +122<br>'
        temp += '物理攻击力 +1352<br>'
        temp += '魔法攻击力 +1167<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +20%<br>'
        temp += '附加伤害 +32%<br>'
        temp += '技能攻击力 +36%<br>'
        temp += '所有属性强化 +55<br>'
        return temp     

class 装备40():
    名称 = '神之意象'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '巨剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.35)
        属性.技能攻击力加成(0.24)
        属性.所有属性强化加成(50)
        属性.技能等级加成('所有',1,85,2)
        属性.技能等级加成('所有',100,100,2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1475<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +35%<br>'
        temp += '技能攻击力 +24%<br>'
        temp += '所有属性强化 +50<br>'
        temp += 'Lv1-85 技能等级+2<br>'
        temp += 'Lv100  技能等级+2<br>'
        return temp   

class 装备41():
    名称 = '赤光剑路易纳斯'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '光剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1143
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.17)
        属性.百分比三攻加成(0.2)
        属性.最终伤害加成(0.22)
        属性.技能攻击力加成(0.33)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(31)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1143<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +17%<br>'
        temp += '百分比三攻 +20%<br>'
        temp += '最终伤害 +22%<br>'
        temp += '技能攻击力 +33%<br>'
        temp += '所有属性强化 +31<br>'
        return temp      

class 装备42():
    名称 = '无瑕之意志手套'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '手套'
    力量 = 0
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.11)
        属性.属性附加加成(0.15)
        属性.最终伤害加成(0.2)
        属性.技能攻击力加成(0.15)
        属性.技能等级加成('所有',1,48,2)
        属性.技能等级加成('所有',60,80,2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1414<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +11%<br>'
        temp += '属性附加 +15%<br>'
        temp += '最终伤害 +20%<br>'
        temp += '技能攻击力 +15%<br>'
        temp += 'Lv1-48  技能等级+2<br>'
        temp += 'Lv60-80 技能等级+2<br>'
        return temp     

class 装备43():
    名称 = '毁灭之碾压'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '臂铠'
    力量 = 122
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.4)
        属性.附加伤害加成(0.34)
        属性.技能攻击力加成(0.3)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.命中率 += 0.05
        属性.物理暴击率 += 0.1
        属性.魔法暴击率 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +122<br>'
        temp += '物理攻击力 +1475<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '暴击伤害 +40%<br>'
        temp += '附加伤害 +34%<br>'
        temp += '技能攻击力 +30%<br>'
        temp += '攻击速度 +15%<br>'
        temp += '命中率 +5%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp   

class 装备44():
    名称 = '痛苦之源'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '爪'
    力量 = 81
    智力 = 41
    物理攻击力 = 1229
    魔法攻击力 = 1229
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.17)
        属性.附加伤害加成(0.5)
        属性.技能攻击力加成(0.4)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +41<br>'
        temp += '物理攻击力 +1229<br>'
        temp += '魔法攻击力 +1229<br>'
        temp += '独立攻击力 +770<br>'
        temp += '暴击伤害 +17%<br>'
        temp += '附加伤害 +50%<br>'
        temp += '技能攻击力 +40%<br>'
        return temp     

class 装备45():
    名称 = '幻光绽放拳套'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '拳套'
    力量 = 81
    智力 = 0
    物理攻击力 = 1290
    魔法攻击力 = 1167
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.2)
        属性.附加伤害加成(0.35)
        属性.持续伤害 += 0.1
        属性.技能攻击力加成(0.26)
        属性.所有属性强化加成(35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1290<br>'
        temp += '魔法攻击力 +1167<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +20%<br>'
        temp += '附加伤害 +35%<br>'
        temp += '持续伤害 +10%<br>'
        temp += '技能攻击力 +26%<br>'
        temp += '所有属性强化 +35<br>'
        return temp      

class 装备46():
    名称 = '鸣鸿破影棍'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '东方棍'
    力量 = 81
    智力 = 122
    物理攻击力 = 1167
    魔法攻击力 = 1229
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.4)
        属性.伤害增加加成(0.3)
        属性.技能攻击力加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1229<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +40%<br>'
        temp += '伤害增加 +30%<br>'
        temp += '技能攻击力 +34%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        return temp      

class 装备47():
    名称 = '血枪之脉'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '左轮枪'
    力量 = 81
    智力 = 0
    物理攻击力 = 1238
    魔法攻击力 = 1042
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.4)
        属性.附加伤害加成(0.32)
        属性.技能攻击力加成(0.32)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.2
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1238<br>'
        temp += '魔法攻击力 +1042<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +40%<br>'
        temp += '附加伤害 +32%<br>'
        temp += '技能攻击力 +32%<br>'
        temp += '攻击速度 +20%<br>'
        return temp     

class 装备48():
    名称 = '寻觅海石竹'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '自动手枪'
    力量 = 0
    智力 = 81
    物理攻击力 = 868
    魔法攻击力 = 1273
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.35)
        属性.百分比三攻加成(0.35)
        属性.技能攻击力加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +868<br>'
        temp += '魔法攻击力 +1273<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +35%<br>'
        temp += '百分比三攻 +35%<br>'
        temp += '技能攻击力 +34%<br>'
        temp += '移动速度 +10%<br>'
        return temp
      

class 装备49():
    名称 = '湍流'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '步枪'
    力量 = 81
    智力 = 122
    物理攻击力 = 1331
    魔法攻击力 = 1157
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.23)
        属性.暴击伤害加成(0.23)
        属性.附加伤害加成(0.23)
        属性.技能攻击力加成(0.31)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1331<br>'
        temp += '魔法攻击力 +1157<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +23%<br>'
        temp += '暴击伤害 +23%<br>'
        temp += '附加伤害 +23%<br>'
        temp += '技能攻击力 +31%<br>'
        return temp    

class 装备50():
    名称 = '乾坤极电炮'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '手炮'
    力量 = 122
    智力 = 0
    物理攻击力 = 1447
    魔法攻击力 = 868
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.32)
        属性.暴击伤害加成(0.16)
        属性.附加伤害加成(0.2)
        属性.技能攻击力加成(0.3)
        属性.单技能修改('激光炮',1.2,0.7)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +122<br>'
        temp += '物理攻击力 +1447<br>'
        temp += '魔法攻击力 +868<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +32%<br>'
        temp += '暴击伤害 +16%<br>'
        temp += '附加伤害 +20%<br>'
        temp += '技能攻击力 +30%<br>'
        temp += '激光炮攻击力 +20%冷却 -30%<br>'
        return temp      

class 装备51():
    名称 = '吟游诗人的轻吟'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '手弩'
    力量 = 81
    智力 = 41
    物理攻击力 = 1042
    魔法攻击力 = 1157
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.34)
        属性.最终伤害加成(0.4)
        属性.技能攻击力加成(0.3)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.移动速度 += 0.1
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +41<br>'
        temp += '物理攻击力 +1042<br>'
        temp += '魔法攻击力 +1157<br>'
        temp += '独立攻击力 +770<br>'
        temp += '暴击伤害 +34%<br>'
        temp += '最终伤害 +40%<br>'
        temp += '技能攻击力 +30%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp    

class 装备52():
    名称 = '吟唱：不灭之魂'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '矛'
    力量 = 122
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1045
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.15)
        属性.伤害增加加成(0.25)
        属性.暴击伤害加成(0.25)
        属性.技能攻击力加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +122<br>'
        temp += '物理攻击力 +1475<br>'
        temp += '魔法攻击力 +1045<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +15%<br>'
        temp += '伤害增加 +25%<br>'
        temp += '暴击伤害 +25%<br>'
        temp += '技能攻击力 +35%<br>'
        return temp     

class 装备53():
    名称 = '精灵浮风棍'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '棍棒'
    力量 = 81
    智力 = 81
    物理攻击力 = 1328
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.26)
        属性.附加伤害加成(0.15)
        属性.最终伤害加成(0.21)
        属性.技能攻击力加成(0.33)
        属性.单技能等级加成('斗神意志',4)
        属性.单技能等级加成('御风之力',4)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 +=0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1328<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +26%<br>'
        temp += '附加伤害 +15%<br>'
        temp += '最终伤害 +21%<br>'
        temp += '技能攻击力 +33%<br>'
        temp += '斗神意志 Lv+4<br>'
        temp += '御风之力 Lv+4<br>'
        temp += '攻击速度 +10%<br>'
        return temp     

class 装备54():
    名称 = '魔力之泉：加斯达利亚'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '魔杖'
    力量 = 0
    智力 = 122
    物理攻击力 = 1106
    魔法攻击力 = 1352
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.21)
        属性.百分比三攻加成(0.21)
        属性.最终伤害加成(0.21)
        属性.技能攻击力加成(0.38)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.移动速度 += 0.1
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1106<br>'
        temp += '魔法攻击力 +1352<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +21%<br>'
        temp += '百分比三攻 +21%<br>'
        temp += '最终伤害 +21%<br>'
        temp += '技能攻击力 +38%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        return temp      

class 装备55():
    名称 = '银月的祝福'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '法杖'
    力量 = 0
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1475
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.13)
        属性.暴击伤害加成(0.13)
        属性.最终伤害加成(0.25)
        属性.技能攻击力加成(0.36)
        属性.技能等级加成('所有',50,50,2)
        属性.技能等级加成('所有',85,85,2)
        属性.技能等级加成('所有',100,100,2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.释放速度 += 0.1
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1475<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +13%<br>'
        temp += '暴击伤害 +13%<br>'
        temp += '最终伤害 +25%<br>'
        temp += '技能攻击力 +36%<br>'
        temp += 'Lv50  技能等级+2<br>'
        temp += 'Lv85  技能等级+2<br>'
        temp += 'Lv100 技能等级+2<br>'
        temp += '释放速度 +10%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp     

class 装备56():
    名称 = '世界树之精灵'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '扫把'
    力量 = 0
    智力 = 81
    物理攻击力 = 1229
    魔法攻击力 = 1352
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.属性附加加成(0.15)
        属性.最终伤害加成(0.26)
        属性.技能攻击力加成(0.26)
        属性.技能等级加成('所有',50,50,2)
        属性.技能等级加成('所有',85,85,2)
        属性.技能等级加成('所有',100,100,2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1229<br>'
        temp += '魔法攻击力 +1352<br>'
        temp += '独立攻击力 +770<br>'
        temp += '属性附加 +15%<br>'
        temp += '最终伤害 +26%<br>'
        temp += '技能攻击力 +26%<br>'
        temp += 'Lv50  技能等级+2<br>'
        temp += 'Lv85  技能等级+2<br>'
        temp += 'Lv100 技能等级+2<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp      

class 装备57():
    名称 = '闪耀的神威'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '十字架'
    力量 = 0
    智力 = 81
    物理攻击力 = 1229
    魔法攻击力 = 1167
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.3)
        属性.暴击伤害加成(0.3)
        属性.技能攻击力加成(0.32)
        属性.所有属性强化加成(40)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1229<br>'
        temp += '魔法攻击力 +1167<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +30%<br>'
        temp += '暴击伤害 +30%<br>'
        temp += '技能攻击力 +32%<br>'
        temp += '所有属性强化 +40<br>'
        temp += '移动速度 +10%<br>'
        return temp      

class 装备58():
    名称 = '古代神兽的记忆'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '念珠'
    力量 = 0
    智力 = 122
    物理攻击力 = 1106
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.33)
        属性.暴击伤害加成(0.36)
        属性.技能攻击力加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1106<br>'
        temp += '魔法攻击力 +1414<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +33%<br>'
        temp += '暴击伤害 +36%<br>'
        temp += '技能攻击力 +35%<br>'
        return temp       

class 装备59():
    名称 = '拓荒者之路'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '图腾'
    力量 = 122
    智力 = 0
    物理攻击力 = 1290
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.31)
        属性.百分比三攻加成(0.24)
        属性.暴击伤害加成(0.1)
        属性.技能攻击力加成(0.36)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.2
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +122<br>'
        temp += '物理攻击力 +1290<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +31%<br>'
        temp += '百分比三攻 +24%<br>'
        temp += '暴击伤害 +10%<br>'
        temp += '技能攻击力 +36%<br>'
        temp += '攻击速度 +20%<br>'
        return temp     

class 装备60():
    名称 = '异教主的审判'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '镰刀'
    力量 = 81
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1229
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.2)
        属性.暴击伤害加成(0.24)
        属性.附加伤害加成(0.25)
        属性.技能攻击力加成(0.31)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.14
        属性.移动速度 += 0.14
        属性.释放速度 += 0.21
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1229<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +20%<br>'
        temp += '暴击伤害 +24%<br>'
        temp += '附加伤害 +25%<br>'
        temp += '技能攻击力 +31%<br>'
        temp += '攻击速度 +14%<br>'
        temp += '移动速度 +14%<br>'
        temp += '释放速度 +21%<br>'
        return temp      

class 装备61():
    名称 = '信念之重量'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '战斧'
    力量 = 81
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1045
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.12)
        属性.最终伤害加成(0.55)
        属性.技能攻击力加成(0.4)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.移动速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1475<br>'
        temp += '魔法攻击力 +1045<br>'
        temp += '独立攻击力 +770<br>'
        temp += '暴击伤害 +12%<br>'
        temp += '最终伤害 +55%<br>'
        temp += '技能攻击力 +40%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        return temp      

class 装备62():
    名称 = '暗杀团长的玉妆刀'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '匕首'
    力量 = 81
    智力 = 0
    物理攻击力 = 1167
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.22)
        属性.百分比三攻加成(0.22)
        属性.最终伤害加成(0.22)
        属性.技能攻击力加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.移动速度 += 0.1
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +22%<br>'
        temp += '百分比三攻 +22%<br>'
        temp += '最终伤害 +22%<br>'
        temp += '技能攻击力 +35%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        return temp       

class 装备63():
    名称 = '血色舞会'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '双剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1343
    魔法攻击力 = 983
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.2)
        属性.附加伤害加成(0.21)
        属性.最终伤害加成(0.2)
        属性.技能攻击力加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        属性.命中率 += 0.05
        属性.回避率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1343<br>'
        temp += '魔法攻击力 +983<br>'
        temp += '独立攻击力 +770<br>'
        temp += '暴击伤害 +20%<br>'
        temp += '附加伤害 +21%<br>'
        temp += '最终伤害 +20%<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        temp += '命中率 +5%<br>'
        temp += '回避率 +5%<br>'
        return temp       

class 装备64():
    名称 = '圣洁的精灵遗物'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '手杖'
    力量 = 0
    智力 = 81
    物理攻击力 = 1086
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.27)
        属性.伤害增加加成(0.13)
        属性.暴击伤害加成(0.27)
        属性.技能攻击力加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.释放速度 += 0.12
        属性.命中率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1086<br>'
        temp += '魔法攻击力 +1414<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +27%<br>'
        temp += '伤害增加 +13%<br>'
        temp += '暴击伤害 +27%<br>'
        temp += '技能攻击力 +35%<br>'
        temp += '释放速度 +12%<br>'
        temp += '命中率 +5%<br>'
        return temp      

class 装备65():
    名称 = '天幕道火扇'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '苦无'
    力量 = 0
    智力 = 122
    物理攻击力 = 1029
    魔法攻击力 = 1352
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.45)
        属性.附加伤害加成(0.13)
        属性.技能攻击力加成(0.28)
        属性.技能等级加成('所有',1,45,3)
        属性.单技能等级加成('烈焰印记',3)
        属性.单技能等级加成('火遁·冥炎业火阵',2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1029<br>'
        temp += '魔法攻击力 +1352<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +45%<br>'
        temp += '附加伤害 +13%<br>'
        temp += '技能攻击力 +28%<br>'
        temp += 'Lv1-45 技能等级+3<br>'
        temp += '烈焰印记 Lv+3<br>'
        temp += '火遁·冥炎业火阵 Lv+2<br>'
        return temp      

class 装备66():
    名称 = '彪悍冲锋者'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '长枪'
    力量 = 122
    智力 = 0
    物理攻击力 = 1290
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.26)
        属性.百分比三攻加成(0.13)
        属性.伤害增加加成(0.24)
        属性.技能攻击力加成(0.38)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +122<br>'
        temp += '物理攻击力 +1290<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比力智 +26%<br>'
        temp += '百分比三攻 +13%<br>'
        temp += '伤害增加 +24%<br>'
        temp += '技能攻击力 +38%<br>'
        temp += '攻击速度 +15%<br>'
        return temp
    

class 装备67():
    名称 = '沙岩幻戟'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '战戟'
    力量 = 81
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1045
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.3)
        属性.最终伤害加成(0.24)
        属性.技能攻击力加成(0.16)
        属性.技能等级加成('所有',1,48,2)
        属性.技能等级加成('所有',60,80,2)
        属性.技能冷却缩减(1,48,0.19)
        属性.技能冷却缩减(60,80,0.19)
        属性.技能冷却缩减(90,95,0.19)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.2
        属性.移动速度 += 0.2
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1475<br>'
        temp += '魔法攻击力 +1045<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +30%<br>'
        temp += '最终伤害 +24%<br>'
        temp += '技能攻击力 +16%<br>'
        temp += 'Lv1-48  技能等级+2<br>'
        temp += 'Lv60-80 技能等级+2<br>'
        temp += 'Lv1-48  技能CD-19%<br>'
        temp += 'Lv60-80 技能CD-19%<br>'
        temp += 'Lv90-95 技能CD-19%<br>'
        temp += '攻击速度 +20%<br>'
        temp += '移动速度 +20%<br>'
        return temp       

class 装备68():
    名称 = '天将军：传承之光'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '光枪'
    力量 = 81
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.1)
        属性.暴击伤害加成(0.34)
        属性.最终伤害加成(0.2)
        属性.技能攻击力加成(0.38)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1414<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +10%<br>'
        temp += '暴击伤害 +34%<br>'
        temp += '最终伤害 +20%<br>'
        temp += '技能攻击力 +38%<br>'
        return temp     

class 装备69():
    名称 = '魅影飞龙'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '暗矛'
    力量 = 81
    智力 = 122
    物理攻击力 = 1167
    魔法攻击力 = 1290
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.26)
        属性.暴击伤害加成(0.35)
        属性.技能攻击力加成(0.38)
        属性.单技能修改('暗蚀螺旋枪',1.315316871,1)
        属性.单技能修改('暗蚀爆雷杀',1.144086022,1)
        属性.单技能修改('无尽侵蚀：缚魂',1.134989433,1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.移动速度 += 0.1
        属性.释放速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +122<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1290<br>'
        temp += '独立攻击力 +770<br>'
        temp += '伤害增加 +26%<br>'
        temp += '暴击伤害 +35%<br>'
        temp += '技能攻击力 +38%<br>'
        temp += '暗蚀螺旋枪攻击力 +31.53%<br>'
        temp += '暗蚀爆雷杀攻击力 +14.40%<br>'
        temp += '无尽侵蚀：缚魂攻击力 +13.50%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +10%<br>'
        return temp     

class 装备70():
    名称 = '夜天刀'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '长刀'
    力量 = 81
    智力 = 81
    物理攻击力 = 1328
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.属性附加加成(0.14)
        属性.最终伤害加成(0.29)
        属性.技能攻击力加成(0.16)
        属性.单技能等级加成('B.G枪刃改造',3)
        属性.单技能等级加成('B.C精锐特训',3)
        属性.单技能等级加成('电光飞掠',2)
        属性.单技能等级加成('集结·暮光之翼',2)
        属性.技能等级加成('所有',100,100,2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1328<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '属性附加 +14%<br>'
        temp += '最终伤害 +29%<br>'
        temp += '技能攻击力 +16%<br>'
        temp += 'B.G枪刃改造 Lv+3<br>'
        temp += 'B.C精锐特训 Lv+3<br>'
        temp += '电光飞掠 Lv+2<br>'
        temp += '集结·暮光之翼 Lv+2<br>'
        temp += 'Lv100 技能等级+2<br>'
        return temp    

class 装备71():
    名称 = '冥焰黑暗之触'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '小太刀'
    力量 = 81
    智力 = 41
    物理攻击力 = 1229
    魔法攻击力 = 1229
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.23)
        属性.暴击伤害加成(0.3)
        属性.附加伤害加成(0.14)
        属性.技能攻击力加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.06
        属性.魔法暴击率 += 0.06
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '智力 +41<br>'
        temp += '物理攻击力 +1229<br>'
        temp += '魔法攻击力 +1229<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +23%<br>'
        temp += '暴击伤害 +30%<br>'
        temp += '附加伤害 +14%<br>'
        temp += '技能攻击力 +35%<br>'
        temp += '物理暴击率 +6%<br>'
        temp += '魔法暴击率 +6%<br>'
        return temp      

class 装备72():
    名称 = '爆烈红焰'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '重剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1475
    魔法攻击力 = 1106
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.17)
        属性.属性附加加成(0.2)
        属性.最终伤害加成(0.15)
        属性.技能攻击力加成(0.28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +81<br>'
        temp += '物理攻击力 +1475<br>'
        temp += '魔法攻击力 +1106<br>'
        temp += '独立攻击力 +770<br>'
        temp += '附加伤害 +17%<br>'
        temp += '属性附加 +20%<br>'
        temp += '最终伤害 +15%<br>'
        temp += '技能攻击力 +28%<br>'
        return temp       

class 装备73():
    名称 = '谍影：超级核心'
    模式 = 0
    所属套装 = '无'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    类型 = '源力剑'
    力量 = 0
    智力 = 81
    物理攻击力 = 1167
    魔法攻击力 = 1414
    独立攻击力 = 770
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.22)
        属性.暴击伤害加成(0.2)
        属性.最终伤害加成(0.2)
        属性.技能攻击力加成(0.08)
        属性.单技能等级加成('源力剑精通',3)
        try:
            属性.技能栏[属性.技能序号['源力剑精通']].谍影专用倍率 = 2
        except:
            pass
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +81<br>'
        temp += '物理攻击力 +1167<br>'
        temp += '魔法攻击力 +1414<br>'
        temp += '独立攻击力 +770<br>'
        temp += '百分比三攻 +22%<br>'
        temp += '暴击伤害 +20%<br>'
        temp += '最终伤害 +20%<br>'
        temp += '技能攻击力 +8%<br>'
        temp += '源力剑精通 Lv+3<br>'
        temp += '源力剑精通数值翻倍<br>'
        return temp

#endregion

#region  100SS防具 
class 装备74():
    名称 = '魔法师[???]的长袍'
    模式 = 0
    所属套装 = '遗忘魔法师的馈赠'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.05)
        属性.百分比三攻加成(0.1)
        属性.最终伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有',1,45,1)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +5%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '最终伤害 +12%<br>'
        temp += 'Lv1-45 技能等级+1<br>'
        return temp      

class 装备75():
    名称 = '死亡阴影夹克'
    模式 = 0
    所属套装 = '死亡阴影'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.04)
        属性.伤害增加加成(0.18)
        属性.暴击伤害加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +4%<br>'
        temp += '伤害增加 +18%<br>'
        temp += '暴击伤害 +10%<br>'
        return temp     

class 装备76():
    名称 = '燃烧烈焰之勇气'
    模式 = 0
    所属套装 = '贫瘠沙漠的遗产'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(属性.技能栏空位 / 100)
        属性.暴击伤害加成(0.28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +' + str(属性.技能栏空位) + '%<br>'
        temp += '暴击伤害 +28%<br>'
        return temp      

class 装备77():
    名称 = '撒旦：沸腾之怒'
    模式 = 0
    所属套装 = '噩梦：地狱之路'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.16)
        属性.暴击伤害加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +16%<br>'
        temp += '暴击伤害 +16%<br>'
        return temp      

class 装备78():
    名称 = '奔流不息之岁月'
    模式 = 0
    所属套装 = '永恒不息之路'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.3)
        if 属性.职业 == '缔造者':
            属性.技能倍率加成(50, -0.3)
            属性.技能恢复加成(50, 50, 1.00)
        else:
            属性.技能倍率加成(45, -0.3)
            属性.技能恢复加成(45, 45, 1.00)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +30%<br>'
        if 属性.职业 == '缔造者':
            temp += 'Lv50技能：<br>攻击力-30%  恢复+100%<br>'
        else:
            temp += 'Lv45技能：<br>攻击力-30%  恢复+100%<br>'
        return temp      

class 装备79():
    名称 = '优雅旋律华尔兹'
    模式 = 0
    所属套装 = '天堂舞姬'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.17)
        属性.暴击伤害加成(0.14)
        属性.技能冷却缩减(1, 45, 0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +17%<br>'
        temp += '暴击伤害 +14%<br>'
        temp += 'Lv1-45 技能CD-10%<br>'
        return temp
     
class 装备80():
    名称 = '首席执行官裁决夹克'
    模式 = 0
    所属套装 = '皇家裁决者宣言'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.19)
        属性.暴击伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +19%<br>'
        temp += '暴击伤害 +14%<br>'
        return temp      

class 装备81():
    名称 = '炙炎：火龙果'
    模式 = 0
    所属套装 = '炙炎之盛宴'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.16)
        属性.暴击伤害加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +16%<br>'
        temp += '暴击伤害 +15%<br>'
        temp += '攻击速度 +10%<br>'
        return temp    

class 装备82():
    名称 = '妖精之姿'
    模式 = 0
    所属套装 = '传奇铁匠-封神'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '最终伤害 +34%<br>'
        temp += '移动速度 +10%<br>'
        return temp      

class 装备83():
    名称 = '人性的抉择'
    模式 = 0
    所属套装 = '命运歧路'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.11)
        属性.伤害增加加成(0.21)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +11%<br>'
        temp += '伤害增加 +21%<br>'
        return temp     

class 装备84():
    名称 = '大祭司的星祈礼袍'
    模式 = 0
    所属套装 = '古代祭祀的神圣仪式'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.1)
        属性.百分比三攻加成(0.1)
        属性.最终伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +10%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '最终伤害 +12%<br>'
        return temp      

class 装备85():
    名称 = '冲锋陷阵胸甲'
    模式 = 0
    所属套装 = '龙血玄黄'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            属性.百分比三攻加成(0.35)
        else:
            属性.百分比三攻加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            temp += '百分比三攻 +35%<br>'
        else:
            temp += '百分比三攻 +34%<br>'
        return temp    

class 装备86():
    名称 = '气吞山河战甲'
    模式 = 0
    所属套装 = '擎天战甲'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.34)
        if 属性.职业 == '缔造者':
            属性.技能等级加成('所有', 50, 50, 2)
        else:
            属性.技能等级加成('所有', 45, 45, 2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +34%<br>'
        if 属性.职业 == '缔造者':
            temp += 'Lv50 技能等级+2<br>'
        else:
            temp += 'Lv45 技能等级+2<br>'
        return temp

class 装备87():
    名称 = '千链锁灵战甲'
    模式 = 0
    所属套装 = '荆棘漫天'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +35%<br>'
        return temp     

class 装备88():
    名称 = '宽恕坚韧之地'
    模式 = 0
    所属套装 = '大自然的呼吸'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.28)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(24)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +28%<br>'
        temp += '所有属性强化 +24<br>'
        return temp    

class 装备89():
    名称 = '堕落深渊黑魔法衬衫'
    模式 = 0
    所属套装 = '深渊窥视者'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '最终伤害 +35%<br>'
        return temp     

class 装备90():
    名称 = '引路者的黄昏披风'
    模式 = 0
    所属套装 = '圣者的黄昏'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.2)
        属性.百分比三攻加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +20%<br>'
        temp += '百分比三攻 +12%<br>'
        return temp     

class 装备91():
    名称 = '地狱边缘'
    模式 = 0
    所属套装 = '坎坷命运'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.04
        属性.移动速度 += 0.04
        属性.释放速度 += 0.06
        if 属性.装备检查('悲痛者项链'):
            属性.攻击速度 -= 0.01
            属性.移动速度 -= 0.01
            属性.释放速度 -= 0.015
        if 属性.装备检查('悲情者遗物'):
            属性.攻击速度 -= 0.01
            属性.移动速度 -= 0.01
            属性.释放速度 -= 0.015
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +35%<br>'
        temp += '攻击速度 +4%<br>'
        temp += '移动速度 +4%<br>'
        temp += '释放速度 +6%<br>'
        if 属性.装备检查('悲痛者项链'):
            temp += '攻击速度 -1%<br>'
            temp += '移动速度 -1%<br>'
            temp += '释放速度 -1.5%<br>'
        if 属性.装备检查('悲情者遗物'):
            temp += '攻击速度 -1%<br>'
            temp += '移动速度 -1%<br>'
            temp += '释放速度 -1.5%<br>'
        return temp     

class 装备92():
    名称 = '泣血之恨'
    模式 = 0
    所属套装 = '吞噬愤怒'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.23)
        属性.持续伤害 += 0.1
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +23%<br>'
        temp += '持续伤害 +10%<br>'
        return temp      

class 装备93():
    名称 = '大魔法师[???]的长袍'
    模式 = 0
    所属套装 = '遗忘魔法师的馈赠'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '布甲'

    属性1描述 = '伤害增加：'
    属性1范围 = [11, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能等级Lv1 -'
    属性2范围 = [45, 5, 5]
    属性2选择 = 0
    属性3描述 = '百分比力智：'
    属性3范围 = [12, 3, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.05 + (12 - self.属性3选择) / 100)
        属性.百分比三攻加成(0.1)
        属性.伤害增加加成((11 - self.属性1选择) / 100)
        属性.最终伤害加成(0.12)
        属性.技能等级加成('所有', 1, (45 - self.属性2选择 * 5) , 1)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 1, 45, 1)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +5%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '最终伤害 +12%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '伤害增加 +%d%%<br>' % (11 - self.属性1选择)
        temp += 'Lv1-%d 技能等级+1<br>' % (45 - self.属性2选择 * 5)
        temp += '百分比力智 +%d%%<br>' % (12 - self.属性3选择)
        return temp 

class 装备94():
    名称 = '掌管生死之影夹克'
    模式 = 0
    所属套装 = '死亡阴影'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '皮甲'

    属性1描述 = '百分比力智：'
    属性1范围 = [10, 1, 1]
    属性1选择 = 0
    属性2描述 = '暴击伤害：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '物攻/魔攻/独立 +'
    属性3范围 = [170, 80, 10]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.物理攻击力 += 170 - self.属性3选择 * 10
        属性.魔法攻击力 += 170 - self.属性3选择 * 10
        属性.独立攻击力 += 170 - self.属性3选择 * 10
        属性.百分比力智加成(0.10 - self.属性1选择 / 100)
        属性.百分比三攻加成(0.04)
        属性.伤害增加加成(0.18)
        属性.暴击伤害加成(0.2 - self.属性2选择 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +4%<br>'
        temp += '伤害增加 +18%<br>'
        temp += '暴击伤害 +10%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '百分比力智 +%d%%<br>' % (10 - self.属性1选择)
        temp += '暴击伤害 +%d%%<br>' % (10 - self.属性2选择)
        temp += '物攻/魔攻/独立 +%d<br>' % (170 - 10 * self.属性3选择)
        return temp     

class 装备95():
    名称 = '爆裂大地之勇猛'
    模式 = 0
    所属套装 = '贫瘠沙漠的遗产'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '轻甲'

    属性1描述 = '百分比三攻：'
    属性1范围 = [8, 1, 1]
    属性1选择 = 0
    属性2描述 = '百分比力智：'
    属性2范围 = [8, 1, 1]
    属性2选择 = 0
    属性3描述 = '暴击伤害：'
    属性3范围 = [15, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.08 - self.属性2选择 / 100)
        属性.百分比三攻加成(0.08 - self.属性1选择 / 100)
        属性.伤害增加加成(属性.技能栏空位 / 100)
        属性.暴击伤害加成(0.43 - self.属性3选择 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +28%<br>'
        temp += '伤害增加 +' + str(属性.技能栏空位) + '%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '百分比三攻 +%d%%<br>' % (8 - self.属性1选择)
        temp += '百分比力智 +%d%%<br>' % (8 - self.属性2选择)
        temp += '暴击伤害 +%d%%<br>' % (15 - self.属性3选择)
        return temp     

class 装备96():
    名称 = '撒旦：愤怒之王'
    模式 = 0
    所属套装 = '噩梦：地狱之路'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '重甲'

    属性1描述 = '持续伤害：'
    属性1范围 = [5, 2, 1]
    属性1选择 = 0
    属性2描述 = '暴击伤害：'
    属性2范围 = [7, 1, 1]
    属性2选择 = 0
    属性3描述 = '附加伤害：'
    属性3范围 = [4, 1, 1]
    属性3选择 = 0
    属性4描述 = '伤害增加：'
    属性4范围 = [9, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.25 - self.属性4选择 / 100)
        属性.暴击伤害加成(0.23 - self.属性2选择 / 100)
        属性.附加伤害加成(0.04 - self.属性3选择 / 100)
        属性.持续伤害 += 0.05 - self.属性1选择 / 100
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +16%<br>'
        temp += '暴击伤害 +16%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '持续伤害 +%d%%<br>' % (5 - self.属性1选择)
        temp += '暴击伤害 +%d%%<br>' % (7 - self.属性2选择)
        temp += '附加伤害 +%d%%<br>' % (4 - self.属性3选择)
        temp += '伤害增加 +%d%%<br>' % (9 - self.属性4选择)
        return temp    

class 装备97():
    名称 = '英明循环之生命'
    模式 = 0
    所属套装 = '永恒不息之路'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '板甲'

    属性1描述 = '技能等级Lv25 -'
    属性1范围 = [45, 30, 5]
    属性1选择 = 0
    属性2描述 = '附加伤害：'
    属性2范围 = [5, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比力智：'
    属性3范围 = [8, 1, 1]
    属性3选择 = 0
    属性4描述 = '最终伤害：'
    属性4范围 = [6, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.08 - self.属性3选择 / 100)
        属性.伤害增加加成(0.3)
        属性.附加伤害加成(0.05 - self.属性2选择 / 100)
        属性.最终伤害加成(0.06 - self.属性4选择 / 100)
        if 属性.职业 == '缔造者':
            属性.技能倍率加成(50, -0.3)
            属性.技能恢复加成(50, 50, 1.00)
        else:
            属性.技能倍率加成(45, -0.3)
            属性.技能恢复加成(45, 45, 1.00)
        属性.技能等级加成('所有', 25, 45 - self.属性1选择 * 5, 1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +30%<br>'
        if 属性.职业 == '缔造者':
            temp += 'Lv50技能：<br>攻击力-30%  恢复+100%<br>'
        else:
            temp += 'Lv45技能：<br>攻击力-30%  恢复+100%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += 'Lv25-%d 技能等级+1<br>' % (45 - 5 * self.属性1选择)
        temp += '附加伤害 +%d%%<br>' % (5 - self.属性2选择)
        temp += '百分比力智 +%d%%<br>' % (8 - self.属性3选择)
        temp += '最终伤害 +%d%%<br>' % (6 - self.属性4选择)
        return temp       

class 装备98():
    名称 = '浪漫旋律华尔兹'
    模式 = 0
    所属套装 = '天堂舞姬'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '布甲'

    属性1描述 = '百分比三攻：'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '最终伤害：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '伤害增加：'
    属性3范围 = [8, 1, 1]
    属性3选择 = 0
    属性4描述 = '所有属性强化 +'
    属性4范围 = [24, 12, 4]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.03 - self.属性1选择 / 100)
        属性.伤害增加加成(0.25 - self.属性3选择 / 100)
        属性.暴击伤害加成(0.14)
        属性.最终伤害加成(0.1 - self.属性2选择 / 100)
        属性.所有属性强化加成(24 - self.属性4选择 * 4)
        属性.技能冷却缩减(1, 45, 0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +17%<br>'
        temp += '暴击伤害 +14%<br>'
        temp += 'Lv1-45 技能CD-10%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '百分比三攻 +%d%%<br>' % (3 - self.属性1选择)
        temp += '最终伤害 +%d%%<br>' % (10 - self.属性2选择)
        temp += '伤害增加 +%d%%<br>' % (8 - self.属性3选择)
        temp += '所有属性强化 +%d<br>' % (24 - 4 * self.属性4选择)
        return temp     

class 装备99():
    名称 = '皇家裁决者审判外套'
    模式 = 0
    所属套装 = '皇家裁决者宣言'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '皮甲'

    属性1描述 = '暴击伤害：'
    属性1范围 = [7, 1, 1]
    属性1选择 = 0
    属性2描述 = '伤害增加：'
    属性2范围 = [5, 1, 1]
    属性2选择 = 0
    属性3描述 = '附加伤害：'
    属性3范围 = [6, 1, 1]
    属性3选择 = 0
    属性4描述 = '最终伤害：'
    属性4范围 = [5, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.19)
        属性.伤害增加加成(0.05 - self.属性2选择 / 100)
        属性.暴击伤害加成(0.21 - self.属性1选择 / 100)
        属性.附加伤害加成(0.06 - self.属性3选择 / 100)
        属性.最终伤害加成(0.05 - self.属性4选择 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +19%<br>'
        temp += '暴击伤害 +14%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '暴击伤害 +%d%%<br>' % (7 - self.属性1选择)
        temp += '伤害增加 +%d%%<br>' % (5 - self.属性2选择)
        temp += '附加伤害 +%d%%<br>' % (6 - self.属性3选择)
        temp += '最终伤害 +%d%%<br>' % (5 - self.属性4选择)
        return temp
     
class 装备100():
    名称 = '炙炎：霸王树'
    模式 = 0
    所属套装 = '炙炎之盛宴'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '轻甲'

    属性1描述 = '最终伤害：'
    属性1范围 = [10, 1, 1]
    属性1选择 = 0
    属性2描述 = '暴击伤害：'
    属性2范围 = [8, 1, 1]
    属性2选择 = 0
    属性3描述 = '伤害增加：'
    属性3范围 = [4, 1, 1]
    属性3选择 = 0
    属性4描述 = '百分比力智：'
    属性4范围 = [3, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.03 - self.属性4选择 / 100)
        属性.百分比三攻加成(0.16)
        属性.伤害增加加成(0.04 - self.属性3选择 / 100)
        属性.暴击伤害加成(0.23 - self.属性2选择 / 100)
        属性.最终伤害加成(0.1 - self.属性1选择 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +16%<br>'
        temp += '暴击伤害 +15%<br>'
        temp += '攻击速度 +15%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '最终伤害 +%d%%<br>' % (10 - self.属性1选择)
        temp += '暴击伤害 +%d%%<br>' % (8 - self.属性2选择)
        temp += '伤害增加 +%d%%<br>' % (4 - self.属性3选择)
        temp += '百分比力智 +%d%%<br>' % (3 - self.属性4选择)
        return temp     

class 装备101():
    名称 = '天堂之翼'
    模式 = 0
    所属套装 = '传奇铁匠-封神'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '重甲'

    属性1描述 = '附加伤害：'
    属性1范围 = [9, 1, 1]
    属性1选择 = 0
    属性2描述 = '百分比力智：'
    属性2范围 = [4, 1, 1]
    属性2选择 = 0
    属性3描述 = '最终伤害：'
    属性3范围 = [4, 1, 1]
    属性3选择 = 0
    属性4描述 = '百分比三攻：'
    属性4范围 = [7, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.04 - self.属性2选择 / 100)
        属性.百分比三攻加成(0.07 - self.属性4选择 / 100)
        属性.附加伤害加成(0.09 - self.属性1选择 / 100)
        属性.最终伤害加成(0.38 - self.属性3选择 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.5
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '最终伤害 +34%<br>'
        temp += '移动速度 +5%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '附加伤害 +%d%%<br>' % (9 - self.属性1选择)
        temp += '百分比力智 +%d%%<br>' % (4 - self.属性2选择)
        temp += '最终伤害 +%d%%<br>' % (4 - self.属性3选择)
        temp += '百分比三攻 +%d%%<br>' % (7 - self.属性4选择)
        return temp     

class 装备102():
    名称 = '神赐的抉择'
    模式 = 0
    所属套装 = '命运歧路'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '板甲'

    属性1描述 = '伤害增加：'
    属性1范围 = [5, 1, 1]
    属性1选择 = 0
    属性2描述 = '暴击伤害：'
    属性2范围 = [7, 1, 1]
    属性2选择 = 0
    属性3描述 = '最终伤害：'
    属性3范围 = [6, 1, 1]
    属性3选择 = 0
    属性4描述 = '附加伤害：'
    属性4范围 = [5, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.21)
        属性.百分比三攻加成(0.11)
        属性.伤害增加加成(0.05 - self.属性1选择 / 100)
        属性.暴击伤害加成(0.07 - self.属性2选择 / 100)
        属性.附加伤害加成(0.05 - self.属性4选择 / 100)
        属性.最终伤害加成(0.06 - self.属性3选择 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +21%<br>'
        temp += '百分比三攻 +11%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '伤害增加 +%d%%<br>' % (5 - self.属性1选择)
        temp += '暴击伤害 +%d%%<br>' % (7 - self.属性2选择)
        temp += '最终伤害 +%d%%<br>' % (6 - self.属性3选择)
        temp += '附加伤害 +%d%%<br>' % (5 - self.属性4选择)
        return temp       

class 装备103():
    名称 = '大祭司的神启礼服'
    模式 = 0
    所属套装 = '古代祭祀的神圣仪式'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '布甲'

    属性1描述 = '附加伤害：'
    属性1范围 = [10, 2, 1]
    属性1选择 = 0
    属性2描述 = '百分比力智：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比三攻：'
    属性3范围 = [11, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.2 - self.属性2选择 / 100)
        属性.百分比三攻加成(0.21 - self.属性3选择 / 100)
        属性.附加伤害加成(0.1 - self.属性1选择 / 100)
        属性.最终伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +10%<br>'
        temp += '百分比三攻 +11%<br>'
        temp += '最终伤害 +12%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '附加伤害 +%d%%<br>' % (10 - self.属性1选择)
        temp += '百分比力智 +%d%%<br>' % (10 - self.属性2选择)
        temp += '百分比三攻 +%d%%<br>' % (11 - self.属性3选择)
        return temp    

class 装备104():
    名称 = '战无不胜上衣'
    模式 = 0
    所属套装 = '龙血玄黄'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '皮甲'

    属性1描述 = '伤害增加：'
    属性1范围 = [4, 1, 1]
    属性1选择 = 0
    属性2描述 = '百分比三攻：'
    属性2范围 = [3, 1, 1]
    属性2选择 = 0
    属性3描述 = '暴击伤害：'
    属性3范围 = [10, 1, 1]
    属性3选择 = 0
    属性4描述 = '百分比力智：'
    属性4范围 = [8, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.08 - self.属性4选择 / 100)
        属性.百分比三攻加成(0.38 - self.属性2选择 / 100)
        属性.伤害增加加成(0.04 - self.属性1选择 / 100)
        属性.暴击伤害加成(0.1 - self.属性3选择 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +35%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '伤害增加 +%d%%<br>' % (4 - self.属性1选择)
        temp += '百分比三攻 +%d%%<br>' % (3 - self.属性2选择)
        temp += '暴击伤害 +%d%%<br>' % (10 - self.属性3选择)
        temp += '百分比力智 +%d%%<br>' % (8 - self.属性4选择)
        return temp     

class 装备105():
    名称 = '摧枯拉朽胸甲'
    模式 = 0
    所属套装 = '擎天战甲'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '轻甲'

    属性1描述 = '技能攻击力：'
    属性1范围 = [4, 1, 1]
    属性1选择 = 0
    属性2描述 = '最终伤害：'
    属性2范围 = [4, 1, 1]
    属性2选择 = 0
    属性3描述 = '伤害增加：'
    属性3范围 = [9, 1, 1]
    属性3选择 = 0
    属性4描述 = '暴击伤害：'
    属性4范围 = [7, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.43 - self.属性3选择 / 100)
        属性.暴击伤害加成(0.07 - self.属性4选择 / 100)
        属性.最终伤害加成(0.04 - self.属性2选择 / 100)
        属性.技能攻击力加成(0.04 - self.属性1选择 / 100)
        if 属性.职业 == '缔造者':
            属性.技能等级加成('所有', 50, 50, 2)
        else:
            属性.技能等级加成('所有', 45, 45, 2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +34%<br>'
        if 属性.职业 == '缔造者':
            temp += 'Lv50 技能等级+2<br>'
        else:
            temp += 'Lv45 技能等级+2<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '技能攻击力 +%d%%<br>' % (4 - self.属性1选择)
        temp += '最终伤害 +%d%%<br>' % (4 - self.属性2选择)
        temp += '伤害增加 +%d%%<br>' % (9 - self.属性3选择)
        temp += '暴击伤害 +%d%%<br>' % (7 - self.属性4选择)
        return temp    

class 装备106():
    名称 = '千链万化战甲'
    模式 = 0
    所属套装 = '荆棘漫天'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '重甲'

    属性1描述 = '暴击伤害：'
    属性1范围 = [10, 1, 1]
    属性1选择 = 0
    属性2描述 = '百分比三攻：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '附加伤害：'
    属性3范围 = [10, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.1 - self.属性2选择 / 100)
        属性.伤害增加加成(0.35)
        属性.暴击伤害加成(0.1 - self.属性1选择 / 100)
        属性.附加伤害加成(0.1 - self.属性3选择 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +35%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '暴击伤害 +%d%%<br>' % (10 - self.属性1选择)
        temp += '百分比三攻 +%d%%<br>' % (10 - self.属性2选择)
        temp += '附加伤害 +%d%%<br>' % (10 - self.属性3选择)
        return temp
    
class 装备107():
    名称 = '生命脉动之地'
    模式 = 0
    所属套装 = '大自然的呼吸'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '板甲'

    属性1描述 = '百分比力智：'
    属性1范围 = [12, 1, 1]
    属性1选择 = 0
    属性2描述 = '伤害增加：'
    属性2范围 = [9, 1, 1]
    属性2选择 = 0
    属性3描述 = '最终伤害：'
    属性3范围 = [9, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.4 - self.属性1选择 / 100)
        属性.伤害增加加成(0.09 - self.属性2选择 / 100)
        属性.最终伤害加成(0.09 - self.属性3选择 / 100)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(24)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +28%<br>'
        temp += '所有属性强化 +24<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '百分比力智 +%d%%<br>' % (12 - self.属性1选择)
        temp += '伤害增加 +%d%%<br>' % (9 - self.属性2选择)
        temp += '最终伤害 +%d%%<br>' % (9 - self.属性3选择)
        return temp

class 装备108():
    名称 = '深渊囚禁者长袍'
    模式 = 0
    所属套装 = '深渊窥视者'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '布甲'

    属性1描述 = '技能等级Lv5 -'
    属性1范围 = [100, 10, 5]
    属性1选择 = 0
    属性2描述 = '百分比三攻：'
    属性2范围 = [7, 1, 1]
    属性2选择 = 0
    属性3描述 = '物攻/魔攻/独立 +'
    属性3范围 = [80, 10, 10]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.物理攻击力 += 80 - self.属性3选择 * 10
        属性.魔法攻击力 += 80 - self.属性3选择 * 10
        属性.独立攻击力 += 80 - self.属性3选择 * 10
        属性.百分比三攻加成(0.07 - self.属性2选择 / 100)
        属性.最终伤害加成(0.35)
        属性.技能等级加成('所有', 5, 100 - self.属性1选择 * 5, 1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '最终伤害 +35%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += 'Lv5-%d 技能等级+1<br>' % (100 - 5 * self.属性1选择)
        temp += '百分比三攻 +%d%%<br>' % (7 - self.属性2选择)
        temp += '物攻/魔攻/独立 +%d<br>' % (80 - 10 * self.属性2选择)
        return temp      

class 装备109():
    名称 = '圣者的黄昏披风'
    模式 = 0
    所属套装 = '圣者的黄昏'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '皮甲'

    属性1描述 = '所有属性强化 +'
    属性1范围 = [40, 4, 4]
    属性1选择 = 0
    属性2描述 = '伤害增加：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '附加伤害：'
    属性3范围 = [10, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.2)
        属性.百分比三攻加成(0.12)
        属性.伤害增加加成(0.1 - self.属性2选择 / 100)
        属性.附加伤害加成(0.1 - self.属性3选择 / 100)
        属性.所有属性强化加成(40 - self.属性1选择 * 4)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +20%<br>'
        temp += '百分比三攻 +12%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '所有属性强化 +%d<br>' % (40 - 4 * self.属性1选择)
        temp += '伤害增加 +%d%%<br>' % (10 - self.属性2选择)
        temp += '附加伤害 +%d%%<br>' % (10 - self.属性3选择)
        return temp     

class 装备110():
    名称 = '逆转结局'
    模式 = 0
    所属套装 = '坎坷命运'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '轻甲'

    属性1描述 = '技能等级Lv30 -'
    属性1范围 = [48, 35, 5]
    属性1选择 = 0
    属性2描述 = '物攻/魔攻/独立 +'
    属性2范围 = [70, 10, 10]
    属性2选择 = 0
    属性3描述 = '最终伤害：'
    属性3范围 = [5, 1, 1]
    属性3选择 = 0
    属性4描述 = '力量/智力 +'
    属性4范围 = [160, 40, 20]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.力量 += 160 - self.属性4选择 * 20
        属性.智力 += 160 - self.属性4选择 * 20
        属性.物理攻击力 += 70 - self.属性2选择 * 10
        属性.魔法攻击力 += 70 - self.属性2选择 * 10
        属性.独立攻击力 += 70 - self.属性2选择 * 10
        if 属性.装备检查('悲痛者项链'):
            属性.百分比三攻加成(-0.10)
            属性.附加伤害加成(0.10)
        if 属性.装备检查('悲情者遗物'):
            属性.百分比三攻加成(-0.10)
            属性.附加伤害加成(0.10)
        属性.最终伤害加成(0.05 - self.属性3选择 / 100)
        属性.技能攻击力加成(0.35)
        属性.技能等级加成('所有', 30, min(48, 50 - self.属性1选择 * 5), 1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.06
        属性.移动速度 += 0.06
        属性.释放速度 += 0.09
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '技能攻击力 +35%<br>'
        temp += '攻击速度 +4%<br>'
        temp += '移动速度 +4%<br>'
        temp += '释放速度 +6%<br>'
        if 属性.装备检查('悲痛者项链'):
            temp += '百分比三攻 -10%<br>'
            temp += '附加伤害 +10%<br>'
        if 属性.装备检查('悲情者遗物'):
            temp += '百分比三攻 -10%<br>'
            temp += '附加伤害 +10%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += 'Lv30-%d 技能等级+1<br>' % (min(48, 50 - 5 * self.属性1选择))
        temp += '物攻/魔攻/独立 +%d<br>' % (70 - 10 * self.属性2选择)
        temp += '最终伤害 +%d%%<br>' % (5 - self.属性3选择)
        temp += '力量/智力 +%d<br>' % (160 - 20 * self.属性4选择)
        return temp        

class 装备111():
    名称 = '灭世之怒'
    模式 = 0
    所属套装 = '吞噬愤怒'
    等级 = 100
    品质 = '神话'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':150, '轻甲':160, '重甲':155, '板甲':150}
    智力 = {'布甲':160, '皮甲':150, '轻甲':140, '重甲':140, '板甲':150}
    类型 = '重甲'

    属性1描述 = '最终伤害：'
    属性1范围 = [4, 1, 1]
    属性1选择 = 0
    属性2描述 = '百分比三攻：'
    属性2范围 = [13, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比力智：'
    属性3范围 = [4, 1, 1]
    属性3选择 = 0
    属性4描述 = '技能攻击力：'
    属性4范围 = [5, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.04 - self.属性3选择 / 100)
        属性.百分比三攻加成(0.13 - self.属性2选择 / 100)
        属性.附加伤害加成(0.23)
        属性.持续伤害 += 0.1
        属性.最终伤害加成(0.04 - self.属性1选择 / 100)
        属性.技能攻击力加成(0.05 - self.属性4选择 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +23%<br>'
        temp += '持续伤害 +10%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '最终伤害 +%d%%<br>' % (4 - self.属性1选择)
        temp += '百分比三攻 +%d%%<br>' % (13 - self.属性2选择)
        temp += '百分比力智 +%d%%<br>' % (4 - self.属性3选择)
        temp += '技能攻击力 +%d%%<br>' % (5 - self.属性4选择)
        return temp     

class 装备112():
    名称 = '魔法师[???]的护腿'
    模式 = 0
    所属套装 = '遗忘魔法师的馈赠'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.05)
        属性.百分比三攻加成(0.1)
        属性.伤害增加加成(0.12)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(18)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +5%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '伤害增加 +12%<br>'
        temp += '所有属性强化 +18<br>'
        return temp    

class 装备113():
    名称 = '死亡阴影短裤'
    模式 = 0
    所属套装 = '死亡阴影'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.04)
        属性.伤害增加加成(0.18)
        属性.暴击伤害加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +4%<br>'
        temp += '伤害增加 +18%<br>'
        temp += '暴击伤害 +10%<br>'
        return temp        

class 装备114():
    名称 = '肆虐狂风之意志'
    模式 = 0
    所属套装 = '贫瘠沙漠的遗产'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(属性.技能栏空位 / 100)
        属性.暴击伤害加成(0.16)
        属性.附加伤害加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +' + str(属性.技能栏空位) + '%<br>'
        temp += '暴击伤害 +16%<br>'
        temp += '附加伤害 +10%<br>'
        return temp    

class 装备115():
    名称 = '亚蒙：谎言之力'
    模式 = 0
    所属套装 = '噩梦：地狱之路'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.16)
        属性.最终伤害加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +16%<br>'
        temp += '最终伤害 +16%<br>'
        return temp 

class 装备116():
    名称 = '奔流不息之伽蓝'
    模式 = 0
    所属套装 = '永恒不息之路'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.31)
        属性.技能倍率加成(40, -0.3)
        属性.技能恢复加成(40, 40, 1.0)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +31%<br>'
        temp += 'Lv40技能：<br>攻击力-30%  恢复+100%<br>'
        return temp      

class 装备117():
    名称 = '魅惑律动伦巴'
    模式 = 0
    所属套装 = '天堂舞姬'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.14)
        属性.最终伤害加成(0.17)
        属性.技能冷却缩减(35, 45, 0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +14%<br>'
        temp += '最终伤害 +17%<br>'
        temp += 'Lv35-45 技能CD-15%<br>'
        return temp    

class 装备118():
    名称 = '首席执行官裁决短裤'
    模式 = 0
    所属套装 = '皇家裁决者宣言'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.16)
        属性.最终伤害加成(0.17)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +16%<br>'
        temp += '最终伤害 +17%<br>'
        return temp      

class 装备119():
    名称 = '炙炎：荔枝'
    模式 = 0
    所属套装 = '炙炎之盛宴'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.33)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +33%<br>'
        return temp      

class 装备120():
    名称 = '邪恶之角'
    模式 = 0
    所属套装 = '传奇铁匠-封神'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +34%<br>'
        return temp       

class 装备121():
    名称 = '命运的抉择'
    模式 = 0
    所属套装 = '命运歧路'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        if 属性.命运的抉择 == 0:
            属性.伤害增加加成(0.07)
            属性.暴击伤害加成(0.07)
            属性.附加伤害加成(0.07)
            属性.最终伤害加成(0.07)
            属性.百分比三攻加成(0.07)
        if 属性.命运的抉择 == 1:
            属性.伤害增加加成(0.35)
        if 属性.命运的抉择 == 2:
            属性.暴击伤害加成(0.35)
        if 属性.命运的抉择 == 3:
            属性.附加伤害加成(0.35)
        if 属性.命运的抉择 == 4:
            属性.最终伤害加成(0.35)
        if 属性.命运的抉择 == 5:
            属性.百分比三攻加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        if 属性.命运的抉择 == 0:
            temp += '期望属性：<br>'
            temp += '伤害增加 +7%<br>'
            temp += '暴击伤害 +7%<br>'
            temp += '附加伤害 +7%<br>'
            temp += '最终伤害 +7%<br>'
            temp += '百分比三攻 +7%<br>'
        if 属性.命运的抉择 == 1:
            temp += '伤害增加 +35%<br>'
        if 属性.命运的抉择 == 2:
            temp += '暴击伤害 +35%<br>'
        if 属性.命运的抉择 == 3:
            temp += '附加伤害 +35%<br>'
        if 属性.命运的抉择 == 4:
            temp += '最终伤害 +35%<br>'
        if 属性.命运的抉择 == 5:
            temp += '百分比三攻 +35%<br>'
        return temp      

class 装备122():
    名称 = '大祭司的星祈长裙'
    模式 = 0
    所属套装 = '古代祭祀的神圣仪式'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.1)
        属性.百分比三攻加成(0.1)
        属性.伤害增加加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +10%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '伤害增加 +12%<br>'
        return temp     

class 装备123():
    名称 = '破釜沉舟护腿'
    模式 = 0
    所属套装 = '龙血玄黄'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            属性.暴击伤害加成(0.35)
        else:
            属性.暴击伤害加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            temp += '暴击伤害 +35%<br>'
        else:
            temp += '暴击伤害 +34%<br>'
        return temp     

class 装备124():
    名称 = '雷霆万钧护腿'
    模式 = 0
    所属套装 = '擎天战甲'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.34)
        属性.技能等级加成('所有', 35, 35, 2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +34%<br>'
        temp += 'Lv35 技能等级+2<br>'
        return temp      

class 装备125():
    名称 = '千链锁灵护腿'
    模式 = 0
    所属套装 = '荆棘漫天'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +35%<br>'
        return temp     

class 装备126():
    名称 = '蚕食新绿之息'
    模式 = 0
    所属套装 = '大自然的呼吸'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.32)
        pass
    def 进图属性(self, 属性):
        属性.暗属性强化加成(24)
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.1
        属性.魔法暴击率 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '最终伤害 +32%<br>'
        temp += '暗属性强化 +24<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp      

class 装备127():
    名称 = '驱散黑暗短裤'
    模式 = 0
    所属套装 = '黑魔法探求者'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +35%<br>'
        return temp      

class 装备128():
    名称 = '时空漩涡护腿'
    模式 = 0
    所属套装 = '时空旅行者'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.32)
        属性.技能冷却缩减(60, 80, 0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '最终伤害 +32%<br>'
        temp += 'Lv60-80 技能CD-10%<br>'
        temp += '移动速度 +10%<br>'
        return temp
      
class 装备129():
    名称 = '灵魂的呐喊'
    模式 = 0
    所属套装 = '穿透命运的呐喊'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.14)
        属性.附加伤害加成(0.17)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +14%<br>'
        temp += '附加伤害 +17%<br>'
        return temp      

class 装备130():
    名称 = '疯狂之如影随形'
    模式 = 0
    所属套装 = '狂乱追随者'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.1)
        属性.暴击伤害加成(0.22)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '暴击伤害 +22%<br>'
        return temp     

class 装备131():
    名称 = '魔法师[???]的披风'
    模式 = 0
    所属套装 = '遗忘魔法师的馈赠'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.05)
        属性.百分比三攻加成(0.1)
        属性.技能攻击力加成(0.13)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +5%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '技能攻击力 +13%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp    

class 装备132():
    名称 = '死亡阴影护肩'
    模式 = 0
    所属套装 = '死亡阴影'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.04)
        属性.暴击伤害加成(0.18)
        属性.技能攻击力加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +4%<br>'
        temp += '暴击伤害 +18%<br>'
        temp += '技能攻击力 +10%<br>'
        return temp      

class 装备133():
    名称 = '艰难求生之斗志'
    模式 = 0
    所属套装 = '贫瘠沙漠的遗产'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(属性.技能栏空位 / 100)
        属性.附加伤害加成(0.16)
        属性.技能攻击力加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +' + str(属性.技能栏空位) + '%<br>'
        temp += '附加伤害 +16%<br>'
        temp += '技能攻击力 +10%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp       

class 装备134():
    名称 = '贝利亚尔：毁灭之种'
    模式 = 0
    所属套装 = '噩梦：地狱之路'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.16)
        属性.技能攻击力加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +16%<br>'
        temp += '技能攻击力 +16%<br>'
        return temp     

class 装备135():
    名称 = '奔流不息之山川'
    模式 = 0
    所属套装 = '永恒不息之路'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.1)
        属性.技能攻击力加成(0.2)
        属性.技能倍率加成(35, -0.3)
        属性.技能恢复加成(35, 35, 1.0)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '技能攻击力 +20%<br>'
        temp += 'Lv35技能：<br>攻击力-30%  恢复+100%<br>'
        return temp
      
class 装备136():
    名称 = '性感洒脱探戈'
    模式 = 0
    所属套装 = '天堂舞姬'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.17)
        属性.技能攻击力加成(0.14)
        属性.技能冷却缩减(75, 80, 0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +17%<br>'
        temp += '技能攻击力 +14%<br>'
        temp += 'Lv75-80 技能CD-15%<br>'
        return temp    

class 装备137():
    名称 = '首席执行官裁决肩甲'
    模式 = 0
    所属套装 = '皇家裁决者宣言'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.12)
        属性.技能攻击力加成(0.2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +12%<br>'
        temp += '技能攻击力 +20br>'
        return temp     

class 装备138():
    名称 = '炙炎：榴莲'
    模式 = 0
    所属套装 = '炙炎之盛宴'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.33)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '技能攻击力 +33%<br>'
        return temp    

class 装备139():
    名称 = '魔龙之心'
    模式 = 0
    所属套装 = '传奇铁匠-封神'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.12)
        属性.技能攻击力加成(0.2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.释放速度 += 0.16
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +12%<br>'
        temp += '技能攻击力 +20%<br>'
        temp += '释放速度 +16%<br>'
        return temp      

class 装备140():
    名称 = '矛盾的抉择'
    模式 = 0
    所属套装 = '命运歧路'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '技能攻击力 +34%<br>'
        return temp     

class 装备141():
    名称 = '大祭司的星祈披肩'
    模式 = 0
    所属套装 = '古代祭祀的神圣仪式'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.1)
        属性.百分比三攻加成(0.1)
        属性.技能攻击力加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('大祭司的神启礼服'):
            属性.释放速度 += 0.24
        else:
            属性.释放速度 += 0.18
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +10%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '技能攻击力 +12%<br>'
        if 属性.装备检查('大祭司的神启礼服'):
            temp += '释放速度 +24%<br>'
        else:
            temp += '释放速度 +18%<br>'
        return temp     

class 装备142():
    名称 = '枪林弹雨护肩'
    模式 = 0
    所属套装 = '龙血玄黄'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            属性.技能攻击力加成(0.35)
        else:
            属性.技能攻击力加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            temp += '技能攻击力 +35%<br>'
        else:
            temp += '技能攻击力 +34%<br>'
        return temp
   
class 装备143():
    名称 = '排山倒海护肩'
    模式 = 0
    所属套装 = '擎天战甲'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.34)
        属性.技能等级加成('所有', 60, 60, 2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '技能攻击力 +34%<br>'
        temp += 'Lv60 技能等级+2<br>'
        return temp     

class 装备144():
    名称 = '千链锁灵肩甲'
    模式 = 0
    所属套装 = '荆棘漫天'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += -0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '技能攻击力 +34%<br>'
        temp += '攻击速度 -10%<br>'
        return temp       

class 装备145():
    名称 = '猛烈燃烧之炎'
    模式 = 0
    所属套装 = '大自然的呼吸'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.32)
        pass
    def 进图属性(self, 属性):
        属性.火属性强化加成(24)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '技能攻击力 +32%<br>'
        temp += '火属性强化 +24<br>'
        temp += '攻击速度 +10%<br>'
        return temp      

class 装备146():
    名称 = '魔法师[???]的长靴'
    模式 = 0
    所属套装 = '遗忘魔法师的馈赠'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.05)
        属性.百分比三攻加成(0.1)
        属性.暴击伤害加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.移动速度 += 0.14
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +5%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '暴击伤害 +16%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +14%<br>'
        temp += '释放速度 +15%<br>'
        return temp      

class 装备147():
    名称 = '死亡阴影长靴'
    模式 = 0
    所属套装 = '死亡阴影'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.04)
        属性.暴击伤害加成(0.1)
        属性.附加伤害加成(0.18)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +4%<br>'
        temp += '暴击伤害 +10%<br>'
        temp += '附加伤害 +18%<br>'
        temp += '移动速度 +4%<br>'
        return temp     

class 装备148():
    名称 = '寂静寒夜之忍耐'
    模式 = 0
    所属套装 = '贫瘠沙漠的遗产'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.28)
        属性.伤害增加加成(属性.技能栏空位 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +28%<br>'
        temp += '伤害增加 +' + str(属性.技能栏空位) + '%<br>'
        temp += '移动速度 +4%<br>'
        return temp     

class 装备149():
    名称 = '巴尔：堕落之魂'
    模式 = 0
    所属套装 = '噩梦：地狱之路'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.16)
        属性.伤害增加加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +16%<br>'
        temp += '伤害增加 +16%<br>'
        temp += '移动速度 +4%<br>'
        return temp      

class 装备150():
    名称 = '奔流不息之银河'
    模式 = 0
    所属套装 = '永恒不息之路'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.28)
        属性.技能倍率加成(25, -0.3)
        属性.技能恢复加成(25, 25, 1.0)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +28%<br>'
        temp += 'Lv25技能：<br>攻击力-30%  恢复+100%<br>'
        temp += '移动速度 +4%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp     

class 装备151():
    名称 = '激烈欢动踢踏'
    模式 = 0
    所属套装 = '天堂舞姬'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.17)
        属性.附加伤害加成(0.14)
        属性.技能冷却缩减(1, 30, 0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +17%<br>'
        temp += '附加伤害 +14%<br>'
        temp += 'Lv1-30 技能CD-15%<br>'
        temp += '移动速度 +4%<br>'
        return temp   

class 装备152():
    名称 = '首席执行官裁决长靴'
    模式 = 0
    所属套装 = '皇家裁决者宣言'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.11)
        属性.最终伤害加成(0.21)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +11%<br>'
        temp += '最终伤害 +21%<br>'
        temp += '移动速度 +4%<br>'
        return temp     

class 装备153():
    名称 = '炙炎：木瓜'
    模式 = 0
    所属套装 = '炙炎之盛宴'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.3)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.19
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +30%<br>'
        temp += '移动速度 +19%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp      

class 装备154():
    名称 = '自然之核'
    模式 = 0
    所属套装 = '传奇铁匠-封神'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(70)
        属性.技能等级加成('所有', 1, 85, 1)
        属性.技能等级加成('所有', 100, 100, 1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '所有属性强化 +70<br>'
        temp += 'Lv1-85 技能等级+1<br>'
        temp += 'Lv100  技能等级+1<br>'
        temp += '移动速度 +4%<br>'
        return temp     

class 装备155():
    名称 = '守护的抉择'
    模式 = 0
    所属套装 = '命运歧路'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.17)
        if 属性.护石第一栏 != '无':
            属性.单技能修改(属性.护石第一栏, 1.55, 0.7)
        if 属性.护石第二栏 != '无':
            属性.单技能修改(属性.护石第二栏, 1.45, 0.75)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += 属性.护石第一栏 + '：<br>攻击力 +55% 冷却 -30%<br>'
        temp += 属性.护石第二栏 + '：<br>攻击力 +45% 冷却 -25%<br>'
        temp += '附加伤害 +17%<br>'
        temp += '移动速度 +4%<br>'
        return temp     

class 装备156():
    名称 = '大祭司的星祈凉鞋'
    模式 = 0
    所属套装 = '古代祭祀的神圣仪式'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.1)
        属性.百分比三攻加成(0.1)
        属性.附加伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('大祭司的神启礼服'):
            属性.移动速度 += 0.18
        else:
            属性.移动速度 += 0.12
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +10%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '附加伤害 +12%<br>'
        if 属性.装备检查('大祭司的神启礼服'):
            temp += '移动速度 +18%<br>'
        else:
            temp += '移动速度 +12%<br>'
        return temp      

class 装备157():
    名称 = '赤地千里战靴'
    模式 = 0
    所属套装 = '龙血玄黄'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            属性.百分比力智加成(0.35)
        else:
            属性.百分比力智加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            temp += '百分比力智 +35%<br>'
        else:
            temp += '百分比力智 +34%<br>'
        temp += '移动速度 +4%<br>'
        return temp     

class 装备158():
    名称 = '遮天蔽日长靴'
    模式 = 0
    所属套装 = '擎天战甲'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.34)
        属性.技能等级加成('所有', 70, 70, 2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '最终伤害 +34%<br>'
        temp += 'Lv70 技能等级+2<br>'
        temp += '移动速度 +4%<br>'
        return temp     

class 装备159():
    名称 = '千链锁灵战靴'
    模式 = 0
    所属套装 = '荆棘漫天'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += -0.06
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '最终伤害 +35%<br>'
        temp += '移动速度 -6%<br>'
        return temp      

class 装备160():
    名称 = '交织烈日之风'
    模式 = 0
    所属套装 = '大自然的呼吸'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.32)
        pass
    def 进图属性(self, 属性):
        属性.光属性强化加成(24)
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.14
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +32%<br>'
        temp += '光属性强化 +24<br>'
        temp += '移动速度 +14%<br>'
        return temp       

class 装备161():
    名称 = '堕入地狱之脚'
    模式 = 0
    所属套装 = '地狱求道者'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(70)
        属性.技能等级加成('所有', 1, 90, 1)
        属性.技能等级加成('所有', 100, 100, 1)
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '所有属性强化 +70<br>'
        temp += 'Lv1-90 技能等级+1<br>'
        temp += 'Lv100  技能等级+1<br>'
        temp += '移动速度 +4%<br>'
        return temp     

class 装备162():
    名称 = '次元漫步者长靴'
    模式 = 0
    所属套装 = '次元旅行者'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.1)
        属性.伤害增加加成(0.19)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 1, 45, 1)
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.14
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '伤害增加 +19%<br>'
        temp += 'Lv1-45 技能等级+1<br>'
        temp += '移动速度 +14%<br>'
        return temp    

class 装备163():
    名称 = '悲喜交加'
    模式 = 0
    所属套装 = '天命无常'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.29)
        pass
    def 进图属性(self, 属性):
        if '天命无常[2]' in 属性.套装栏:
            if 属性.天命无常 == 0:
                if 属性.装备检查('命运反抗者'):
                    属性.所有属性强化加成(24)
                else :
                    属性.所有属性强化加成(20)
            elif 属性.天命无常 % 2 == 0:
                    属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +29%<br>'
        temp += '移动速度 +4%<br>'
        if 属性.天命无常 == 0:
            if 属性.装备检查('命运反抗者'):
                temp += '所有属性强化 +24(期望)<br>'
            else:
                temp += '所有属性强化 +20(期望)<br>'
        elif 属性.天命无常 % 2 == 0:
            temp += '所有属性强化 +40<br>'
        return temp     

class 装备164():
    名称 = '崩溃世界的忧伤'
    模式 = 0
    所属套装 = '悲剧的残骸'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.17)
        if 属性.悲剧的残骸 == 0:
            if 属性.装备检查('心痛如绞的诀别'):
                属性.附加伤害加成(0.106)
            else:
                属性.附加伤害加成(0.10)
        elif 属性.悲剧的残骸 == 1:
            if 属性.装备检查('心痛如绞的诀别'):
                属性.附加伤害加成(0.10)
            else:
                属性.附加伤害加成(0.08)
        elif 属性.悲剧的残骸 == 2:
            属性.附加伤害加成(0.10)
        elif 属性.悲剧的残骸 == 3:
            属性.附加伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.悲剧的残骸 == 0:
            属性.攻击速度 += 0.021
        elif 属性.悲剧的残骸 >= 2:
            属性.攻击速度 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +17%<br>'
        if 属性.悲剧的残骸 == 0:
            if 属性.装备检查('心痛如绞的诀别'):        
                temp += '附加伤害 +10.6%(期望)<br>'
            else:
                temp += '附加伤害 +10%(期望)<br>'
        elif 属性.悲剧的残骸 == 1:
            if 属性.装备检查('心痛如绞的诀别'):
                temp += '附加伤害 +10%<br>'
            else:
                temp += '附加伤害 +8%<br>'
        elif 属性.悲剧的残骸 == 2:
            temp += '附加伤害 +10%<br>'
        elif 属性.悲剧的残骸 == 3:
            temp += '附加伤害 +12%<br>'
        if 属性.悲剧的残骸 == 0:
            temp += '攻击速度 +2.1%(期望)<br>'
        elif 属性.悲剧的残骸 >= 2:
            temp += '攻击速度 +3%<br>'
        return temp      

class 装备165():
    名称 = '魔法师[???]的腰带'
    模式 = 0
    所属套装 = '遗忘魔法师的馈赠'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.05)
        属性.百分比三攻加成(0.1)
        属性.附加伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +5%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '附加伤害 +14%<br>'
        return temp    

class 装备166():
    名称 = '死亡阴影腰带'
    模式 = 0
    所属套装 = '死亡阴影'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.04)
        属性.暴击伤害加成(0.10)
        属性.附加伤害加成(0.18)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +4%<br>'
        temp += '暴击伤害 +10%<br>'
        temp += '附加伤害 +18%<br>'
        return temp   

class 装备167():
    名称 = '守护战士之苦难'
    模式 = 0
    所属套装 = '贫瘠沙漠的遗产'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.16)
        属性.伤害增加加成(属性.技能栏空位 / 100)
        属性.附加伤害加成(0.1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +16%<br>'
        temp += '伤害增加 +' + str(属性.技能栏空位) + '%<br>'
        temp += '附加伤害 +10%<br>'
        return temp      

class 装备168():
    名称 = '亚巴顿：绝望地狱'
    模式 = 0
    所属套装 = '噩梦：地狱之路'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.16)
        属性.暴击伤害加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +16%<br>'
        temp += '暴击伤害 +16%<br>'
        return temp      

class 装备169():
    名称 = '奔流不息之狂风'
    模式 = 0
    所属套装 = '永恒不息之路'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.32)
        属性.技能倍率加成(30, -0.3)
        属性.技能恢复加成(30, 30, 1.0)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +32%<br>'
        temp += 'Lv30技能：<br>攻击力-30%  恢复+100%<br>'
        return temp     

class 装备170():
    名称 = '热情舞动桑巴'
    模式 = 0
    所属套装 = '天堂舞姬'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.17)
        属性.最终伤害加成(0.14)
        属性.技能冷却缩减(60, 70, 0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +17%<br>'
        temp += '最终伤害 +14%<br>'
        temp += 'Lv60-70 技能CD-15%<br>'
        return temp    

class 装备171():
    名称 = '首席执行官裁决腰带'
    模式 = 0
    所属套装 = '皇家裁决者宣言'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.18)
        属性.暴击伤害加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +18%<br>'
        temp += '暴击伤害 +15%<br>'
        return temp      

class 装备172():
    名称 = '炙炎：山竹'
    模式 = 0
    所属套装 = '炙炎之盛宴'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(60)
        属性.百分比三攻加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '所有属性强化 +60<br>'
        temp += '百分比三攻 +16%<br>'
        temp += '释放速度 +15%<br>'
        return temp     

class 装备173():
    名称 = '碎钢之牙'
    模式 = 0
    所属套装 = '传奇铁匠-封神'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +34%<br>'
        temp += '攻击速度 +10%<br>'
        return temp      

class 装备174():
    名称 = '正义的抉择'
    模式 = 0
    所属套装 = '命运歧路'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.2)
        属性.技能倍率加成(50, 0.25)
        属性.技能倍率加成(85, 0.45)
        属性.技能冷却缩减(85, 85, 0.20)
        属性.技能倍率加成(100, 0.13)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +20%<br>'
        temp += 'Lv50 技能攻击力+25%<br>'
        temp += 'Lv85 技能：<br>攻击力+45% 冷却-20%<br>'
        temp += 'Lv100 (主动)技能攻击力+13%<br>'
        return temp    

class 装备175():
    名称 = '大祭司的星祈腰带'
    模式 = 0
    所属套装 = '古代祭祀的神圣仪式'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.1)
        属性.百分比三攻加成(0.1)
        属性.暴击伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('大祭司的神启礼服'):
            属性.攻击速度 += 0.18
        else:
            属性.攻击速度 += 0.12
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +10%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '暴击伤害 +12%<br>'
        temp += '攻击速度 +18%<br>'
        temp += '攻击速度 +12%<br>'
        return temp      

class 装备176():
    名称 = '浴血奋战腰带'
    模式 = 0
    所属套装 = '龙血玄黄'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.技能等级加成('所有', 1, 85, 1)
        属性.技能等级加成('所有', 100, 100, 1)
        pass
    def 进图属性(self, 属性):
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            属性.所有属性强化加成(72)
        else:
            属性.所有属性强化加成(68)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += 'Lv1-85 技能等级+1<br>'
        temp += 'Lv100  技能等级+1<br>'
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            temp += '所有属性强化 +72<br>'
        else:    
            temp += '所有属性强化 +68<br>'
        return temp     

class 装备177():
    名称 = '风起云涌腰带'
    模式 = 0
    所属套装 = '擎天战甲'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.34)
        属性.技能等级加成('所有', 40, 40, 2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +34%<br>'
        temp += 'Lv40 技能等级+2<br>'
        return temp      

class 装备178():
    名称 = '千链锁灵腰带'
    模式 = 0
    所属套装 = '荆棘漫天'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.释放速度 += -0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +35%<br>'
        temp += '释放速度 -15%<br>'
        return temp     

class 装备179():
    名称 = '宁静苍翠之水'
    模式 = 0
    所属套装 = '大自然的呼吸'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.32)
        pass
    def 进图属性(self, 属性):
        属性.冰属性强化加成(24)
        pass
    def 其它属性(self, 属性):
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +32%<br>'
        temp += '冰属性强化 +24<br>'
        temp += '释放速度 +15%<br>'
        return temp
#endregion

#region  100SS首饰
class 装备180():
    名称 = '莱多：变幻的规律'
    模式 = 0
    所属套装 = '上古尘封术士'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.12)
        属性.技能攻击力加成(0.2)
        属性.所有属性强化加成(25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '附加伤害 +12%<br>'
        temp += '技能攻击力 +20%<br>'
        temp += '所有属性强化 +25<br>'
        temp += '移动速度 +10%<br>'
        return temp   

class 装备181():
    名称 = '拥抱晨曦之温暖'
    模式 = 0
    所属套装 = '破晓曦光'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.06)
        属性.技能攻击力加成(0.04 + 0.01 * min(13, 属性.获取强化(self.部位)))
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 1, 48, 1)
        属性.技能恢复加成(15, 30, 0.30)  
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '最终伤害 +6%<br>'
        temp += '技能攻击力 +' + str(4 + min(13,属性.获取强化(self.部位))) + '%<br>'
        temp += '所有属性强化 +28<br>'
        temp += 'Lv1-48  技能等级+1<br>'
        temp += 'Lv15-30 技能恢复+30%<br>'
        return temp      

class 装备182():
    名称 = '白象之庇护'
    模式 = 0
    所属套装 = '幸运三角'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.07)
        属性.伤害增加加成(0.07)
        属性.暴击伤害加成(0.07)
        属性.附加伤害加成(0.07)
        属性.技能攻击力加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '百分比力智 +7%<br>'
        temp += '伤害增加 +7%<br>'
        temp += '暴击伤害 +7%<br>'
        temp += '附加伤害 +7%<br>'
        temp += '技能攻击力 +7%<br>'
        return temp   

class 装备183():
    名称 = '火魔之焰-沙罗曼达'
    模式 = 0
    所属套装 = '精灵使的权能'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(38)
        属性.附加伤害加成(0.3)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '所有属性强化 +38<br>'
        temp += '附加伤害 +30%<br>'
        return temp     

class 装备184():
    名称 = '执着的探求'
    模式 = 0
    所属套装 = '黑魔法探求者'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.28)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '最终伤害 +28%<br>'
        temp += '所有属性强化 +40<br>'
        return temp      

class 装备185():
    名称 = '时间指引之针'
    模式 = 0
    所属套装 = '时空旅行者'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.2)
        属性.技能攻击力加成(0.14)
        属性.技能冷却缩减(50, 50, 0.10)
        属性.技能冷却缩减(85, 85, 0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '百分比力智 +20%<br>'
        temp += '技能攻击力 +14%<br>'
        temp += 'Lv50 技能CD-10%<br>'
        temp += 'Lv85 技能CD-10%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        return temp     

class 装备186():
    名称 = '支配战场的呐喊'
    模式 = 0
    所属套装 = '穿透命运的呐喊'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.12)
        属性.最终伤害加成(0.23)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '伤害增加 +12%<br>'
        temp += '最终伤害 +23%<br>'
        return temp     

class 装备187():
    名称 = '狂乱之坚如磐石'
    模式 = 0
    所属套装 = '狂乱追随者'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.3)
        属性.技能攻击力加成(0.11)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '百分比力智 +30%<br>'
        temp += '技能攻击力 +11%<br>'
        return temp     

class 装备188():
    名称 = '莱多：秩序创造者'
    模式 = 0
    所属套装 = '上古尘封术士'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '百分比三攻：'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力：'
    属性2范围 = [6, 1, 1]
    属性2选择 = 0
    属性3描述 = '暴击伤害：'
    属性3范围 = [9, 1, 1]
    属性3选择 = 0
    属性4描述 = '百分比力智：'
    属性4范围 = [6, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.06 - self.属性4选择 / 100)
        属性.百分比三攻加成(0.03 - self.属性1选择 / 100)
        属性.暴击伤害加成(0.09 - self.属性3选择 / 100)
        属性.附加伤害加成(0.12)
        属性.技能攻击力加成(0.20)
        属性.技能攻击力加成(0.06  - self.属性2选择 / 100)
        属性.所有属性强化加成(25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.移动速度 += 0.1
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +149<br>'
        temp += '智力 +100<br>'
        temp += '附加伤害 +12%<br>'
        temp += '技能攻击力 +20%<br>'
        temp += '所有属性强化 +25<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '百分比三攻 +%d%%<br>' % (3 - self.属性1选择)
        temp += '技能攻击力 +%d%%<br>' % (6 - self.属性2选择)
        temp += '暴击伤害 +%d%%<br>' % (9 - self.属性3选择)
        temp += '百分比力智 +%d%%<br>' % (6 - self.属性4选择)
        return temp        

class 装备189():
    名称 = '融化黑暗之温暖'
    模式 = 0
    所属套装 = '破晓曦光'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '物理/魔法/独立 +'
    属性1范围 = [110, 30, 10]
    属性1选择 = 0
    属性2描述 = '暴击伤害：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '伤害增加：'
    属性3范围 = [11, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.物理攻击力 += 110 - self.属性1选择 * 10
        属性.魔法攻击力 += 110 - self.属性1选择 * 10
        属性.独立攻击力 += 110 - self.属性1选择 * 10
        属性.伤害增加加成(0.11 - self.属性3选择 / 100)
        属性.暴击伤害加成(0.1 - self.属性2选择 / 100)
        属性.最终伤害加成(0.06)
        属性.技能攻击力加成(0.04 + 0.01 * min(13, 属性.获取强化(self.部位)))
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 1, 48, 1)
        属性.技能恢复加成(15, 30, 0.30)
        pass
    def 其它属性(self, 属性):
        x = int(min(sum(属性.强化等级), 150) / 6)
        属性.物理暴击率 += 0.005 * x
        属性.魔法暴击率 += 0.005 * x
        属性.攻击速度 += 0.008 * x
        属性.移动速度 += 0.008 * x
        属性.释放速度 += 0.012 * x
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +149<br>'
        temp += '智力 +100<br>'
        temp += '最终伤害 +6%<br>'
        temp += '技能攻击力 +' + str(4 + min(13,属性.获取强化(self.部位))) + '%<br>'
        temp += '所有属性强化 +28<br>'
        temp += 'Lv1-48  技能等级+1<br>'
        temp += 'Lv15-30 技能恢复+30%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '物理/魔法/独立 +%d<br>' % (110 - 10 * self.属性1选择)
        temp += '暴击伤害 +%d%%<br>' % (10 - self.属性2选择)
        temp += '伤害增加 +%d%%<br>' % (11 - self.属性3选择)
        return temp           

class 装备190():
    名称 = '伽内什的永恒庇护'
    模式 = 0
    所属套装 = '幸运三角'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '暴击伤害：'
    属性1范围 = [4, 1, 1]
    属性1选择 = 0
    属性2描述 = '百分比力智：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '伤害增加：'
    属性3范围 = [3, 1, 1]
    属性3选择 = 0
    属性4描述 = '百分比三攻：'
    属性4范围 = [8, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.17 - self.属性2选择 / 100)
        属性.百分比三攻加成(0.08 - self.属性4选择 / 100)
        属性.伤害增加加成(0.1 - self.属性3选择 / 100)
        属性.暴击伤害加成(0.11 - self.属性1选择 / 100)
        属性.附加伤害加成(0.07)
        属性.技能攻击力加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.07
        属性.移动速度 += 0.07
        属性.释放速度 += 0.07
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +149<br>'
        temp += '智力 +100<br>'
        temp += '伤害增加 +7%<br>'
        temp += '百分比力智 +7%<br>'
        temp += '暴击伤害 +7%<br>'
        temp += '附加伤害 +7%<br>'
        temp += '技能攻击力 +7%<br>'
        temp += '攻击速度 +7%<br>'
        temp += '移动速度 +7%<br>'
        temp += '释放速度 +7%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '暴击伤害 +%d%%<br>' % (4 - self.属性1选择)
        temp += '百分比力智 +%d%%<br>' % (10 - self.属性2选择)
        temp += '伤害增加 +%d%%<br>' % (3 - self.属性3选择)
        temp += '百分比三攻 +%d%%<br>' % (8 - self.属性4选择)
        return temp
   
class 装备191():
    名称 = '至高之炎-伊弗利特'
    模式 = 0
    所属套装 = '精灵使的权能'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '力量/智力 +'
    属性1范围 = [160, 40, 20]
    属性1选择 = 0
    属性2描述 = '最终伤害：'
    属性2范围 = [12, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比三攻：'
    属性3范围 = [12, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.力量 += 160 - self.属性1选择 * 20
        属性.智力 += 160 - self.属性1选择 * 20
        属性.百分比三攻加成(0.12 - self.属性3选择 / 100)
        属性.附加伤害加成(0.3)
        属性.最终伤害加成(0.12 - self.属性2选择 / 100)
        属性.所有属性强化加成(38)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +149<br>'
        temp += '智力 +100<br>'
        temp += '附加伤害 +30%<br>'
        temp += '所有属性强化 +38<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '力量/智力 +%d<br>' % (160 - 20 * self.属性1选择)
        temp += '最终伤害 +%d%%<br>' % (12 - self.属性2选择)
        temp += '百分比三攻 +%d%%<br>' % (12 - self.属性3选择)
        return temp      

class 装备192():
    名称 = '无尽的探求'
    模式 = 0
    所属套装 = '黑魔法探求者'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '力量/智力 +'
    属性1范围 = [240, 20, 20]
    属性1选择 = 0
    属性2描述 = '附加伤害：'
    属性2范围 = [7, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比三攻：'
    属性3范围 = [12, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.力量 += 240 - self.属性1选择 * 20
        属性.智力 += 240 - self.属性1选择 * 20
        属性.百分比三攻加成(0.12 - self.属性3选择 / 100)
        属性.附加伤害加成(0.07 - self.属性2选择 / 100)
        属性.最终伤害加成(0.28)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +149<br>'
        temp += '智力 +100<br>'
        temp += '最终伤害 +28%<br>'
        temp += '所有属性强化 +40<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '力量/智力 +%d<br>' % (240 - 20 * self.属性1选择)
        temp += '附加伤害 +%d%%<br>' % (7 - self.属性2选择)
        temp += '百分比三攻 +%d%%<br>' % (12 - self.属性3选择)
        return temp     

class 装备193():
    名称 = '时间回溯之针'
    模式 = 0
    所属套装 = '时空旅行者'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '百分比力智：'
    属性1范围 = [4, 1, 1]
    属性1选择 = 0
    属性2描述 = '所有属性强化 +'
    属性2范围 = [20, 12, 4]
    属性2选择 = 0
    属性3描述 = '物理/魔法/独立 +'
    属性3范围 = [100, 10, 10]
    属性3选择 = 0
    属性4描述 = '最终伤害：'
    属性4范围 = [8, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.物理攻击力 += 100 - self.属性3选择 * 10
        属性.魔法攻击力 += 100 - self.属性3选择 * 10
        属性.独立攻击力 += 100 - self.属性3选择 * 10
        属性.百分比力智加成(0.24 - self.属性1选择 / 100)
        属性.最终伤害加成(0.08 - self.属性4选择 / 100)
        属性.技能攻击力加成(0.14)
        属性.所有属性强化加成(20 - self.属性2选择 * 4)
        属性.技能冷却缩减(50, 50, 0.15)
        属性.技能冷却缩减(85, 85, 0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +149<br>'
        temp += '智力 +100<br>'
        temp += '技能攻击力 +14%<br>'
        temp += '百分比力智 +20%<br>'
        temp += 'Lv50 技能CD-15%<br>'
        temp += 'Lv85 技能CD-15%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '百分比力智 +%d%%<br>' % (4 - self.属性1选择)
        temp += '所有属性强化 +%d<br>' % (20 - 4 * self.属性2选择)
        temp += '物理/魔法/独立 +%d<br>' % (100 - 10 * self.属性3选择)
        temp += '最终伤害 +%d%%<br>' % (8 - self.属性4选择)
        return temp     

class 装备194():
    名称 = '响彻天地的咆哮'
    模式 = 0
    所属套装 = '穿透命运的呐喊'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '技能攻击力：'
    属性1范围 = [3, 1, 1]
    属性1选择 = 0
    属性2描述 = '附加伤害：'
    属性2范围 = [4, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比力智：'
    属性3范围 = [7, 1, 1]
    属性3选择 = 0
    属性4描述 = '百分比三攻：'
    属性4范围 = [12, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.07 - self.属性3选择 / 100)
        属性.百分比三攻加成(0.12 - self.属性4选择 / 100)
        属性.伤害增加加成(0.12)
        属性.附加伤害加成(0.04 - self.属性2选择 / 100)
        属性.最终伤害加成(0.23)
        属性.技能攻击力加成(0.03 - self.属性1选择 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.08
        属性.移动速度 += 0.08
        属性.释放速度 += 0.12
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +149<br>'
        temp += '智力 +100<br>'
        temp += '伤害增加 +12%<br>'
        temp += '最终伤害 +23%<br>'
        temp += '攻击速度 +8%<br>'
        temp += '移动速度 +8%<br>'
        temp += '释放速度 +12%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '技能攻击力 +%d%%<br>' % (3 - self.属性1选择)
        temp += '附加伤害 +%d%%<br>' % (4 - self.属性2选择)
        temp += '百分比力智 +%d%%<br>' % (7 - self.属性3选择)
        temp += '百分比三攻 +%d%%<br>' % (12 - self.属性4选择)
        return temp     

class 装备195():
    名称 = '狂乱之逆转宿命'
    模式 = 0
    所属套装 = '狂乱追随者'
    等级 = 100
    品质 = '神话'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 149
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '伤害增加：'
    属性1范围 = [10, 1, 1]
    属性1选择 = 0
    属性2描述 = '所有属性强化 +'
    属性2范围 = [32, 4, 4]
    属性2选择 = 0
    属性3描述 = '暴击伤害：'
    属性3范围 = [12, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.3)
        属性.伤害增加加成(0.1 - self.属性1选择 / 100)
        属性.暴击伤害加成(0.12 - self.属性3选择 / 100)
        属性.技能攻击力加成(0.11)
        属性.所有属性强化加成(32 - self.属性2选择 * 4)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +149<br>'
        temp += '智力 +100<br>'
        temp += '百分比力智 +30%<br>'
        temp += '技能攻击力 +11%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '伤害增加 +%d%%<br>' % (10 - self.属性1选择)
        temp += '所有属性强化 +%d<br>' % (32 - 4 * self.属性2选择)
        temp += '暴击伤害 +%d%%<br>' % (12 - self.属性3选择)
        return temp      

class 装备196():
    名称 = '肯那兹：精神燎原之火'
    模式 = 0
    所属套装 = '上古尘封术士'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.2)
        属性.附加伤害加成(0.12)
        属性.所有属性强化加成(25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '百分比三攻 +20%<br>'
        temp += '附加伤害 +12%<br>'
        temp += '所有属性强化 +25<br>'
        return temp    

class 装备197():
    名称 = '驱散月光之黎明'
    模式 = 0
    所属套装 = '破晓曦光'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.04  + 0.01 * min(13, 属性.获取强化(self.部位)))
        属性.百分比三攻加成(0.06)
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 50, 70, 1)
        属性.技能恢复加成(35, 45, 0.30)   
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '百分比三攻 +6%<br>'
        temp += '百分比力智 +' + str(4 + min(13,属性.获取强化(self.部位))) + '%<br>'
        temp += '所有属性强化 +28<br>'
        temp += 'Lv50-70 技能等级+1<br>'
        temp += 'Lv35-45 技能恢复+30%<br>'
        return temp     

class 装备198():
    名称 = '四叶草之初心'
    模式 = 0
    所属套装 = '幸运三角'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.07)
        属性.百分比三攻加成(0.07)
        属性.伤害增加加成(0.07)
        属性.暴击伤害加成(0.07)
        属性.最终伤害加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '百分比力智 +7%<br>'
        temp += '百分比三攻 +7%<br>'
        temp += '伤害增加 +7%<br>'
        temp += '暴击伤害 +7%<br>'
        temp += '最终伤害 +7%<br>'
        return temp      

class 装备199():
    名称 = '冷焰之冰-温蒂妮'
    模式 = 0
    所属套装 = '精灵使的权能'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(38)
        属性.百分比三攻加成(0.27)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '所有属性强化 +38<br>'
        temp += '百分比三攻 +27%<br>'
        return temp      

class 装备200():
    名称 = '堕落世界树之生命'
    模式 = 0
    所属套装 = '深渊窥视者'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.4)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '百分比力智 +40%<br>'
        return temp    

class 装备201():
    名称 = '引路者的四季项链'
    模式 = 0
    所属套装 = '圣者的黄昏'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.35)
        属性.技能冷却缩减(1, 45, 0.10)
        属性.技能冷却缩减(60, 80, 0.10)
        属性.技能冷却缩减(90, 95, 0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '附加伤害 +35%<br>'
        temp += 'Lv1-45  技能CD-10%<br>'
        temp += 'Lv60-80 技能CD-10%<br>'
        temp += 'Lv90-95 技能CD-10%<br>'
        temp += '移动速度 +10%<br>'
        return temp        

class 装备202():
    名称 = '悲痛者项链'
    模式 = 0
    所属套装 = '坎坷命运'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.1)
        属性.最终伤害加成(0.28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.04
        属性.移动速度 += 0.04
        属性.释放速度 += 0.06
        if 属性.装备检查('地狱边缘'):
            属性.攻击速度 -= 0.01
            属性.移动速度 -= 0.01
            属性.释放速度 -= 0.015
        if 属性.装备检查('悲情者遗物'):
            属性.攻击速度 -= 0.01
            属性.移动速度 -= 0.01
            属性.释放速度 -= 0.015
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '最终伤害 +28%<br>'
        temp += '攻击速度 +4%<br>'
        temp += '移动速度 +4%<br>'
        temp += '释放速度 +6%<br>'
        if 属性.装备检查('地狱边缘'):
            temp += '攻击速度 -1%<br>'
            temp += '移动速度 -1%<br>'
            temp += '释放速度 -1.5%<br>'
        if 属性.装备检查('悲情者遗物'):
            temp += '攻击速度 -1%<br>'
            temp += '移动速度 -1%<br>'
            temp += '释放速度 -1.5%<br>'
        return temp        

class 装备203():
    名称 = '激狂之怒'
    模式 = 0
    所属套装 = '吞噬愤怒'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.3)
        属性.持续伤害 += 0.1
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '百分比三攻 +30%<br>'
        temp += '持续伤害 +10%<br>'
        return temp        

class 装备204():
    名称 = '盖柏：完美的均衡'
    模式 = 0
    所属套装 = '上古尘封术士'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.2)
        属性.附加伤害加成(0.12)
        属性.所有属性强化加成(25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '百分比力智 +20%<br>'
        temp += '附加伤害 +12%<br>'
        temp += '所有属性强化 +25<br>'
        temp += '攻击速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        return temp        

class 装备205():
    名称 = '寂静无言之露珠'
    模式 = 0
    所属套装 = '破晓曦光'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.04  + 0.01 * min(13, 属性.获取强化(self.部位)))
        属性.所有属性强化加成(30)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 75, 85, 1)
        属性.技能恢复加成(60, 80, 0.30) 
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '技能伤害 +' +str(4 + min(13,属性.获取强化(self.部位))) +'<br>'
        temp += '所有属性强化 +30<br>'
        temp += 'Lv75-85 技能等级+1<br>'
        temp += 'Lv60-80 技能恢复+30%<br>'
        return temp        

class 装备206():
    名称 = '红兔之祝福'
    模式 = 0
    所属套装 = '幸运三角'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.07)
        属性.百分比三攻加成(0.07)
        属性.伤害增加加成(0.07)
        属性.暴击伤害加成(0.07)
        属性.最终伤害加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '百分比力智 +7%<br>'
        temp += '百分比三攻 +7%<br>'
        temp += '伤害增加 +7%<br>'
        temp += '暴击伤害 +7%<br>'
        temp += '最终伤害 +7%<br>'
        return temp        

class 装备207():
    名称 = '祝福之风-西尔芙'
    模式 = 0
    所属套装 = '精灵使的权能'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.27)
        属性.所有属性强化加成(38)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.04
        属性.移动速度 += 0.04
        属性.释放速度 += 0.06
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '最终伤害 +27%<br>'
        temp += '所有属性强化 +38<br>'
        temp += '攻击速度 +4%<br>'
        temp += '移动速度 +4%<br>'
        temp += '释放速度 +6%<br>'
        return temp        

class 装备208():
    名称 = '支配黑暗之环'
    模式 = 0
    所属套装 = '地狱求道者'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.4)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '暴击伤害 +40%<br>'
        return temp        

class 装备209():
    名称 = '次元穿越者之印'
    模式 = 0
    所属套装 = '次元旅行者'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.14)
        属性.技能攻击力加成(0.18)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 60, 80, 1)
        pass
    def 其它属性(self, 属性):
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '百分比力智 +14%<br>'
        temp += '技能攻击力 +18%<br>'
        temp += 'Lv60-80 技能等级+1<br>'
        temp += '释放速度 +15%<br>'
        return temp        

class 装备210():
    名称 = '命运的捉弄'
    模式 = 0
    所属套装 = '天命无常'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        if '天命无常[2]' in 属性.套装栏:
            if 属性.天命无常 == 0:
                if 属性.装备检查('命运反抗者'):
                    属性.伤害增加加成(0.12)
                else :
                    属性.伤害增加加成(0.10)
            else:
                if 属性.天命无常 >= 2:
                    属性.伤害增加加成(0.12)
        属性.最终伤害加成(0.06)
        属性.技能攻击力加成(0.19)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '最终伤害 +6%<br>'
        temp += '技能攻击力 +19%<br>'
        if '天命无常[2]' in 属性.套装栏:
            if 属性.天命无常 == 0:
                if 属性.装备检查('命运反抗者'):
                    temp += '伤害增加 +12%<br>'
                else :
                    temp += '伤害增加 +10%<br>'
            else:
                if 属性.天命无常 >= 2:
                    temp += '伤害增加 +12%<br>'
        return temp        

class 装备211():
    名称 = '蓬勃生命的落幕'
    模式 = 0
    所属套装 = '悲剧的残骸'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.27)
        if 属性.悲剧的残骸 == 0:
            if 属性.装备检查('心痛如绞的诀别'):
                属性.附加伤害加成(0.106)
            else:
                属性.附加伤害加成(0.10)
        if 属性.悲剧的残骸 == 1:
            if 属性.装备检查('心痛如绞的诀别'):
                属性.附加伤害加成(0.10)
            else:
                属性.附加伤害加成(0.08)
        if 属性.悲剧的残骸 == 2:
            属性.附加伤害加成(0.10)
        if 属性.悲剧的残骸 == 3:
            属性.附加伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.悲剧的残骸 == 0:
            属性.攻击速度 += 0.021
        if 属性.悲剧的残骸 >= 2:
            属性.攻击速度 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '暴击伤害 +27%<br>'
        if 属性.悲剧的残骸 == 0:
            if 属性.装备检查('心痛如绞的诀别'):
                temp += '附加伤害 +10.6%<br>'
            else:
                temp += '附加伤害 +10%<br>'
            temp += '攻击速度 +2.1%<br>'
        if 属性.悲剧的残骸 == 1:
            if 属性.装备检查('心痛如绞的诀别'):
                temp += '附加伤害 +10%<br>'
            else:
                temp += '附加伤害 +8%<br>'
        if 属性.悲剧的残骸 == 2:
            temp += '附加伤害 +10%<br>'
            temp += '攻击速度 +3%<br>'
        if 属性.悲剧的残骸 == 3:
            temp += '附加伤害 +12%<br>'
            temp += '攻击速度 +3%<br>'
        return temp
#endregion

#region  100SS特殊
class 装备212():
    名称 = '军神的遗书'
    模式 = 0
    所属套装 = '军神的隐秘遗产'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.25)
        属性.附加伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '伤害增加 +25%<br>'
        temp += '附加伤害 +14%<br>'
        temp += '移动速度 +5%<br>'
        return temp        

class 装备213():
    名称 = '末日之刻'
    模式 = 0
    所属套装 = '时间战争的残骸'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.15)
        属性.技能攻击力加成(0.12)
        属性.技能冷却缩减(1, 100, 0.11416)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '百分比力智 +15%<br>'
        temp += '技能攻击力 +12%<br>'
        temp += 'Lv1-100 技能CD-2% * 6<br>'
        return temp          

class 装备214():
    名称 = '高贵之天'
    模式 = 0
    所属套装 = '灵宝：世间真理'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.12)
        属性.技能攻击力加成(0.12)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '最终伤害 +12%<br>'
        temp += '技能攻击力 +12%<br>'
        temp += '所有属性强化 +40<br>'
        temp += '移动速度 +10%<br>'
        return temp        

class 装备215():
    名称 = '能量回流控制者'
    模式 = 0
    所属套装 = '能量主宰'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.16)
        属性.伤害增加加成(0.2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '百分比力智 +16%<br>'
        temp += '伤害增加 +20%<br>'
        temp += '攻击速度 +10%<br>'
        return temp        

class 装备216():
    名称 = '暗黑术士亲笔古书'
    模式 = 0
    所属套装 = '深渊窥视者'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.42)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '百分比三攻 +42%<br>'
        return temp        

class 装备217():
    名称 = '引路者的旅行书'
    模式 = 0
    所属套装 = '圣者的黄昏'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.22)
        属性.所有属性强化加成(64)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '暴击伤害 +22%<br>'
        temp += '所有属性强化 +64<br>'
        temp += '攻击速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        return temp        

class 装备218():
    名称 = '悲情者遗物'
    模式 = 0
    所属套装 = '坎坷命运'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.16)
        属性.百分比三攻加成(0.1)
        属性.伤害增加加成(0.11)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.04
        属性.移动速度 += 0.04
        属性.释放速度 += 0.06
        if 属性.装备检查('地狱边缘'):
            属性.攻击速度 -= 0.01
            属性.移动速度 -= 0.01
            属性.释放速度 -= 0.015
        if 属性.装备检查('悲痛者项链'):
            属性.攻击速度 -= 0.01
            属性.移动速度 -= 0.01
            属性.释放速度 -= 0.015
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '百分比力智 +16%<br>'
        temp += '百分比三攻 +10%<br>'
        temp += '伤害增加 +11%<br>'
        temp += '攻击速度 +4%<br>'
        temp += '移动速度 +4%<br>'
        temp += '释放速度 +6%<br>'
        if 属性.装备检查('地狱边缘'):
            temp += '攻击速度 -1%<br>'
            temp += '移动速度 -1%<br>'
            temp += '释放速度 -1.5%<br>'
        if 属性.装备检查('悲痛者项链'):
            temp += '攻击速度 -1%<br>'
            temp += '移动速度 -1%<br>'
            temp += '释放速度 -1.5%<br>'
        return temp        

class 装备219():
    名称 = '失控之怒'
    模式 = 0
    所属套装 = '吞噬愤怒'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.持续伤害 += 0.1
        属性.最终伤害加成(0.3)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '持续伤害 +10%<br>'
        temp += '最终伤害 +30%<br>'
        return temp        

class 装备220():
    名称 = '军神的庇护宝石'
    模式 = 0
    所属套装 = '军神的隐秘遗产'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.21)
        属性.技能攻击力加成(0.17)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '暴击伤害 +21%<br>'
        temp += '技能攻击力 +17%<br>'
        return temp        

class 装备221():
    名称 = '时之漩涡'
    模式 = 0
    所属套装 = '时间战争的残骸'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.24)
        属性.最终伤害加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '百分比三攻 +24%<br>'
        temp += '最终伤害 +15%<br>'
        return temp        

class 装备222():
    名称 = '智慧之地'
    模式 = 0
    所属套装 = '灵宝：世间真理'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.12)
        属性.最终伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '百分比力智 +12%<br>'
        temp += '最终伤害 +12%<br>'
        temp += '所有属性强化 +40<br>'
        temp += '攻击速度 +10%<br>'
        return temp        

class 装备223():
    名称 = '电光能量支配者'
    模式 = 0
    所属套装 = '能量主宰'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.13)
        属性.技能攻击力加成(0.24)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '最终伤害 +13%<br>'
        temp += '技能攻击力 +24%<br>'
        temp += '释放速度 +15%<br>'
        return temp        

class 装备224():
    名称 = '暗黑术士的精髓'
    模式 = 0
    所属套装 = '黑魔法探求者'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.35)
        属性.技能攻击力加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '暴击伤害 +35%<br>'
        temp += '技能攻击力 +7%<br>'
        return temp        

class 装备225():
    名称 = '被困的时之沙'
    模式 = 0
    所属套装 = '时空旅行者'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.17)
        属性.所有属性强化加成(80)
        属性.技能冷却缩减(1, 45, 0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '百分比力智 +17%<br>'
        temp += '所有属性强化 +80<br>'
        temp += 'Lv1-45 技能CD-10%<br>'
        return temp        

class 装备226():
    名称 = '寂寞的呼喊'
    模式 = 0
    所属套装 = '穿透命运的呐喊'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.23)
        属性.技能攻击力加成(0.13)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '暴击伤害 +23%<br>'
        temp += '技能攻击力 +13%<br>'
        return temp        

class 装备227():
    名称 = '狂乱之天灾降临'
    模式 = 0
    所属套装 = '狂乱追随者'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.2)
        属性.伤害增加加成(0.2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '百分比三攻 +20%<br>'
        temp += '伤害增加 +20%<br>'
        return temp        

class 装备228():
    名称 = '军神的古怪耳环'
    模式 = 0
    所属套装 = '军神的隐秘遗产'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        if 属性.装备检查('军神的遗书'):
            属性.百分比力智加成(0.10)
        属性.百分比三攻加成(0.15)
        属性.最终伤害加成(0.17)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('军神的遗书'):
            属性.移动速度 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '百分比三攻 +15%<br>'
        temp += '最终伤害 +17%<br>'
        if 属性.装备检查('军神的遗书'):
            temp += '百分比力智 +10%<br>'
            temp += '移动速度 +10%<br>'
        return temp        

class 装备229():
    名称 = '时之矛盾'
    模式 = 0
    所属套装 = '时间战争的残骸'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.15)
        属性.暴击伤害加成(0.24)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '伤害增加 +15%<br>'
        temp += '暴击伤害 +24%<br>'
        return temp

class 装备230():
    名称 = '宽容之海'
    模式 = 0
    所属套装 = '灵宝：世间真理'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.16)
        属性.附加伤害加成(0.1)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.移动速度 += 0.05
        属性.释放速度 += 0.225
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '伤害增加 +16%<br>'
        temp += '附加伤害 +10%<br>'
        temp += '所有属性强化 +40<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +5%<br>'
        temp += '释放速度 +22.5%<br>'
        return temp        

class 装备231():
    名称 = '电磁能量传送者'
    模式 = 0
    所属套装 = '能量主宰'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        if 属性.装备检查('能量回流控制者'):
            属性.附加伤害加成(0.1)
        属性.百分比力智加成(0.1)
        属性.百分比三攻加成(0.12)
        pass
    def 进图属性(self, 属性):
        if 属性.装备检查('电光能量支配者'):
            属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '百分比力智 +10%<br>'
        temp += '百分比三攻 +12%<br>'
        if 属性.装备检查('能量回流控制者'):
            temp += '附加伤害 +10%<br>'
        if 属性.装备检查('电光能量支配者'):
            temp += '所有属性强化 +40<br>'
        return temp        

class 装备232():
    名称 = '无尽地狱黑暗之印'
    模式 = 0
    所属套装 = '地狱求道者'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.42)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '最终伤害 +42%<br>'
        return temp        

class 装备233():
    名称 = '次元流星坠'
    模式 = 0
    所属套装 = '次元旅行者'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.1)
        属性.最终伤害加成(0.19)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 50, 50, 1)
        属性.技能等级加成('所有', 85, 85, 1)
        属性.技能等级加成('所有', 100, 100, 1)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '暴击伤害 +10%<br>'
        temp += '最终伤害 +19%<br>'
        temp += 'Lv50  技能等级+1<br>'
        temp += 'Lv85  技能等级+1<br>'
        temp += 'Lv100 技能等级+1<br>'
        temp += '攻击速度 +10%<br>'
        return temp        

class 装备234():
    名称 = '命运挑战者'
    模式 = 0
    所属套装 = '天命无常'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.1)
        属性.暴击伤害加成(0.22)
        if '天命无常[2]' in 属性.套装栏:
            if 属性.天命无常 == 0:
                属性.最终伤害加成(0.05)
            if 属性.天命无常 == 6:
                属性.最终伤害加成(0.30)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '百分比力智 +10%<br>'
        temp += '暴击伤害 +22%<br>'
        if '天命无常[2]' in 属性.套装栏:
            if 属性.天命无常 == 0:
                temp += '最终伤害 +5%<br>'
            if 属性.天命无常 == 6:
                temp += '最终伤害 +30%<br>'
        return temp        

class 装备235():
    名称 = '悲剧人生的归寂'
    模式 = 0
    所属套装 = '悲剧的残骸'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.15)
        属性.暴击伤害加成(0.1)
        if 属性.悲剧的残骸 == 0:
            属性.附加伤害加成(0.10)
        if 属性.悲剧的残骸 == 1:
            属性.附加伤害加成(0.08)
        if 属性.悲剧的残骸 == 2:
            属性.附加伤害加成(0.10)
        if 属性.悲剧的残骸 == 3:
            属性.附加伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.悲剧的残骸 == 0:
            属性.攻击速度 += 0.021
        if 属性.悲剧的残骸 >= 2:
            属性.攻击速度 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '伤害增加 +15%<br>'
        temp += '暴击伤害 +10%<br>'
        if 属性.悲剧的残骸 == 0:
            temp += '附加伤害 +10%<br>'
            temp += '攻击速度 +2.1%<br>'
        if 属性.悲剧的残骸 == 1:
            temp += '附加伤害 +8%<br>'
        if 属性.悲剧的残骸 == 2:
            temp += '附加伤害 +10%<br>'
            temp += '攻击速度 +3%<br>'
        if 属性.悲剧的残骸 == 3:
            temp += '附加伤害 +12%<br>'
            temp += '攻击速度 +3%<br>'
        return temp        

class 装备236():
    名称 = '军神的心之所念'
    模式 = 0
    所属套装 = '军神的隐秘遗产'
    等级 = 100
    品质 = '神话'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '附加伤害：'
    属性1范围 = [4, 1, 1]
    属性1选择 = 0
    属性2描述 = '百分比三攻：'
    属性2范围 = [9, 1, 1]
    属性2选择 = 0
    属性3描述 = '技能攻击力：'
    属性3范围 = [4, 1, 1]
    属性3选择 = 0
    属性4描述 = '最终伤害：'
    属性4范围 = [7, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.24 - self.属性2选择 / 100)
        属性.附加伤害加成(0.04 - self.属性1选择 / 100)
        属性.最终伤害加成(0.24 - self.属性4选择 / 100)
        属性.技能攻击力加成(0.10)
        属性.技能攻击力加成(0.04 - self.属性3选择 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '技能攻击力 +10%<br>'
        temp += '百分比三攻 +15%<br>'
        temp += '最终伤害 +17%<br>'
        temp += '移动速度 +15%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '附加伤害 +%d%%<br>' % (4 -self.属性1选择)
        temp += '百分比三攻 +%d%%<br>' % (9 -self.属性2选择)
        temp += '技能攻击力 +%d%%<br>' % (4 -self.属性3选择)
        temp += '最终伤害 +%d%%<br>' % (7 -self.属性4选择)
        return temp        

class 装备237():
    名称 = '时之魅影'
    模式 = 0
    所属套装 = '时间战争的残骸'
    等级 = 100
    品质 = '神话'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '百分比三攻：'
    属性1范围 = [6, 1, 1]
    属性1选择 = 0
    属性2描述 = '技能攻击力：'
    属性2范围 = [4, 1, 1]
    属性2选择 = 0
    属性3描述 = '附加伤害：'
    属性3范围 = [8, 1, 1]
    属性3选择 = 0
    属性4描述 = '百分比力智：'
    属性4范围 = [5, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.05 - self.属性4选择 / 100)
        属性.百分比三攻加成(0.06 - self.属性1选择 / 100)
        属性.伤害增加加成(0.15)
        属性.暴击伤害加成(0.24)
        属性.附加伤害加成(0.08 - self.属性3选择 / 100)
        属性.技能攻击力加成(0.04 - self.属性2选择 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '伤害增加 +15%<br>'
        temp += '暴击伤害 +24%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '百分比三攻 +%d%%<br>' % (6 -self.属性1选择)
        temp += '技能攻击力 +%d%%<br>' % (4 -self.属性2选择)
        temp += '附加伤害 +%d%%<br>' % (8 -self.属性3选择)
        temp += '百分比力智 +%d%%<br>' % (5 -self.属性4选择)
        return temp        

class 装备238():
    名称 = '永恒之海'
    模式 = 0
    所属套装 = '灵宝：世间真理'
    等级 = 100
    品质 = '神话'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '所有属性强化 +'
    属性1范围 = [40, 20, 4]
    属性1选择 = 0
    属性2描述 = '最终伤害：'
    属性2范围 = [8, 1, 1]
    属性2选择 = 0
    属性3描述 = '百分比力智：'
    属性3范围 = [5, 1, 1]
    属性3选择 = 0
    属性4描述 = '伤害增加：'
    属性4范围 = [4, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.05 - self.属性3选择 / 100)
        属性.伤害增加加成(0.2 - self.属性4选择 / 100)
        属性.附加伤害加成(0.1)
        属性.最终伤害加成(0.08 - self.属性2选择 / 100)
        属性.所有属性强化加成(40 - self.属性1选择 * 4)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        属性.释放速度 += 0.375
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '附加伤害 +10%<br>'
        temp += '伤害增加 +16%<br>'
        temp += '所有属性强化 +40<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        temp += '释放速度 +37.5%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '所有属性强化 +%d<br>' % (40 -4*self.属性1选择)
        temp += '最终伤害 +%d%%<br>' % (8 -self.属性2选择)
        temp += '百分比力智 +%d%%<br>' % (5 -self.属性3选择)
        temp += '伤害增加 +%d%%<br>' % (4 -self.属性4选择)
        return temp        

class 装备239():
    名称 = '等离子操控者'
    模式 = 0
    所属套装 = '能量主宰'
    等级 = 100
    品质 = '神话'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '伤害增加：'
    属性1范围 = [12, 1, 1]
    属性1选择 = 0
    属性2描述 = '力量/智力 +'
    属性2范围 = [220, 100, 20]
    属性2选择 = 0
    属性3描述 = '附加伤害：'
    属性3范围 = [12, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.力量 += 220 - self.属性2选择 * 20
        属性.智力 += 220 - self.属性2选择 * 20
        属性.百分比力智加成(0.1)
        属性.百分比三攻加成(0.12)
        if 属性.装备检查('能量回流控制者'):
            属性.附加伤害加成(0.1)
        属性.伤害增加加成(0.12 - self.属性1选择 / 100)
        属性.附加伤害加成(0.12 - self.属性3选择 / 100)
        pass
    def 进图属性(self, 属性):
        if 属性.装备检查('电光能量支配者'):
            属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('能量回流控制者'):
            属性.移动速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '百分比力智 +10%<br>'
        temp += '百分比三攻 +12%<br>'
        if 属性.装备检查('能量回流控制者'):
            temp += '附加伤害 +10%<br>'
            temp += '移动速度 +10%<br>'
        if 属性.装备检查('电光能量支配者'):
            temp += '所有属性强化 +40<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '伤害增加 +%d%%<br>' % (12 -self.属性1选择)
        temp += '力量/智力 +%d<br>' % (220 -20*self.属性2选择)
        temp += '附加伤害 +%d%%<br>' % (12 -self.属性3选择)
        return temp        

class 装备240():
    名称 = '永恒地狱黑暗之印'
    模式 = 0
    所属套装 = '地狱求道者'
    等级 = 100
    品质 = '神话'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '最终伤害：'
    属性1范围 = [12, 1, 1]
    属性1选择 = 0
    属性2描述 = '所有属性强化 +'
    属性2范围 = [40, 8, 4]
    属性2选择 = 0
    属性3描述 = '附加伤害：'
    属性3范围 = [9, 1, 1]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.09  - self.属性3选择 / 100)
        属性.最终伤害加成(0.12 - self.属性1选择 / 100)
        属性.所有属性强化加成(40 - self.属性2选择 * 4)
        属性.最终伤害加成(0.42)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '最终伤害 +42%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '最终伤害 +%d%%<br>' % (12 -self.属性1选择)
        temp += '所有属性强化 +%d<br>' % (40 -4*self.属性2选择)
        temp += '附加伤害 +%d%%<br>' % (9 -self.属性3选择)
        return temp        

class 装备241():
    名称 = '次元穿越者之星'
    模式 = 0
    所属套装 = '次元旅行者'
    等级 = 100
    品质 = '神话'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '力量/智力 +'
    属性1范围 = [300, 20, 20]
    属性1选择 = 0
    属性2描述 = '暴击伤害：'
    属性2范围 = [11, 1, 1]
    属性2选择 = 0
    属性3描述 = '技能等级Lv60 -'
    属性3范围 = [100, 70, 5]
    属性3选择 = 0
    属性4描述 = '无'
    属性4范围 = []
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.力量 += 300 - self.属性1选择 * 20
        属性.智力 += 300 - self.属性1选择 * 20
        属性.暴击伤害加成(0.21 - self.属性2选择 / 100)
        属性.最终伤害加成(0.19)
        属性.技能等级加成('所有', 60, 100 - self.属性3选择 * 5, 1)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 50, 50, 1)
        属性.技能等级加成('所有', 85, 85, 1)
        属性.技能等级加成('所有', 100, 100, 1)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '最终伤害 +19%<br>'
        temp += '暴击伤害 +10%<br>'
        temp += 'Lv50  技能等级+1<br>'
        temp += 'Lv85  技能等级+1<br>'
        temp += 'Lv100 技能等级+1<br>'
        temp += '攻击速度 +15%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '力量/智力 +%d<br>' % (300 -20*self.属性1选择)
        temp += '暴击伤害 +%d%%<br>' % (11 -self.属性2选择)
        temp += 'Lv60-%d 技能等级+1<br>' % (100 -5*self.属性3选择)
        return temp        

class 装备242():
    名称 = '命运反抗者'
    模式 = 0
    所属套装 = '天命无常'
    等级 = 100
    品质 = '神话'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '物攻/魔攻/独立 +'
    属性1范围 = [120, 40, 10]
    属性1选择 = 0
    属性2描述 = '技能等级Lv25 -'
    属性2范围 = [45, 30, 5]
    属性2选择 = 0
    属性3描述 = '百分比力智：'
    属性3范围 = [4, 1, 1]
    属性3选择 = 0
    属性4描述 = '附加伤害：'
    属性4范围 = [7, 1, 1]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.物理攻击力 += 120 - self.属性1选择 * 10
        属性.魔法攻击力 += 120 - self.属性1选择 * 10
        属性.独立攻击力 += 120 - self.属性1选择 * 10
        属性.百分比力智加成(0.14 - self.属性3选择 / 100)
        属性.暴击伤害加成(0.22)
        属性.附加伤害加成(0.07 - self.属性4选择 / 100)
        if '天命无常[2]' in 属性.套装栏:
            if 属性.天命无常 == 0:
                属性.最终伤害加成(0.06)
            if 属性.天命无常 == 6:
                属性.最终伤害加成(0.30)
        属性.技能等级加成('所有', 25, 45 - self.属性2选择 * 5, 1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '暴击伤害 +22%<br>'
        temp += '百分比力智 +10%<br>'
        if '天命无常[2]' in 属性.套装栏:
            if 属性.天命无常 == 0:
                temp += '最终伤害 +6%<br>'
            if 属性.天命无常 == 6:
                temp += '最终伤害 +30%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '物攻/魔攻/独立 +%d<br>' % (120 - self.属性1选择 * 10)
        temp += 'Lv25-%d 技能等级+1<br>' % (45 -5*self.属性2选择)
        temp += '百分比力智 +%d%%<br>' % (4 -self.属性3选择)
        temp += '附加伤害 +%d%%<br>' % (7 -self.属性4选择)        
        return temp        

class 装备243():
    名称 = '心痛如绞的诀别'
    模式 = 0
    所属套装 = '悲剧的残骸'
    等级 = 100
    品质 = '神话'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0

    属性1描述 = '所有属性强化 +'
    属性1范围 = [16, 8, 4]
    属性1选择 = 0
    属性2描述 = '持续伤害：'
    属性2范围 = [10, 1, 1]
    属性2选择 = 0
    属性3描述 = '暴击伤害：'
    属性3范围 = [8, 1, 1]
    属性3选择 = 0
    属性4描述 = '力量/智力 +'
    属性4范围 = [140, 80, 20]
    属性4选择 = 0

    def 城镇属性(self, 属性):
        属性.力量 += 140 - self.属性4选择 * 20
        属性.智力 += 140 - self.属性4选择 * 20
        属性.伤害增加加成(0.15)
        属性.暴击伤害加成(0.18 - self.属性3选择 / 100)
        属性.持续伤害 += 0.1 - self.属性2选择 / 100
        属性.所有属性强化加成(16 - self.属性1选择 * 4)
        if 属性.悲剧的残骸 == 0:
            属性.附加伤害加成(0.106)
        if 属性.悲剧的残骸 == 1:
            属性.附加伤害加成(0.10)
        if 属性.悲剧的残骸 == 2:
            属性.附加伤害加成(0.10)
        if 属性.悲剧的残骸 == 3:
            属性.附加伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.悲剧的残骸 == 0:
            属性.移动速度 += 0.0315
        if 属性.悲剧的残骸 >= 2:
            属性.移动速度 += 0.045
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        temp += '伤害增加 +15%<br>'
        temp += '暴击伤害 +10%<br>'
        if 属性.悲剧的残骸 == 0:
            temp += '附加伤害 +10.6%<br>'
            temp += '移动速度 +3.15%<br>'
        if 属性.悲剧的残骸 == 1:
            temp += '附加伤害 +10%<br>'
        if 属性.悲剧的残骸 == 2:
            temp += '附加伤害 +10%<br>'
            temp += '移动速度 +4.5%<br>'
        if 属性.悲剧的残骸 == 3:
            temp += '附加伤害 +12%<br>'
            temp += '移动速度 +4.5%<br>'
        temp += '<font color="#00A2E8">神话属性：</font><br>'
        temp += '所有属性强化 +%d<br>' % (16 -4*self.属性1选择)
        temp += '持续伤害 +%d%%<br>' % (10 -self.属性2选择)
        temp += '暴击伤害 +%d%%<br>' % (8 -self.属性3选择)
        temp += '力量/智力 +%d<br>' % (140 - self.属性4选择 * 20)
        return temp
#endregion

#region  智慧产物
class 装备244():
    名称 = '完美掌控'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        if 属性.获取改造(self.部位) >= 5:
            for i in range(20):
                属性.技能攻击力加成(0.01)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 1, 85, 1)
        属性.技能等级加成('所有', 100, 100, 1)
        属性.所有属性强化加成(20 * 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        if 属性.获取改造(self.部位) >= 5:
            属性.攻击速度 += 0.15
            属性.移动速度 += 0.15
            属性.释放速度 += 0.225
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += 'Lv1-85 技能等级+1<br>'
        temp += 'Lv100  技能等级+1<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '所有属性强化 +%d x 20<br>' % (改造等级)
        if 改造等级 >= 5:
            temp += '技能攻击力 +1% x 20 <br>'
            temp += '攻击速度 +15%<br>'
            temp += '移动速度 +15%<br>'
            temp += '释放速度 +22.5%<br>'
        return temp        

class 装备245():
    名称 = '噙毒手套'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        if 属性.获取改造(self.部位) >= 1:
            属性.暴击伤害加成(0.33)
        if 属性.获取改造(self.部位) >= 4:
            属性.技能攻击力加成(0.10)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(8 * 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.08
        属性.魔法暴击率 += 0.08
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '物理暴击率 +8%<br>'
        temp += '魔法暴击率 +8%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '所有属性强化 +%d<br>' % (8 * 改造等级)
        if 改造等级 >= 1:
            temp += '暴击伤害 +33%<br>'
        if 改造等级 >= 4:
            temp += '技能攻击力 +10%<br>'
        return temp        

class 装备246():
    名称 = '先知者的预言'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            属性.百分比力智加成(0.18)
        if 属性.获取改造(self.部位) >= 4:
            if 属性.先知者的预言 == 0:
                属性.属性附加加成(0.05 * 0.35)
                属性.技能攻击力加成(0 + (0.10 * 0.35 + 0.15 * 0.3))
            if 属性.先知者的预言 == 1:
                属性.属性附加加成(0.05)
            if 属性.先知者的预言 == 2:
                属性.技能攻击力加成(0.10)
            if 属性.先知者的预言 == 3:
                属性.技能攻击力加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.移动速度 += 0.1
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '伤害增加 +%d%%<br>' % (4*改造等级)
        if 改造等级 >= 1:
            temp += '百分比力智 +18%<br>'
        if 改造等级 >= 4:
            if 属性.先知者的预言 == 0:
                temp += '属性附加 +{:.2f}%<br>'.format(0.05 * 0.35 * 100, 3)
                temp += '技能攻击力 +{:.2f}%<br>'.format((0.10 * 0.35 + 0.15 * 0.3)* 100)
            if 属性.先知者的预言 == 1:
                temp += '属性附加 +5%<br>'
            if 属性.先知者的预言 == 2:
                temp += '技能攻击力 +10%<br>'
            if 属性.先知者的预言 == 3:
                temp += '技能攻击力 +15%<br>'
        return temp

class 装备247():
    名称 = '骸麒之戒'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 171
    智力 = 171
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        if 属性.获取改造(self.部位) >= 5:
            属性.附加伤害加成(0.58)
        if 属性.获取改造(self.部位) >= 1 and 属性.获取改造(self.部位) < 5:
            属性.附加伤害加成(0.40)
        pass
    def 进图属性(self, 属性):
        属性.力量 += 30 * 属性.获取改造(self.部位)
        属性.智力 += 30 * 属性.获取改造(self.部位)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +171<br>'
        temp += '智力 +171<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '力量 +{}<br>'.format(30 * 改造等级)
            temp += '智力 +{}<br>'.format(30 * 改造等级)
        if 改造等级 >= 5:
            temp += '附加伤害 +58%<br>'
        if 改造等级>= 1 and 改造等级 < 5:
            temp += '附加伤害 +40%<br>'
        return temp        

class 装备248():
    名称 = '窥视未来耳环'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        if 属性.获取改造(self.部位) >= 1:
            属性.伤害增加加成(0.40)
        if 属性.获取改造(self.部位) >= 5:
            属性.所有属性强化加成(40) 
    def 进图属性(self, 属性):
        属性.物理攻击力 +=  40 * 属性.获取改造(self.部位)
        属性.魔法攻击力 +=  40 * 属性.获取改造(self.部位)
        属性.独立攻击力 +=  40 * 属性.获取改造(self.部位)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
        if 改造等级 >= 1:
            temp += '伤害增加 +40%<br>'
        if 改造等级 >= 5:
            temp += '所有属性强化 +40<br>'
        temp += '物理攻击力 +{}<br>'.format(40 * 改造等级)
        temp += '魔法攻击力 +{}<br>'.format(40 * 改造等级)
        temp += '独立攻击力 +{}<br>'.format(40 * 改造等级)
        return temp        

class 装备249():
    名称 = '青面修罗的面具'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        if 属性.获取改造(self.部位) >= 1:
            属性.技能等级加成('所有', 1, 85, 2)
            属性.技能等级加成('所有', 100, 100, 2)
        if 属性.获取改造(self.部位) >= 4:
            属性.百分比力智加成(0.13)
        属性.所有属性强化加成(8 * 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.08
        属性.移动速度 += 0.08
        属性.释放速度 += 0.12
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '攻击速度 +8%<br>'
        temp += '移动速度 +8%<br>'
        temp += '释放速度 +12%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '所有属性强化 +{}<br>'.format(8 * 改造等级)
        if 改造等级 >= 1:
            temp += 'Lv1-85 技能等级+2<br>'
            temp += 'Lv100  技能等级+2<br>'
        if 改造等级 >= 4:
            temp += '百分比力智 +13%<br>'
        return temp        

class 装备250():
    名称 = '赤鬼的次元石'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            属性.百分比三攻加成(0.18)
        if 属性.获取改造(self.部位) >= 4:
            属性.伤害增加加成(0.14)
        if 属性.装备检查('青面修罗的面具') or 属性.装备检查('噙毒手套'):
            属性.附加伤害加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        if 属性.装备检查('青面修罗的面具') or 属性.装备检查('噙毒手套'):
            temp += '附加伤害 +7%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '暴击伤害 +{}%<br>'.format(4*改造等级)
        if 改造等级 >= 1:
            temp += '百分比三攻 +18%<br>'
        if 改造等级 >= 4:
            temp += '伤害增加 +14%<br>'
        return temp        

class 飘零之花武器():
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '武器'
    物攻成长 = 0
    魔攻成长 = 0
    独立成长 = 115
    力智成长 = 20
    def 城镇属性(self, 属性):
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 5:
            属性.技能攻击力加成(0.35)
            属性.附加伤害加成(0.50)
            属性.百分比力智加成(0.20)
        属性.物理攻击力 += self.物攻成长 * 改造等级
        属性.魔法攻击力 += self.魔攻成长 * 改造等级
        属性.独立攻击力 += self.独立成长 * 改造等级
        属性.力量 += self.力智成长 * 改造等级
        属性.智力 += self.力智成长 * 改造等级
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if self.力量 != 0:
            temp += '力量 +' + str(self.力量) + '<br>'
        if self.智力 != 0:
            temp += '智力 +' + str(self.智力) + '<br>'
        temp += '物理攻击力 +' + str(self.物理攻击力) + '<br>'
        temp += '魔法攻击力 +' + str(self.魔法攻击力) + '<br>'
        temp += '独立攻击力 +' + str(self.独立攻击力) + '<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 >= 5:
            temp += '技能攻击力 +35%<br>'
            temp += '附加伤害 +50%<br>'
            temp += '百分比力智 +20%<br>'
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '力量 +' + str(self.力智成长 * 改造等级) + '<br>'
            temp += '智力 +' + str(self.力智成长 * 改造等级) + '<br>'
            temp += '物理攻击力 +' + str(self.物攻成长 * 改造等级) + '<br>'
            temp += '魔法攻击力 +' + str(self.魔攻成长 * 改造等级) + '<br>'
            temp += '独立攻击力 +' + str(self.独立成长 * 改造等级) + '<br>'
        return temp        

class 装备251(飘零之花武器):
    名称 = '飘零之花手炮'
    类型 = '手炮'
    力量 = 122
    智力 = 0
    物理攻击力 = 1346
    魔法攻击力 = 768
    独立攻击力 = 711
    物攻成长 = 188
    魔攻成长 = 181

class 装备252():
    名称 = '无念之仪服'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.伤害增加加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            属性.技能等级加成('所有', 50, 50, 2)
            属性.技能等级加成('所有', 85, 85, 2)
            属性.技能等级加成('所有', 100, 100, 2)
            属性.属性附加加成(0.04)
        if 属性.获取改造(self.部位) >= 5:
            属性.伤害增加加成(0.10)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.12
        属性.移动速度 += 0.12
        属性.释放速度 += 0.18
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '攻击速度 +12%<br>'
        temp += '移动速度 +12%<br>'
        temp += '释放速度 +18%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '伤害增加 +{}%<br>'.format(4 * 改造等级)
        if 改造等级 >= 1:
            temp += 'Lv50  技能等级+2<br>'
            temp += 'Lv85  技能等级+2<br>'
            temp += 'Lv100 技能等级+2<br>'
            temp += '属性附加 +4%<br>'
        if 改造等级 >= 5:
            temp += '伤害增加 +10%<br>'
        return temp        

class 装备253():
    名称 = '无欲之花'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':100, '皮甲':139, '轻甲':146, '重甲':143, '板甲':139}
    智力 = {'布甲':146, '皮甲':139, '轻甲':131, '重甲':131, '板甲':139}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.0 + 0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            属性.技能倍率加成(50, 0.30)
            属性.技能倍率加成(85, 0.25)
            属性.技能倍率加成(100, 0.16)
            属性.伤害增加加成(0.07)
        if 属性.获取改造(self.部位) >= 5:
            属性.技能攻击力加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 +=0.05
        属性.魔法暴击率 +=0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '技能攻击力 +{}%<br>'.format(4*改造等级)
        if 改造等级 >= 1:
            temp += 'Lv50 技能攻击力+30%<br>'
            temp += 'Lv85 技能攻击力+25%<br>'
            temp += 'Lv100 (主动)技能攻击力+16%<br>'
            temp += '伤害增加 +7%<br>'
        if 改造等级 >= 5:
            temp += '技能攻击力 +12%<br>'
        return temp        

class 装备254():
    名称 = '无形之气韵'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.暴击伤害加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            属性.暴击伤害加成(0.05)
            属性.所有属性强化加成(30)
            属性.技能等级加成('所有',50,85,1)
            属性.技能等级加成('所有',100,100,1)
        if 属性.获取改造(self.部位) >= 5:
            属性.暴击伤害加成(0.10)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '暴击伤害 +{}%<br>'.format(4 * 改造等级)
        if 改造等级 >= 1:
            temp += '暴击伤害 +5%<br>'
            temp += '所有属性强化 +30<br>'
            temp += 'Lv50-85 技能等级+1<br>'
            temp += 'Lv100   技能等级+1<br>'
        if 改造等级 >= 5:
            temp += '暴击伤害 +10%<br>'
        return temp        

class 装备255():
    名称 = '无言之罪恶'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            属性.百分比力智加成(0.22)
        if 属性.获取改造(self.部位) >= 5:
            属性.最终伤害加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 +=0.20
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '移动速度 +20%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '最终伤害 +{}%<br>'.format(4 *改造等级)
        if 改造等级 >= 1:
            temp += '百分比力智 +22%<br>'
        if 改造等级 >= 5:
            temp += '最终伤害 +10%<br>'
        return temp        

class 装备256():
    名称 = '无我之轮回'
    模式 = 0
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':100, '皮甲':130, '轻甲':135, '重甲':132, '板甲':130}
    智力 = {'布甲':135, '皮甲':130, '轻甲':123, '重甲':123, '板甲':130}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.04 * 属性.获取改造(self.部位))
        if 属性.获取改造(self.部位) >= 1:
            属性.最终伤害加成(0.10)
            属性.百分比三攻加成(0.11)
        if 属性.获取改造(self.部位) >= 5:
            属性.附加伤害加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.移动速度 += 0.05
        属性.释放速度 += 0.075
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +5%<br>'
        temp += '释放速度 +7.5%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '百分比三攻 +{}%<br>'.format(4 *改造等级)
        if 改造等级 >= 1:
            temp += '最终伤害 +10%<br>'
            temp += '百分比三攻 +11%<br>'
        if 改造等级 >= 5:
            temp += '附加伤害 +10%<br>'
        return temp        
   
class 装备257(飘零之花武器):
    名称 = '飘零之花巨剑'
    类型 = '巨剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1375
    魔法攻击力 = 1005
    独立攻击力 = 711
    物攻成长 = 190
    魔攻成长 = 185

class 装备258(飘零之花武器):
    名称 = '飘零之花手弩'
    类型 = '手弩'
    力量 = 81
    智力 = 41
    物理攻击力 = 942
    魔法攻击力 = 1057
    独立攻击力 = 711
    物攻成长 = 183
    魔攻成长 = 184


class 装备259(飘零之花武器):
    名称 = '飘零之花步枪'
    类型 = '步枪'
    力量 = 81
    智力 = 122
    物理攻击力 = 1231
    魔法攻击力 = 1057
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 184

class 装备260(飘零之花武器):
    名称 = '飘零之花十字架'
    类型 = '十字架'
    力量 = 0
    智力 = 81
    物理攻击力 = 1129
    魔法攻击力 = 1067
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 186

class 装备261(飘零之花武器):
    名称 = '飘零之花短剑'
    类型 = '短剑'
    力量 = 0
    智力 = 81
    物理攻击力 = 1067
    魔法攻击力 = 1313
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 189

class 装备262(飘零之花武器):
    名称 = '飘零之花钝器'
    类型 = '钝器'
    力量 = 122
    智力 = 0
    物理攻击力 = 1252
    魔法攻击力 = 1067
    独立攻击力 = 711
    物攻成长 = 188
    魔攻成长 = 186

class 装备263(飘零之花武器):
    名称 = '飘零之花法杖'
    类型 = '法杖'
    力量 = 0
    智力 = 81
    物理攻击力 = 1067
    魔法攻击力 = 1375
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 190

class 装备264(飘零之花武器):
    名称 = '飘零之花光剑'
    类型 = '光剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1043
    魔法攻击力 = 1005
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 185

class 装备265(飘零之花武器):
    名称 = '飘零之花棍棒'
    类型 = '棍棒'
    力量 = 81
    智力 = 81
    物理攻击力 = 1228
    魔法攻击力 = 1005
    独立攻击力 = 711
    物攻成长 = 188
    魔攻成长 = 185
    def 城镇属性(self, 属性):
        super().城镇属性(属性)
        if 属性.职业 == '战斗法师':
            属性.魔法攻击力 += (self.物攻成长 - self.魔攻成长)* 属性.获取改造(self.部位)
        pass     

class 装备266(飘零之花武器):
    名称 = '飘零之花矛'
    类型 = '矛'
    力量 = 122
    智力 = 0
    物理攻击力 = 1375
    魔法攻击力 = 945
    独立攻击力 = 711
    物攻成长 = 190
    魔攻成长 = 184
    def 城镇属性(self, 属性):
        super().城镇属性(属性)
        if 属性.职业 == '战斗法师':
            属性.魔法攻击力 += (self.物攻成长 - self.魔攻成长)* 属性.获取改造(self.部位)
        pass       

class 装备267(飘零之花武器):
    名称 = '飘零之花魔杖'
    类型 = '魔杖'
    力量 = 0
    智力 = 122
    物理攻击力 = 1005
    魔法攻击力 = 1252
    独立攻击力 = 711
    物攻成长 = 185
    魔攻成长 = 188

class 装备268(飘零之花武器):
    名称 = '飘零之花拳套'
    类型 = '拳套'
    力量 = 81
    智力 = 0
    物理攻击力 = 1190
    魔法攻击力 = 1067
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 186

class 装备269(飘零之花武器):
    名称 = '飘零之花扫把'
    类型 = '扫把'
    力量 = 0
    智力 = 81
    物理攻击力 = 1129
    魔法攻击力 = 1252
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 188

class 装备270(飘零之花武器):
    名称 = '飘零之花手套'
    类型 = '手套'
    力量 = 0
    智力 = 81
    物理攻击力 = 1067
    魔法攻击力 = 1313
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 189

class 装备271(飘零之花武器):
    名称 = '飘零之花太刀'
    类型 = '太刀'
    力量 = 81
    智力 = 122
    物理攻击力 = 1067
    魔法攻击力 = 1190
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 187
    def 城镇属性(self, 属性):
        super().城镇属性(属性)
        if 属性.职业 == '剑影':
            属性.物理攻击力 += (self.魔攻成长 - self.物攻成长)* 属性.获取改造(self.部位)
        pass    

class 装备272(飘零之花武器):
    名称 = '飘零之花爪'
    类型 = '爪'
    力量 = 81
    智力 = 41
    物理攻击力 = 1129
    魔法攻击力 = 1129
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 187    

class 装备273(飘零之花武器):
    名称 = '飘零之花左轮枪'
    类型 = '左轮枪'
    力量 = 81
    智力 = 0
    物理攻击力 = 1137
    魔法攻击力 = 942
    独立攻击力 = 711
    物攻成长 = 185
    魔攻成长 = 183
#endregion

#region  夜语黑瞳武器
class 夜语黑瞳武器():
    模式 = 普雷武器显示
    所属套装 = '无'
    等级 = 95
    品质 = '史诗'
    部位 = '武器'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.32)
        属性.技能攻击力加成(0.55)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if self.力量 != 0:
            temp += '力量 +' + str(self.力量) + '<br>'
        if self.智力 != 0:
            temp += '智力 +' + str(self.智力) + '<br>'
        temp += '物理攻击力 +' + str(self.物理攻击力) + '<br>'
        temp += '魔法攻击力 +' + str(self.魔法攻击力) + '<br>'
        temp += '独立攻击力 +' + str(self.独立攻击力) + '<br>'
        temp += '技能攻击力 +55%<br>'
        temp += '最终伤害 +32%<br>'
        return temp      

class 装备274(夜语黑瞳武器):
    名称 = '界·夜语黑瞳短剑'
    类型 = '短剑'
    力量 = 0
    智力 = 78
    物理攻击力 = 1112
    魔法攻击力 = 1346
    独立攻击力 = 723

class 装备275(夜语黑瞳武器):
    名称 = '界·夜语黑瞳太刀'
    类型 = '太刀'
    力量 = 78
    智力 = 117
    物理攻击力 = 1112
    魔法攻击力 = 1230
    独立攻击力 = 723

class 装备276(夜语黑瞳武器):
    名称 = '界·夜语黑瞳钝器'
    类型 = '钝器'
    力量 = 117
    智力 = 0
    物理攻击力 = 1288
    魔法攻击力 = 1112
    独立攻击力 = 723

class 装备277(夜语黑瞳武器):
    名称 = '界·夜语黑瞳巨剑'
    类型 = '巨剑'
    力量 = 78
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备278(夜语黑瞳武器):
    名称 = '界·夜语黑瞳光剑'
    类型 = '光剑'
    力量 = 78
    智力 = 0
    物理攻击力 = 1089
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备279(夜语黑瞳武器):
    名称 = '界·夜语黑瞳手套'
    类型 = '手套'
    力量 = 0
    智力 = 78
    物理攻击力 = 1112
    魔法攻击力 = 1346
    独立攻击力 = 723

class 装备280(夜语黑瞳武器):
    名称 = '界·夜语黑瞳臂铠'
    类型 = '臂铠'
    力量 = 117
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备281(夜语黑瞳武器):
    名称 = '界·夜语黑瞳利爪'
    类型 = '爪'
    力量 = 78
    智力 = 39
    物理攻击力 = 1172
    魔法攻击力 = 1172
    独立攻击力 = 723

class 装备282(夜语黑瞳武器):
    名称 = '界·夜语黑瞳拳套'
    类型 = '拳套'
    力量 = 78
    智力 = 0
    物理攻击力 = 1230
    魔法攻击力 = 1112
    独立攻击力 = 723

class 装备283(夜语黑瞳武器):
    名称 = '界·夜语黑瞳东方棍'
    类型 = '东方棍'
    力量 = 78
    智力 = 117
    物理攻击力 = 1112
    魔法攻击力 = 1172
    独立攻击力 = 723

class 装备284(夜语黑瞳武器):
    名称 = '界·夜语黑瞳左轮枪'
    类型 = '左轮枪'
    力量 = 78
    智力 = 0
    物理攻击力 = 1176
    魔法攻击力 = 989
    独立攻击力 = 723

class 装备285(夜语黑瞳武器):
    名称 = '界·夜语黑瞳自动手枪'
    类型 = '自动手枪'
    力量 = 0
    智力 = 78
    物理攻击力 = 825
    魔法攻击力 = 1209
    独立攻击力 = 723

class 装备286(夜语黑瞳武器):
    名称 = '界·夜语黑瞳步枪'
    类型 = '步枪'
    力量 = 78
    智力 = 117
    物理攻击力 = 1264
    魔法攻击力 = 1099
    独立攻击力 = 723

class 装备287(夜语黑瞳武器):
    名称 = '界·夜语黑瞳手炮'
    类型 = '手炮'
    力量 = 117
    智力 = 0
    物理攻击力 = 1374
    魔法攻击力 = 825
    独立攻击力 = 723

class 装备288(夜语黑瞳武器):
    名称 = '界·夜语黑瞳手弩'
    类型 = '手弩'
    力量 = 78
    智力 = 39
    物理攻击力 = 989
    魔法攻击力 = 1099
    独立攻击力 = 723

class 装备289(夜语黑瞳武器):
    名称 = '界·夜语黑瞳矛'
    类型 = '矛'
    力量 = 117
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 996
    独立攻击力 = 723

class 装备290(夜语黑瞳武器):
    名称 = '界·夜语黑瞳棍棒'
    类型 = '棍棒'
    力量 = 78
    智力 = 78
    物理攻击力 = 1265
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备291(夜语黑瞳武器):
    名称 = '界·夜语黑瞳魔杖'
    类型 = '魔杖'
    力量 = 0
    智力 = 117
    物理攻击力 = 1054
    魔法攻击力 = 1288
    独立攻击力 = 723

class 装备292(夜语黑瞳武器):
    名称 = '界·夜语黑瞳法杖'
    类型 = '法杖'
    力量 = 0
    智力 = 78
    物理攻击力 = 1112
    魔法攻击力 = 1406
    独立攻击力 = 723

class 装备293(夜语黑瞳武器):
    名称 = '界·夜语黑瞳扫把'
    类型 = '扫把'
    力量 = 0
    智力 = 78
    物理攻击力 = 1172
    魔法攻击力 = 1288
    独立攻击力 = 723

class 装备294(夜语黑瞳武器):
    名称 = '界·夜语黑瞳十字架'
    类型 = '十字架'
    力量 = 0
    智力 = 78
    物理攻击力 = 1172
    魔法攻击力 = 1112
    独立攻击力 = 723

class 装备295(夜语黑瞳武器):
    名称 = '界·夜语黑瞳念珠'
    类型 = '念珠'
    力量 = 0
    智力 = 117
    物理攻击力 = 1054
    魔法攻击力 = 1346
    独立攻击力 = 723

class 装备296(夜语黑瞳武器):
    名称 = '界·夜语黑瞳图腾'
    类型 = '图腾'
    力量 = 117
    智力 = 0
    物理攻击力 = 1230
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备297(夜语黑瞳武器):
    名称 = '界·夜语黑瞳镰刀'
    类型 = '镰刀'
    力量 = 78
    智力 = 78
    物理攻击力 = 1112
    魔法攻击力 = 1172
    独立攻击力 = 723

class 装备298(夜语黑瞳武器):
    名称 = '界·夜语黑瞳战斧'
    类型 = '战斧'
    力量 = 78
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 996
    独立攻击力 = 723

class 装备299(夜语黑瞳武器):
    名称 = '界·夜语黑瞳匕首'
    类型 = '匕首'
    力量 = 78
    智力 = 0
    物理攻击力 = 1109
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备300(夜语黑瞳武器):
    名称 = '界·夜语黑瞳双剑'
    类型 = '双剑'
    力量 = 78
    智力 = 0
    物理攻击力 = 1278
    魔法攻击力 = 937
    独立攻击力 = 723

class 装备301(夜语黑瞳武器):
    名称 = '界·夜语黑瞳手杖'
    类型 = '手杖'
    力量 = 0
    智力 = 78
    物理攻击力 = 1032
    魔法攻击力 = 1346
    独立攻击力 = 723

class 装备302(夜语黑瞳武器):
    名称 = '界·夜语黑瞳苦无'
    类型 = '苦无'
    力量 = 0
    智力 = 117
    物理攻击力 = 977
    魔法攻击力 = 1288
    独立攻击力 = 723

class 装备303(夜语黑瞳武器):
    名称 = '界·夜语黑瞳长枪'
    类型 = '长枪'
    力量 = 117
    智力 = 0
    物理攻击力 = 1230
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备304(夜语黑瞳武器):
    名称 = '界·夜语黑瞳战戟'
    类型 = '战戟'
    力量 = 78
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 996
    独立攻击力 = 723

class 装备305(夜语黑瞳武器):
    名称 = '界·夜语黑瞳光枪'
    类型 = '光枪'
    力量 = 78
    智力 = 78
    物理攻击力 = 1112
    魔法攻击力 = 1346
    独立攻击力 = 723

class 装备306(夜语黑瞳武器):
    名称 = '界·夜语黑瞳暗矛'
    类型 = '暗矛'
    力量 = 78
    智力 = 117
    物理攻击力 = 1112
    魔法攻击力 = 1230
    独立攻击力 = 723

class 装备307(夜语黑瞳武器):
    名称 = '界·夜语黑瞳长刀'
    类型 = '长刀'
    力量 = 78
    智力 = 78
    物理攻击力 = 1265
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备308(夜语黑瞳武器):
    名称 = '界·夜语黑瞳小太刀'
    类型 = '小太刀'
    力量 = 78
    智力 = 39
    物理攻击力 = 1172
    魔法攻击力 = 1172
    独立攻击力 = 723

class 装备309(夜语黑瞳武器):
    名称 = '界·夜语黑瞳重剑'
    类型 = '重剑'
    力量 = 78
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 1054
    独立攻击力 = 723

class 装备310(夜语黑瞳武器):
    名称 = '界·夜语黑瞳源力剑'
    类型 = '源力剑'
    力量 = 0
    智力 = 78
    物理攻击力 = 1112
    魔法攻击力 = 1346
    独立攻击力 = 723
#endregion

#region  超界
class 装备311():
    名称 = '超界·苍天之幕：卷层云'
    所属套装 = '超界·苍穹之云'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.21)
        属性.最终伤害加成(0.05)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +21%<br>'
        temp += '最终伤害 +5%<br>'
        return temp     

class 装备312():
    名称 = '超界·苍天之碧：卷云'
    所属套装 = '超界·苍穹之云'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':37, '轻甲':45, '重甲':41, '板甲':37}
    智力 = {'布甲':45, '皮甲':37, '轻甲':30, '重甲':30, '板甲':37}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.20)
        属性.最终伤害加成(0.05)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '技能攻击力 +20%<br>'
        temp += '最终伤害 +5%<br>'
        return temp   

class 装备313():
    名称 = '超界·苍天之流：层云'
    所属套装 = '超界·苍穹之云'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.21)
        属性.最终伤害加成(0.05)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +21%<br>'
        temp += '最终伤害 +5%<br>'
        return temp     

class 装备314():
    名称 = '超界·苍天之岭：积云'
    所属套装 = '超界·苍穹之云'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.20)
        属性.最终伤害加成(0.05)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +20%<br>'
        temp += '最终伤害 +5%<br>'
        return temp    

class 装备315():
    名称 = '超界·苍天之隙：高积云'
    所属套装 = '超界·苍穹之云'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.20)
        属性.最终伤害加成(0.05)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +20%<br>'
        temp += '最终伤害 +5%<br>'
        temp += '移动速度 +4%<br>'
        return temp     

class 装备316():
    名称 = '超界·芒种：绵延的生命'
    所属套装 = '超界·永恒的季节'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.20)
        属性.技能等级加成('所有', 1, 45, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +20%<br>'
        temp += 'Lv1-45 技能等级+1<br>'
        return temp


class 装备317():
    名称 = '超界·雨水：长青的群山'
    所属套装 = '超界·永恒的季节'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':37, '轻甲':45, '重甲':41, '板甲':37}
    智力 = {'布甲':45, '皮甲':37, '轻甲':30, '重甲':30, '板甲':37}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.20)
        属性.技能等级加成('所有', 1, 45, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +20%<br>'
        temp += 'Lv1-45 技能等级+1<br>'
        return temp

class 装备318():
    名称 = '超界·白露：不熄的光明'
    所属套装 = '超界·永恒的季节'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.21)
        属性.技能等级加成('所有', 35, 48, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +21%<br>'
        temp += 'Lv35-48 技能等级+1<br>'
        return temp

class 装备319():
    名称 = '超界·霜降：凝结的冰霜'
    所属套装 = '超界·永恒的季节'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.21)
        属性.技能等级加成('所有', 35, 48, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +21%<br>'
        temp += 'Lv35-48 技能等级+1<br>'
        return temp

class 装备320():
    名称 = '超界·小寒：澄净的心灵'
    所属套装 = '超界·永恒的季节'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.移动速度 += 0.10
        属性.暴击伤害加成(0.11)
        属性.技能等级加成('所有', 1, 85, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '移动速度 +10%<br>'
        temp += '暴击伤害 +11%<br>'
        temp += 'Lv1-85 技能等级+1<br>'
        return temp

class 装备321():
    名称 = '超界·海豚座的羞涩'
    所属套装 = '超界·亿万年的星光'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.20)
        属性.技能等级加成('所有', 85, 85, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +20%<br>'
        temp += 'Lv85 技能等级+1<br>'
        return temp

class 装备322():
    名称 = '超界·北极星的魅力'
    所属套装 = '超界·亿万年的星光'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':37, '轻甲':45, '重甲':41, '板甲':37}
    智力 = {'布甲':45, '皮甲':37, '轻甲':30, '重甲':30, '板甲':37}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.18)
        属性.物理暴击率 += 0.12
        属性.魔法暴击率 += 0.12
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass

    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '技能攻击力 +18%<br>'
        temp += '物理暴击率 +12%<br>'
        temp += '魔法暴击率 +12%<br>'
        return temp

class 装备323():
    名称 = '超界·织女星的凝望'
    所属套装 = '超界·亿万年的星光'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.20)
        属性.技能等级加成('所有', 50, 50, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +20%<br>'
        temp += 'Lv50 技能等级+1<br>'
        return temp

class 装备324():
    名称 = '超界·天琴座的高洁'
    所属套装 = '超界·亿万年的星光'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.21)
        属性.技能等级加成('所有', 50, 50, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +21%<br>'
        temp += 'Lv50 技能等级+1<br>'
        return temp

class 装备325():
    名称 = '超界·天鹅座的朦胧'
    所属套装 = '超界·亿万年的星光'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(40)
        属性.技能等级加成('所有', 85, 85, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.02
        属性.魔法暴击率 += 0.02
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '所有属性强化 +40<br>'
        temp += 'Lv85 技能等级+1<br>'
        temp += '物理暴击率 +2%<br>'
        temp += '魔法暴击率 +2%<br>'
        temp += '移动速度 +4%<br>'
        return temp

class 装备326():
    名称 = '超界·费诺的愤怒之勇'
    所属套装 = '超界·精灵的荣耀'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.25)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +25%<br>'
        return temp

class 装备327():
    名称 = '超界·维拉的光明净化'
    所属套装 = '超界·精灵的荣耀'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':37, '轻甲':45, '重甲':41, '板甲':37}
    智力 = {'布甲':45, '皮甲':37, '轻甲':30, '重甲':30, '板甲':37}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.23)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.06
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '技能攻击力 +23%<br>'
        temp += '攻击速度 +6%<br>'
        return temp

class 装备328():
    名称 = '超界·凯兰崔尔的决断'
    所属套装 = '超界·精灵的荣耀'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.25)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '最终伤害 +25%<br>'
        return temp

class 装备329():
    名称 = '超界·梵雅的绝世容颜'
    所属套装 = '超界·精灵的荣耀'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.24)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +24%<br>'
        return temp

class 装备330():
    名称 = '超界·伊露维塔的创生'
    所属套装 = '超界·精灵的荣耀'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.24)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +24%<br>'
        temp += '移动速度 +10%<br>'
        return temp

class 装备331():
    名称 = '超界·梦纤石的牵绊'
    所属套装 = '超界·幸运的五彩石'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.18)
        属性.冰属性强化加成(20)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +18%<br>'
        temp += '冰属性强化 +20<br>'
        return temp

class 装备332():
    名称 = '超界·君清石的思念'
    所属套装 = '超界·幸运的五彩石'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':37, '轻甲':45, '重甲':41, '板甲':37}
    智力 = {'布甲':45, '皮甲':37, '轻甲':30, '重甲':30, '板甲':37}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.17)
        属性.火属性强化加成(20)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '技能攻击力 +17%<br>'
        temp += '火属性强化 +20<br>'
        return temp

class 装备333():
    名称 = '超界·凤瞳石的轻鸣'
    所属套装 = '超界·幸运的五彩石'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.17)
        属性.光属性强化加成(20)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +17%<br>'
        temp += '光属性强化 +20<br>'
        return temp

class 装备334():
    名称 = '超界·琥冥石的乖戾'
    所属套装 = '超界·幸运的五彩石'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.18)
        属性.所有属性强化加成(20)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +18%<br>'
        temp += '所有属性强化 +20<br>'
        return temp

class 装备335():
    名称 = '超界·诛璃石的断杀'
    所属套装 = '超界·幸运的五彩石'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.18)
        属性.暗属性强化加成(20)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +18%<br>'
        temp += '暗属性强化 +20<br>'
        temp += '移动速度 +4%<br>'
        return temp

#endregion

#region  普雷
class 装备336():
    名称 = '暗黑之云：被吞噬的太阳'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 45
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(28)
        属性.技能攻击力加成(0.18)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +45<br>'
        temp += '所有属性强化 +28<br>'
        temp += '技能攻击力 +18%<br>'
        return temp

class 装备337():
    名称 = '暗黑之潮：分裂的太阳'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 45
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(24)
        属性.百分比三攻加成(0.22)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +45<br>'
        temp += '所有属性强化 +24<br>'
        temp += '百分比三攻 +22%<br>'
        return temp

class 装备338():
    名称 = '暗黑之炎：被蚕食的太阳'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 67
    智力 = 67
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(34)
        属性.技能攻击力加成(0.16)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +67<br>'
        temp += '智力 +67<br>'
        temp += '所有属性强化 +34<br>'
        temp += '技能攻击力 +16%<br>'
        return temp

class 装备339():
    名称 = '暗黑之云：被吞噬的大地'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 45
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(28)
        属性.技能攻击力加成(0.14)
        属性.技能等级加成('所有', 1, 48, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +45<br>'
        temp += '所有属性强化 +28<br>'
        temp += '技能攻击力 +14%<br>'
        temp += 'Lv1-48 技能等级+1<br>'
        return temp

class 装备340():
    名称 = '暗黑之潮：分裂的大地'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 45
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(24)
        属性.百分比三攻加成(0.18)
        属性.技能等级加成('所有', 60, 80, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +45<br>'
        temp += '所有属性强化 +24<br>'
        temp += '百分比三攻 +18%<br>'
        temp += 'Lv60-80 技能等级+1<br>'
        return temp

class 装备341():
    名称 = '暗黑之炎：被蚕食的大地'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 67
    智力 = 67
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(34)
        属性.技能攻击力加成(0.10)
        属性.技能等级加成('所有', 80, 85, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +67<br>'
        temp += '智力 +67<br>'
        temp += '所有属性强化 +34<br>'
        temp += '技能攻击力 +10%<br>'
        temp += 'Lv80-85 技能等级+1<br>'
        return temp

class 装备342():
    名称 = '暗黑之云：被吞噬的天空'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 45
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(28)
        属性.技能攻击力加成(0.14)
        属性.技能冷却缩减(60, 80, 0.12)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.03
        属性.释放速度 += 0.045
        属性.移动速度 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +45<br>'
        temp += '所有属性强化 +28<br>'
        temp += '技能攻击力 +14%<br>'
        temp += 'Lv60-80 技能CD-12%<br>'
        temp += '攻击速度 +3%<br>'
        temp += '释放速度 +4.5%<br>'
        temp += '移动速度 +3%<br>'
        return temp

class 装备343():
    名称 = '暗黑之潮：分裂的天空'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 45
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(24)
        属性.百分比三攻加成(0.19)
        属性.技能冷却缩减(1, 30, 0.15)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.03
        属性.释放速度 += 0.045
        属性.移动速度 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +45<br>'
        temp += '所有属性强化 +24<br>'
        temp += '百分比三攻 +19%<br>'
        temp += 'Lv1-30 技能CD-15%<br>'
        temp += '攻击速度 +3%<br>'
        temp += '释放速度 +4.5%<br>'
        temp += '移动速度 +3%<br>'
        return temp

class 装备344():
    名称 = '暗黑之炎：被蚕食的天空'
    所属套装 = '黑暗的第一权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 67
    智力 = 67
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(34)
        属性.技能攻击力加成(0.11)
        属性.技能冷却缩减(35, 45, 0.15)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.03
        属性.释放速度 += 0.045
        属性.移动速度 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +67<br>'
        temp += '智力 +67<br>'
        temp += '所有属性强化 +34<br>'
        temp += '技能攻击力 +11%<br>'
        temp += 'Lv35-45 技能CD-15%<br>'
        temp += '攻击速度 +3%<br>'
        temp += '释放速度 +4.5%<br>'
        temp += '移动速度 +3%<br>'
        return temp

class 装备345():
    名称 = '暗黑之魂：被吞噬的太阳'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.16)
        属性.附加伤害加成(0.16)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '伤害增加 +16%<br>'
        temp += '附加伤害 +16%<br>'
        return temp

class 装备346():
    名称 = '暗黑之翼：被蚕食的太阳'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 44
    智力 = 44
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.15)
        属性.技能攻击力加成(0.08)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +44<br>'
        temp += '智力 +44<br>'
        temp += '伤害增加 +15%<br>'
        temp += '技能攻击力 +8%<br>'
        return temp

class 装备347():
    名称 = '暗黑之风：分裂的太阳'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.15)
        属性.技能攻击力加成(0.15)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '暴击伤害 +15%<br>'
        temp += '技能攻击力 +15%<br>'
        return temp

class 装备348():
    名称 = '暗黑之魂：被吞噬的大地'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.14)
        属性.附加伤害加成(0.14)
        属性.技能等级加成('所有', 60, 80, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '伤害增加 +14%<br>'
        temp += '附加伤害 +14%<br>'
        temp += 'Lv60-80 技能等级+1<br>'
        return temp

class 装备349():
    名称 = '暗黑之翼：被蚕食的大地'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 44
    智力 = 44
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.10)
        属性.技能攻击力加成(0.08)
        属性.技能等级加成('所有', 48, 70, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +44<br>'
        temp += '智力 +44<br>'
        temp += '伤害增加 +10%<br>'
        temp += '技能攻击力 +8%<br>'
        temp += 'Lv48-70 技能等级+1<br>'
        return temp

class 装备350():
    名称 = '暗黑之风：分裂的大地'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.10)
        属性.技能攻击力加成(0.15)
        属性.技能等级加成('所有', 35, 50, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '暴击伤害 +10%<br>'
        temp += '技能攻击力 +15%<br>'
        temp += 'Lv35-50 技能等级+1<br>'
        return temp


class 装备351():
    名称 = '暗黑之魂：被吞噬的天空'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.14)
        属性.附加伤害加成(0.14)
        属性.技能冷却缩减(1, 45, 0.12)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.03
        属性.释放速度 += 0.045
        属性.移动速度 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '伤害增加 +14%<br>'
        temp += '附加伤害 +14%<br>'
        temp += 'Lv1-45 技能CD-12%<br>'
        temp += '攻击速度 +3%<br>'
        temp += '释放速度 +4.5%<br>'
        temp += '移动速度 +3%<br>'
        return temp

class 装备352():
    名称 = '暗黑之翼：被蚕食的天空'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 44
    智力 = 44
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.11)
        属性.技能攻击力加成(0.08)
        属性.技能冷却缩减(75, 80, 0.15)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.03
        属性.释放速度 += 0.045
        属性.移动速度 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +44<br>'
        temp += '智力 +44<br>'
        temp += '伤害增加 +11%<br>'
        temp += '技能攻击力 +8%<br>'
        temp += 'Lv75-80 技能CD-15%<br>'
        temp += '攻击速度 +3%<br>'
        temp += '释放速度 +4.5%<br>'
        temp += '移动速度 +3%<br>'
        return temp

class 装备353():
    名称 = '暗黑之风：分裂的天空'
    所属套装 = '黑暗的第二权能'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.11)
        属性.技能攻击力加成(0.15)
        属性.技能冷却缩减(60, 70, 0.15)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.03
        属性.释放速度 += 0.045
        属性.移动速度 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '暴击伤害 +11%<br>'
        temp += '技能攻击力 +15%<br>'
        temp += 'Lv60-70 技能CD-15%<br>'
        temp += '攻击速度 +3%<br>'
        temp += '释放速度 +4.5%<br>'
        temp += '移动速度 +3%<br>'
        return temp
#endregion

#region  100改造&传说
class 装备354():
    名称 = '轮回·维度冲击臂环'
    模式 = 1
    所属套装 = '智慧产物'
    所属套装2 = '维度崩坏'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.12)
        属性.技能攻击力加成(0.16)
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        属性.力量 += 25 * 属性.获取改造(self.部位)
        属性.智力 += 25 * 属性.获取改造(self.部位)
        属性.暴击伤害加成(0.02 * 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '百分比力智 +12%<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +28<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '力量 +' + str(25 * 改造等级) + '<br>'
            temp += '智力 +' + str(25 * 改造等级) + '<br>'
            temp += '暴击伤害+' + str(2 * 改造等级) + '%<br>'
        return temp

class 装备355():
    名称 = '时空：维度冲击臂环'
    模式 = 1
    所属套装 = '维度崩坏'
    等级 = 100
    品质 = '传说'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 46
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.10)
        属性.技能攻击力加成(0.16)
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +46<br>'
        temp += '百分比力智 +10%<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +28<br>'
        return temp

class 装备356():
    名称 = '维度定位项链'
    模式 = 1
    所属套装 = '维度崩坏'
    等级 = 100
    品质 = '传说'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 46
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.22)
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +46<br>'
        temp += '百分比三攻 +22%<br>'
        temp += '所有属性强化 +28<br>'
        return temp


class 装备357():
    名称 = '维度粉碎戒指'
    模式 = 1
    所属套装 = '维度崩坏'
    等级 = 100
    品质 = '传说'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 68
    智力 = 68
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.05)
        属性.技能攻击力加成(0.16)
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +68<br>'
        temp += '智力 +68<br>'
        temp += '附加伤害 +5%<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +28<br>'
        return temp

class 装备358():
    名称 = '轮回·腐蚀之黑色十字耳环'
    模式 = 1
    所属套装 = '智慧产物'
    所属套装2 = '暗之腐蚀'
    等级 = 100
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.20)
        属性.附加伤害加成(0.20)
        pass
    def 进图属性(self, 属性):
        属性.力量 += 25 * 属性.获取改造(self.部位)
        属性.智力 += 25 * 属性.获取改造(self.部位)
        属性.百分比力智加成(0.02 * 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '伤害增加 +20%<br>'
        temp += '附加伤害 +20%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '力量 +' + str(25 * 改造等级) + '<br>'
            temp += '智力 +' + str(25 * 改造等级) + '<br>'
            temp += '百分比力智+' + str(2 * 改造等级) + '%<br>'
        return temp

class 装备359():
    名称 = '时空：腐蚀之黑色十字耳环'
    模式 = 1
    所属套装 = '暗之腐蚀'
    等级 = 100
    品质 = '传说'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 67
    智力 = 67
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.17)
        属性.附加伤害加成(0.17)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +67<br>'
        temp += '智力 +67<br>'
        temp += '伤害增加 +17%<br>'
        temp += '附加伤害 +17%<br>'
        return temp

class 装备360():
    名称 = '腐蚀之黑色面具'
    模式 = 1
    所属套装 = '暗之腐蚀'
    等级 = 100
    品质 = '传说'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 45
    智力 = 45
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.15)
        属性.技能攻击力加成(0.13)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +45<br>'
        temp += '智力 +45<br>'
        temp += '伤害增加 +15%<br>'
        temp += '技能攻击力 +13%<br>'
        return temp

class 装备361():
    名称 = '腐蚀之黑色尖角'
    模式 = 1
    所属套装 = '暗之腐蚀'
    等级 = 100
    品质 = '传说'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 67
    智力 = 67
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.13)
        属性.技能攻击力加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +67<br>'
        temp += '智力 +67<br>'
        temp += '暴击伤害 +13%<br>'
        temp += '技能攻击力 +15%<br>'
        return temp

class 装备362():
    名称 = '轮回·黑暗幽灵紫杉胸甲'
    模式 = 1
    所属套装 = '智慧产物'
    所属套装2 = '堕落的暗黑之力'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '轻甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.15)
        属性.百分比力智加成(0.08)
        属性.伤害增加加成(0.11)
        pass
    def 进图属性(self, 属性):
        属性.力量 += 25 * 属性.获取改造(self.部位)
        属性.智力 += 25 * 属性.获取改造(self.部位)
        属性.技能攻击力加成(0.02 * 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +15%<br>'
        temp += '百分比力智 +8%<br>'
        temp += '伤害增加 +11%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '力量 +' + str(25 * 改造等级) + '<br>'
            temp += '智力 +' + str(25 * 改造等级) + '<br>'
            temp += '技能攻击力 +' + str(2 * 改造等级) + '%<br>'
        return temp
        return temp

class 装备363():
    名称 = '时空：黑暗幽灵紫杉胸甲'
    模式 = 1
    所属套装 = '堕落的暗黑之力'
    等级 = 100
    品质 = '传说'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':47, '轻甲':57, '重甲':52, '板甲':47}
    智力 = {'布甲':57, '皮甲':47, '轻甲':37, '重甲':37, '板甲':47}
    类型 = '轻甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.15)
        属性.百分比力智加成(0.08)
        属性.伤害增加加成(0.06)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +15%<br>'
        temp += '百分比力智 +8%<br>'
        temp += '伤害增加 +6%<br>'
        return temp

class 装备364():
    名称 = '黑暗幽灵紫杉护肩'
    模式 = 1
    所属套装 = '堕落的暗黑之力'
    等级 = 100
    品质 = '传说'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':39, '轻甲':45, '重甲':42, '板甲':39}
    智力 = {'布甲':45, '皮甲':39, '轻甲':31, '重甲':31, '板甲':39}
    类型 = '轻甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.12)
        属性.百分比力智加成(0.10)
        属性.所有属性强化加成(24)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +12%<br>'
        temp += '百分比力智 +10%<br>'
        temp += '所有属性强化 +24<br>'
        return temp


class 装备365():
    名称 = '黑暗幽灵紫杉护腿'
    模式 = 1
    所属套装 = '堕落的暗黑之力'
    等级 = 100
    品质 = '传说'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':47, '轻甲':57, '重甲':52, '板甲':47}
    智力 = {'布甲':57, '皮甲':47, '轻甲':37, '重甲':37, '板甲':47}
    类型 = '轻甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.15)
        属性.百分比力智加成(0.08)
        属性.所有属性强化加成(22)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +15%<br>'
        temp += '百分比力智 +8%<br>'
        temp += '所有属性强化 +22<br>'
        return temp

class 装备366():
    名称 = '黑暗幽灵紫杉腰带'
    模式 = 1
    所属套装 = '堕落的暗黑之力'
    等级 = 100
    品质 = '传说'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':29, '轻甲':34, '重甲':31, '板甲':29}
    智力 = {'布甲':34, '皮甲':29, '轻甲':23, '重甲':23, '板甲':29}
    类型 = '轻甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.12)
        属性.百分比力智加成(0.10)
        属性.所有属性强化加成(24)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +12%<br>'
        temp += '百分比力智 +10%<br>'
        temp += '所有属性强化 +24<br>'
        return temp


class 装备367():
    名称 = '黑暗幽灵紫杉长靴'
    模式 = 1
    所属套装 = '堕落的暗黑之力'
    等级 = 100
    品质 = '传说'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':29, '轻甲':34, '重甲':31, '板甲':29}
    智力 = {'布甲':34, '皮甲':29, '轻甲':23, '重甲':23, '板甲':29}
    类型 = '轻甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.05)
        属性.暴击伤害加成(0.08)
        属性.百分比力智加成(0.10)
        属性.所有属性强化加成(24)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +5%<br>'
        temp += '暴击伤害 +8%<br>'
        temp += '百分比力智 +10%<br>'
        temp += '所有属性强化 +24<br>'
        temp += '移动速度 +4%<br>'
        return temp


class 装备368():
    名称 = '维度冲击臂环'
    模式 = 1
    所属套装 = '维度崩坏'
    等级 = 100
    品质 = '传说'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 46
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.05)
        属性.技能攻击力加成(0.16)
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +46<br>'
        temp += '百分比力智 +5%<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +28<br>'
        return temp

class 装备369():
    名称 = '腐蚀之黑色十字耳环'
    模式 = 1
    所属套装 = '暗之腐蚀'
    等级 = 100
    品质 = '传说'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 67
    智力 = 67
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.14)
        属性.附加伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +67<br>'
        temp += '智力 +67<br>'
        temp += '伤害增加 +14%<br>'
        temp += '附加伤害 +14%<br>'
        return temp
        
class 装备370():
    名称 = '黑暗幽灵紫杉胸甲'
    模式 = 1
    所属套装 = '堕落的暗黑之力'
    等级 = 100
    品质 = '传说'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':47, '轻甲':57, '重甲':52, '板甲':47}
    智力 = {'布甲':57, '皮甲':47, '轻甲':37, '重甲':37, '板甲':47}
    类型 = '轻甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.15)
        属性.百分比力智加成(0.08)
        属性.所有属性强化加成(22)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +15%<br>'
        temp += '百分比力智 +8%<br>'
        temp += '所有属性强化 +22<br>'
        return temp

#endregion

#region 智慧产物(续)
class 装备371(飘零之花武器):
    名称 = '飘零之花念珠'
    类型 = '念珠'
    力量 = 0
    智力 = 122
    物理攻击力 = 1005
    魔法攻击力 = 1313
    独立攻击力 = 711
    物攻成长 = 185
    魔攻成长 = 189

class 装备372(飘零之花武器):
    名称 = '飘零之花图腾'
    类型 = '图腾'
    力量 = 122
    智力 = 0
    物理攻击力 = 1190
    魔法攻击力 = 1005
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 185

class 装备373(飘零之花武器):
    名称 = '飘零之花镰刀'
    类型 = '镰刀'
    力量 = 81
    智力 = 81
    物理攻击力 = 1067
    魔法攻击力 = 1129
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 187

class 装备374(飘零之花武器):
    名称 = '飘零之花战斧'
    类型 = '战斧'
    力量 = 81
    智力 = 0
    物理攻击力 = 1375
    魔法攻击力 = 945
    独立攻击力 = 711
    物攻成长 = 190
    魔攻成长 = 184

class 装备375(飘零之花武器):
    名称 = '飘零之花暗矛'
    类型 = '暗矛'
    力量 = 81
    智力 = 122
    物理攻击力 = 1067
    魔法攻击力 = 1190
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 187

class 装备376(飘零之花武器):
    名称 = '飘零之花匕首'
    类型 = '匕首'
    力量 = 81
    智力 = 0
    物理攻击力 = 1067
    魔法攻击力 = 1005
    独立攻击力 = 711
    物攻成长 = 185
    魔攻成长 = 185

class 装备377(飘零之花武器):
    名称 = '飘零之花臂铠'
    类型 = '臂铠'
    力量 = 81
    智力 = 0
    物理攻击力 = 1190
    魔法攻击力 = 1067
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 186

class 装备378(飘零之花武器):
    名称 = '飘零之花东方棍'
    类型 = '东方棍'
    力量 = 81
    智力 = 122
    物理攻击力 = 1067
    魔法攻击力 = 1129
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 187

class 装备379(飘零之花武器):
    名称 = '飘零之花光枪'
    类型 = '光枪'
    力量 = 81
    智力 = 81
    物理攻击力 = 1067
    魔法攻击力 = 1313
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 189

class 装备380(飘零之花武器):
    名称 = '飘零之花苦无'
    类型 = '苦无'
    力量 = 0
    智力 = 122
    物理攻击力 = 928
    魔法攻击力 = 1252
    独立攻击力 = 711
    物攻成长 = 185
    魔攻成长 = 188

class 装备381(飘零之花武器):
    名称 = '飘零之花手杖'
    类型 = '手杖'
    力量 = 0
    智力 = 81
    物理攻击力 = 986
    魔法攻击力 = 1313
    独立攻击力 = 711
    物攻成长 = 184
    魔攻成长 = 189

class 装备382(飘零之花武器):
    名称 = '飘零之花双剑'
    类型 = '双剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1243
    魔法攻击力 = 883
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 184

class 装备383(飘零之花武器):
    名称 = '飘零之花小太刀'
    类型 = '小太刀'
    力量 = 81
    智力 = 41
    物理攻击力 = 1129
    魔法攻击力 = 1129
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 187

class 装备384(飘零之花武器):
    名称 = '飘零之花源力剑'
    类型 = '源力剑'
    力量 = 0
    智力 = 81
    物理攻击力 = 1067
    魔法攻击力 = 1313
    独立攻击力 = 711
    物攻成长 = 186
    魔攻成长 = 189

class 装备385(飘零之花武器):
    名称 = '飘零之花战戟'
    类型 = '战戟'
    力量 = 81
    智力 = 0
    物理攻击力 = 1375
    魔法攻击力 = 945
    独立攻击力 = 711
    物攻成长 = 190
    魔攻成长 = 184

class 装备386(飘零之花武器):
    名称 = '飘零之花长刀'
    类型 = '长刀'
    力量 = 81
    智力 = 81
    物理攻击力 = 1228
    魔法攻击力 = 1005
    独立攻击力 = 711
    物攻成长 = 188
    魔攻成长 = 185

class 装备387(飘零之花武器):
    名称 = '飘零之花长枪'
    类型 = '长枪'
    力量 = 122
    智力 = 0
    物理攻击力 = 1190
    魔法攻击力 = 1005
    独立攻击力 = 711
    物攻成长 = 187
    魔攻成长 = 185

class 装备388(飘零之花武器):
    名称 = '飘零之花重剑'
    类型 = '重剑'
    力量 = 81
    智力 = 0
    物理攻击力 = 1375
    魔法攻击力 = 1005
    独立攻击力 = 711
    物攻成长 = 190
    魔攻成长 = 185

class 装备389(飘零之花武器):
    名称 = '飘零之花自动手枪'
    类型 = '自动手枪'
    力量 = 0
    智力 = 81
    物理攻击力 = 768
    魔法攻击力 = 1173
    独立攻击力 = 711
    物攻成长 = 181
    魔攻成长 = 186

#endregion

#region 改造低级SS
class 装备390():
    名称 = '碧水红潮'
    所属套装 = '江山如画'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 67
    智力 = 67
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(16)
        属性.百分比三攻加成(0.18)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.移动速度 += 0.08
        属性.释放速度 += 0.12
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +67<br>'
        temp += '智力 +67<br>'
        temp += '所有属性强化 +16<br>'
        temp += '百分比三攻 +18%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +8%<br>'
        temp += '释放速度 +12%<br>'
        return temp

class 装备391():
    名称 = '雪浪风尘'
    所属套装 = '江山如画'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 45
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(16)
        属性.技能攻击力加成(0.18)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.移动速度 += 0.08
        属性.释放速度 += 0.12
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +45<br>'
        temp += '所有属性强化 +16<br>'
        temp += '技能攻击力 +18%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +8%<br>'
        temp += '释放速度 +12%<br>'
        return temp

class 装备392():
    名称 = '千寻一醉'
    所属套装 = '江山如画'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 45
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(16)
        属性.百分比力智加成(0.18)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.移动速度 += 0.08
        属性.释放速度 += 0.12
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +45<br>'
        temp += '所有属性强化 +16<br>'
        temp += '百分比力智 +18%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +8%<br>'
        temp += '释放速度 +12%<br>'
        return temp

class 装备393():
    名称 = '转世：回溯的生命'
    所属套装 = '万物的生灭'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.12)
        属性.暴击伤害加成(0.12)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '伤害增加 +12%<br>'
        temp += '暴击伤害 +12%<br>'
        return temp

class 装备394():
    名称 = '循环：无尽的诞生'
    所属套装 = '万物的生灭'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 44
    智力 = 44
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.10)
        属性.技能等级加成('所有', 1, 85, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +44<br>'
        temp += '智力 +44<br>'
        temp += '最终伤害 +10%<br>'
        temp += 'Lv1-85 技能等级+1<br>'
        return temp


class 装备395():
    名称 = '轮回：周而复始的时间'
    所属套装 = '万物的生灭'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(50)
        属性.技能攻击力加成(0.10)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '所有属性强化 +50<br>'
        temp += '技能攻击力 +10%<br>'
        return temp

class 改造产物():
    模式 = 1
    所属套装 = '智慧产物'
    等级 = 100
    品质 = '史诗'
    力量 = 0
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    关联套装 = ''
    def 基础属性(self, 属性):
        pass
    def 改造属性(self, 属性, x):
        pass
    def 城镇属性(self, 属性):
        for i in 属性.装备栏:
            if 装备列表[装备序号[i]].所属套装 in self.关联套装:
                属性.力量 += 100
                属性.智力 += 100
        self.基础属性(属性)
        pass
    def 进图属性(self, 属性):
        if self.关联套装 in 属性.套装栏:
            self.改造属性(属性, 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        return temp

class 装备396(改造产物):
    名称 = '江山如故'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    关联套装 = '江山如画[3]'
    def 改造属性(self, 属性, x):
        属性.最终伤害加成(0.02 * x)
        if x >= 3:
            属性.伤害增加加成(0.14)
            属性.暴击伤害加成(0.28)
        if x >= 4:
            属性.最终伤害加成(0.21)
            属性.百分比三攻加成(0.38)
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.08
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        temp += '移动速度 +8%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '最终伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 3:
           temp += '伤害增加 +14%<br>'
           temp += '暴击伤害 +28%<br>'
        if 改造等级 >= 4:
           temp += '最终伤害 +21%<br>'
           temp += '百分比三攻 +38%<br>'
        return temp


class 装备397(改造产物):
    名称 = '天衍万物'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    关联套装 = '万物的生灭[3]'
    def 改造属性(self, 属性, x):
        属性.暴击伤害加成(0.02 * x)
        if x >= 3:
            属性.附加伤害加成(0.13)
            属性.百分比三攻加成(0.25)
        if x >= 4:
            属性.所有属性强化加成(60)
            属性.百分比力智加成(0.37)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.10
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '攻击速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '暴击伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 3:
           temp += '附加伤害 +13%<br>'
           temp += '百分比三攻 +25%<br>'
        if 改造等级 >= 4:
           temp += '所有属性强化 +60<br>'
           temp += '百分比力智 +37%<br>'
        return temp

class 装备398():
    名称 = '刻印：文韬妙策上衣'
    所属套装 = '兵法之神'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.08)
        属性.物理攻击力 += 100
        属性.魔法攻击力 += 100
        属性.独立攻击力 += 100
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比力智 +8%<br>'
        return temp

class 装备399():
    名称 = '刻印：龙韬秘法护肩'
    所属套装 = '兵法之神'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':37, '轻甲':45, '重甲':41, '板甲':37}
    智力 = {'布甲':45, '皮甲':37, '轻甲':30, '重甲':30, '板甲':37}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.08)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +8%<br>'
        return temp 

class 装备400():
    名称 = '刻印：虎韬妙计下装'
    所属套装 = '兵法之神'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':46, '轻甲':56, '重甲':52, '板甲':46}
    智力 = {'布甲':56, '皮甲':46, '轻甲':37, '重甲':37, '板甲':46}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.08)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.释放速度 += 0.075
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '百分比三攻 +8%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '释放速度 +7.5%<br>'
        return temp      

class 装备401():
    名称 = '刻印：豹韬飞跃战靴'
    所属套装 = '兵法之神'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.08)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.14
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '最终伤害 +8%<br>'
        temp += '移动速度 +14%<br>'
        return temp
     

class 装备402():
    名称 = '刻印：武韬秘典腰带'
    所属套装 = '兵法之神'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':28, '轻甲':33, '重甲':31, '板甲':28}
    智力 = {'布甲':33, '皮甲':28, '轻甲':22, '重甲':22, '板甲':28}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.08)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '暴击伤害 +8%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp 

class 装备403(改造产物):
    名称 = '过往时光的轮回'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    关联套装 = '兵法之神[5]'
    关联套装2 = '无相轮回的希望[2]'
    关联套装3 = '流逝轮回的记忆[3]'
    def 基础属性(self, 属性):
        属性.爆伤 = max(属性.爆伤, 0.45)
    def 改造属性(self, 属性, x):
        属性.技能攻击力加成(0.01 * x)
        if x >= 1:
            属性.最终伤害加成(0.40)
        if x >= 3:
            属性.暴击伤害加成(0.15)
            属性.百分比力智加成(0.35)
            属性.伤害增加加成(0.15)
        if x >= 4:
            属性.技能攻击力加成(0.15)
        pass
    def 进图属性(self, 属性):
        if (self.关联套装 in 属性.套装栏) and (self.关联套装2 in 属性.套装栏) and (self.关联套装3 in 属性.套装栏):
            self.改造属性(属性, 属性.获取改造(self.部位))
        pass

    def 城镇属性(self, 属性):
        for i in 属性.装备栏:
            if 装备列表[装备序号[i]].所属套装 in self.关联套装:
                属性.力量 += 100
                属性.智力 += 100
            if 装备列表[装备序号[i]].所属套装 in self.关联套装2:
                属性.力量 += 100
                属性.智力 += 100
            if 装备列表[装备序号[i]].所属套装 in self.关联套装3:
                属性.力量 += 100
                属性.智力 += 100
        self.基础属性(属性)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '爆伤 +45%(取最高值)<br>'
        if not ((self.关联套装 in 属性.套装栏) and (self.关联套装2 in 属性.套装栏) and (self.关联套装3 in 属性.套装栏)):
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '技能攻击力 +' + str(改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '最终伤害 +40%<br>'
        if 改造等级 >= 3:
           temp += '暴击伤害 +15%<br>'
           temp += '百分比力智 +35%<br>'
           temp += '伤害增加 +15%<br>'
        if 改造等级 >= 4:
           temp += '技能攻击力 +15%<br>'
        return temp
 
class 装备404():
    名称 = '流逝轮回的时间'
    所属套装 = '流逝轮回的记忆'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 45
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.10)
    def 进图属性(self, 属性):
        属性.力量 += 100
        属性.智力 += 100
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +145<br>'
        temp += '智力 +100<br>'
        temp += '附加伤害 +10%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp    

class 装备405():
    名称 = '流逝轮回的思念'
    所属套装 = '流逝轮回的记忆'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 45
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(42)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        属性.攻击速度 += 0.05
        属性.释放速度 += 0.05
        属性.移动速度 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +45<br>'
        temp += '所有属性强化 +42<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '释放速度 +5%<br>'
        temp += '移动速度 +5%<br>'
        return temp      

class 装备406():
    名称 = '流逝轮回的启迪'
    所属套装 = '流逝轮回的记忆'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 67
    智力 = 67
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.08)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        pass
    名称 = '流逝轮回的启迪'
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +67<br>'
        temp += '智力 +67<br>'
        temp += '技能攻击力 +8%<br>'
        temp += '攻击速度 +5%<br>'
        return temp   

class 装备407():
    名称 = '无相轮回的追忆'
    所属套装 = '无相轮回的希望'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '耳环'
    类型 = '特殊'
    力量 = 66
    智力 = 66
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.06)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    名称 = '无相轮回的追忆'
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +66<br>'
        temp += '智力 +66<br>'
        temp += '伤害增加 +6%<br>'
        return temp     

class 装备408():
    名称 = '无相轮回的信念'
    所属套装 = '无相轮回的希望'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 105
    智力 = 105
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.物理攻击力 += 50
        属性.魔法攻击力 += 50
        属性.独立攻击力 += 50
        属性.黄字 = max(属性.黄字, 0.10)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +105<br>'
        temp += '智力 +105<br>'
        temp += '物理攻击力 +50<br>'
        temp += '魔法攻击力 +50<br>'
        temp += '独立攻击力 +50<br>'
        temp += '伤害增加 +10%<br>'
        return temp      

class 装备409():
    名称 = '无相轮回的眼泪'
    所属套装 = '无相轮回的希望'
    模式 = 1
    等级 = 95
    品质 = '史诗'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(16)
        属性.暴击伤害加成(0.06)
    def 进图属性(self, 属性):
        属性.所有属性强化加成(10)
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '所有属性强化 +16<br>'
        temp += '暴击伤害 +6%<br>'
        temp += '所有属性强化 +10<br>'
        return temp    

class 装备410():
    名称 = '魔战无双胸甲'
    所属套装 = '魔战无双'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.黄字 = max(属性.黄字, 0.10)
        属性.加算冷却缩减 += 0.12
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.释放速度 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'            
        temp += '黄字 +10%(取最高值)<br>'
        temp += '技能冷却 -12%(加算)<br>'
        temp += '释放速度 +5%<br>'
        return temp     

class 装备411():
    名称 = '魔战无双肩甲'
    所属套装 = '魔战无双'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':34, '轻甲':41, '重甲':37, '板甲':34}	
    智力 = {'布甲':41, '皮甲':34, '轻甲':28, '重甲':28, '板甲':34}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.技能等级加成('所有', 30, 48, 2)
        try:
            属性.技能栏[属性.技能序号['基础精通']].倍率 *= 2.5
        except:
            pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.12
        属性.释放速度 += 0.12
        属性.移动速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'     
        temp += 'Lv30-48 技能等级+2<br>'
        temp += '基础精通效果 +150%<br>'
        temp += '攻击速度 +12%<br>'
        temp += '释放速度 +12%<br>'
        temp += '移动速度 +15%<br>'
        return temp     

class 装备412():
    名称 = '魔战无双腿甲'
    所属套装 = '魔战无双'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.加算冷却缩减 += 0.10
        属性.技能等级加成('所有', 85, 85, 1)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.释放速度 += 0.05
        属性.移动速度 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '技能冷却 -10%(加算)<br>'
        temp += 'Lv85 技能等级+1<br>'
        temp += '攻击速度 +5%<br>'
        temp += '释放速度 +5%<br>'
        temp += '移动速度 +5%<br>'
        return temp   

class 装备413():
    名称 = '魔战无双腰带'
    所属套装 = '魔战无双'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.加算冷却缩减 += 0.10
        属性.技能等级加成('所有', 80, 80, 2)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '技能冷却 -10%(加算)<br>'
        temp += 'Lv80 技能等级+2<br>'
        return temp     

class 装备414():
    名称 = '魔战无双短靴'
    所属套装 = '魔战无双'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':88, '皮甲':113, '轻甲':119, '重甲':116, '板甲':113}	
    智力 = {'布甲':119, '皮甲':113, '轻甲':108, '重甲':108, '板甲':113}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.08)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.06
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '百分比三攻 +8%<br>'
        temp += '移动速度 +6%<br>'
        return temp     

class 装备415(改造产物):
    名称 = '聚魔漩涡'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    关联套装 = '魔战无双[5]'
    def 改造属性(self, 属性, x):
        属性.最终伤害加成(0.02 * x)
        if x >= 1:
            属性.暴击伤害加成(0.40)
        if x >= 3:
            属性.百分比三攻加成(0.10)
            属性.百分比力智加成(0.33)
            属性.技能攻击力加成(0.20)
        if x >= 5:
            属性.最终伤害加成(0.08)
            属性.技能攻击力加成(0.40)
        pass
    def 基础属性(self, 属性):
        属性.附加伤害加成(0.35)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '附加伤害 +35%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '最终伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
            temp += '暴击伤害 +40%<br>'
        if 改造等级 >= 3:
            temp += '百分比三攻 +10%<br>'
            temp += '百分比力智 +33%<br>'
            temp += '技能攻击力 +20%<br>'
        if 改造等级 >= 5:
            temp += '最终伤害 +8%<br>'
            temp += '技能攻击力 +40%<br>'
        return temp     

class 装备416():
    名称 = '霸域英豪胸甲'
    所属套装 = '霸域英豪'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':55, '皮甲':98, '轻甲':106, '重甲':101, '板甲':98}	
    智力 = {'布甲':106, '皮甲':98, '轻甲':89, '重甲':89, '板甲':98}	
    类型 = '板甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.物理攻击力 += 100
        属性.魔法攻击力 += 100
        属性.独立攻击力 += 100
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '物理攻击力 +100<br>'
        temp += '魔法攻击力 +100<br>'
        temp += '独立攻击力 +100<br>'
        return temp   

class 装备417():
    名称 = '霸域英豪护肩'
    所属套装 = '霸域英豪'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':34, '轻甲':41, '重甲':37, '板甲':34}	
    智力 = {'布甲':41, '皮甲':34, '轻甲':28, '重甲':28, '板甲':34}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.爆伤 = max(属性.爆伤, 0.15)
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.07
        属性.魔法暴击率 += 0.07
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '爆伤 +15%(取最高值)<br>'
        temp += '物理暴击率 +7%<br>'
        temp += '魔法暴击率 +7%<br>'
        return temp        

class 装备418():
    名称 = '霸域英豪护腿'
    所属套装 = '霸域英豪'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':55, '皮甲':98, '轻甲':106, '重甲':101, '板甲':98}	
    智力 = {'布甲':106, '皮甲':98, '轻甲':89, '重甲':89, '板甲':98}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.物理攻击力 += 100
        属性.魔法攻击力 += 100
        属性.独立攻击力 += 100
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '物理攻击力 +100<br>'
        temp += '魔法攻击力 +100<br>'
        temp += '独立攻击力 +100<br>'
        return temp       

class 装备419():
    名称 = '霸域英豪腰带'
    所属套装 = '霸域英豪'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':165, '皮甲':190, '轻甲':196, '重甲':193, '板甲':190}	
    智力 = {'布甲':196, '皮甲':190, '轻甲':185, '重甲':185, '板甲':190}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        return temp       

class 装备420():
    名称 = '霸域英豪战靴'
    所属套装 = '霸域英豪'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.3
        属性.移动速度 += 0.3
        属性.释放速度 += 0.3
        属性.攻击速度 += 0.02
        属性.移动速度 += 0.06
        属性.释放速度 += 0.03
        属性.物理暴击率 += 0.1
        属性.魔法暴击率 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '攻击速度 +30%<br>'
        temp += '移动速度 +30%<br>'
        temp += '释放速度 +30%<br>'
        temp += '攻击速度 +2%<br>'
        temp += '移动速度 +6%<br>'
        temp += '释放速度 +3%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp    

class 装备421(改造产物):
    名称 = '全能霸域'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    关联套装 = '霸域英豪[5]'
    def 改造属性(self, 属性, x):
        属性.最终伤害加成(0.02 * x)
        if x >= 1:
            属性.所有属性强化加成(50)
            属性.技能等级加成('所有', 50, 85, 2)
            属性.技能等级加成('所有', 100, 100, 2)
        if x >= 3:
            属性.百分比力智加成(0.19)
            属性.伤害增加加成(0.22)
            属性.技能攻击力加成(0.28)
        if x >= 5:
            属性.百分比力智加成(0.63)
        pass
    def 基础属性(self, 属性):
        属性.百分比三攻加成(0.40)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '百分比三攻 +40%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '最终伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '所有属性强化 +50<br>'
           temp += 'Lv50-85 技能等级+2<br>'
           temp += 'Lv100   技能等级+2<br>'
        if 改造等级 >= 3:
           temp += '百分比力智 +19%<br>'
           temp += '伤害增加 +22%<br>'
           temp += '技能攻击力 +28%<br>'
        if 改造等级 >= 5:
           temp += '百分比力智 +63%<br>'
        return temp     

class 装备422():
    名称 = '千蛛碎影之毒牙胸甲'
    所属套装 = '千蛛碎影'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':154, '皮甲':197, '轻甲':205, '重甲':200, '板甲':197}	
    智力 = {'布甲':205, '皮甲':197, '轻甲':188, '重甲':188, '板甲':197}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.固定减防 = 36000 * 千蛛减防
        pass
    def 进图属性(self, 属性):
        if 属性.职业 == '街霸':
            for i in 属性.技能栏:
                if i.是否有伤害 == 1:
                    i.中毒倍率 += 0.2
                    if 属性.角色 == '格斗家(女)':
                        i.涂毒倍率 += 0.2
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '中毒、涂毒伤害 +20%<br>'
        if 千蛛减防 == 1:
            temp += '固定减防 +36000(最多叠加1次)<br>'
        return temp      

class 装备423():
    名称 = '千蛛碎影之蛛丝肩甲'
    所属套装 = '千蛛碎影'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':110, '皮甲':144, '轻甲':151, '重甲':147, '板甲':144}	
    智力 = {'布甲':151, '皮甲':144, '轻甲':138, '重甲':138, '板甲':144}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.固定减防 = 36000 * 千蛛减防
        属性.技能等级加成('所有', 48, 48, 1)
        if 属性.职业 == '街霸' and 属性.角色 == '格斗家(男)':
            for i in 属性.技能栏:
                if i.是否有伤害 == 1:
                    i.感电倍率 += 0.2
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += 'Lv48 技能等级+1<br>'
        temp += '感电伤害 +20%<br>'
        if 千蛛减防 == 1:
            temp += '固定减防 +36000(最多叠加1次)<br>'
        return temp      

class 装备424():
    名称 = '千蛛碎影之蛛网护腿'
    所属套装 = '千蛛碎影'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':154, '皮甲':197, '轻甲':205, '重甲':200, '板甲':197}	
    智力 = {'布甲':205, '皮甲':197, '轻甲':188, '重甲':188, '板甲':197}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.固定减防 = 36000 * 千蛛减防
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        if 千蛛减防 == 1:
            temp += '固定减防 +36000(最多叠加1次)<br>'
        return temp

class 装备425():
    名称 = '千蛛碎影之蛛刺腰带'
    所属套装 = '千蛛碎影'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':110, '皮甲':135, '轻甲':141, '重甲':138, '板甲':135}	
    智力 = {'布甲':141, '皮甲':135, '轻甲':130, '重甲':130, '板甲':135}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.技能等级加成('所有', 48, 48, 1)
        属性.固定减防 = 36000 * 千蛛减防
        pass
    def 进图属性(self, 属性):
        if 属性.职业 == '街霸':
            for i in 属性.技能栏:
                if i.是否有伤害 == 1:
                    i.灼伤倍率 += 0.2
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += 'Lv48 技能等级+1<br>'
        temp += '灼伤伤害 +20%<br>'
        if 千蛛减防 == 1:
            temp += '固定减防 +36000(最多叠加1次)<br>'
        return temp    

class 装备426():
    名称 = '千蛛碎影之利齿战靴'
    所属套装 = '千蛛碎影'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':110, '皮甲':135, '轻甲':141, '重甲':138, '板甲':135}	
    智力 = {'布甲':141, '皮甲':135, '轻甲':130, '重甲':130, '板甲':135}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.技能等级加成('所有', 48, 48, 1)
        属性.固定减防 = 36000 * 千蛛减防
        pass
    def 进图属性(self, 属性):
        if 属性.职业 == '街霸':
            for i in 属性.技能栏:
                if i.是否有伤害 == 1:
                    i.出血倍率 += 1.2
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += 'Lv48 技能等级+1<br>'
        temp += '出血伤害 +20%<br>'
        if 千蛛减防 == 1:
            temp += '固定减防 +36000(最多叠加1次)<br>'
        return temp       

class 装备427(改造产物):
    名称 = '百变千蛛'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    关联套装 = '千蛛碎影[5]'
    def 改造属性(self, 属性, x):
        属性.伤害增加加成(0.02 * x)
        if x >= 1:
            属性.附加伤害加成(0.18)
            属性.最终伤害加成(0.40)
        if x >= 3:
            属性.暴击伤害加成(0.38)
            属性.技能攻击力加成(0.30)
        if x >= 5:
            属性.百分比力智加成(0.45)
            属性.百分比三攻加成(0.10)
        pass
    def 基础属性(self, 属性):
        属性.所有属性强化加成(119)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '所有属性强化 +119<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '伤害增加 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '附加伤害 +18%<br>'
           temp += '最终伤害 +40%<br>'
        if 改造等级 >= 3:
           temp += '暴击伤害 +38%<br>'
           temp += '技能攻击力 +30%<br>'
        if 改造等级 >= 5:
           temp += '百分比力智 +45%<br>'
           temp += '百分比三攻 +10%<br>'
        return temp   

class 装备428():
    名称 = '誓血之盟铠甲'
    所属套装 = '誓血之盟'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':220, '皮甲':263, '轻甲':271, '重甲':266, '板甲':263}	
    智力 = {'布甲':271, '皮甲':263, '轻甲':254, '重甲':254, '板甲':263}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.力量 += 200
        属性.智力 += 200
        属性.攻击速度 += 0.14
        属性.释放速度 += 0.22
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '攻击速度 +14%<br>'
        temp += '释放速度 +22%<br>'
        temp += '力量 +200<br>'
        temp += '智力 +200<br>'
        return temp       

class 装备429():
    名称 = '誓血之盟肩甲'
    所属套装 = '誓血之盟'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':83, '皮甲':117, '轻甲':123, '重甲':120, '板甲':117}	
    智力 = {'布甲':123, '皮甲':117, '轻甲':110, '重甲':110, '板甲':117}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.物理攻击力 += 116
        属性.魔法攻击力 += 116
        属性.独立攻击力 += 116
        属性.伤害增加加成(0.04)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '伤害增加 +4%<br>'
        temp += '物理攻击 +116<br>'
        temp += '魔法攻击 +116<br>'
        temp += '独立攻击 +116<br>'
        return temp
    

class 装备430():
    名称 = '誓血之盟腿甲'
    所属套装 = '誓血之盟'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.物理攻击力 += 138
        属性.魔法攻击力 += 138
        属性.独立攻击力 += 138
        pass
    def 进图属性(self, 属性):#mp<85%
        属性.物理暴击率 += 0.15
        属性.魔法暴击率 += 0.15
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '物理暴击率 +15%<br>'
        temp += '魔法暴击率 +15%<br>'
        temp += '物理攻击 +138<br>'
        temp += '魔法攻击 +138<br>'
        temp += '独立攻击 +138<br>'
        return temp     

class 装备431():
    名称 = '誓血之盟腰带'
    所属套装 = '誓血之盟'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '重甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.05)
        pass
    def 进图属性(self, 属性):
        属性.物理攻击力 += 100
        属性.魔法攻击力 += 100
        属性.独立攻击力 += 100
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '百分比三攻 +5%<br>'
        temp += '物理攻击 +100<br>'
        temp += '魔法攻击 +100<br>'
        temp += '独立攻击 +100<br>'
        return temp       

class 装备432():
    名称 = '誓血之盟战靴'
    所属套装 = '誓血之盟'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '板甲'
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(14)
        属性.物理攻击力 += 100
        属性.魔法攻击力 += 100
        属性.独立攻击力 += 100
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.移动速度 += 0.09
        属性.释放速度 += 0.07
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '所有属性强化 +14<br>'
        temp += '物理攻击 +100<br>'
        temp += '魔法攻击 +100<br>'
        temp += '独立攻击 +100<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +9%<br>'
        temp += '释放速度 +7%<br>'
        return temp       

class 装备433(改造产物):
    名称 = '禁断契约书'
    部位 = '辅助装备'
    类型 = '特殊装备'
    力量 = 146
    智力 = 146
    关联套装 = '誓血之盟[5]'
    def 改造属性(self, 属性, x):
        属性.最终伤害加成(0.02 * x)
        if x >= 1:
            属性.伤害增加加成(0.10)
            属性.百分比力智加成(0.35)
        if x >= 3:
            属性.最终伤害加成(0.05)
            属性.百分比力智加成(0.15)
            属性.技能攻击力加成(0.20)
            属性.附加伤害加成(0.25)
        if x >= 5:
            属性.最终伤害加成(0.27)
            属性.暴击伤害加成(0.50)
            pass
    def 基础属性(self, 属性):
        属性.爆伤 = max(属性.爆伤, 0.45)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '爆伤 +45%(取最高值)<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '最终伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '伤害增加 +10%<br>'
           temp += '百分比力智 +35%<br>'
        if 改造等级 >= 3:
           temp += '最终伤害 +5%<br>'
           temp += '百分比力智 +15%<br>'
           temp += '技能攻击力 +20%<br>'
           temp += '附加伤害 +25%<br>'
        if 改造等级 >= 3:
           temp += '最终伤害 +27%<br>'
           temp += '暴击伤害 +50%<br>'
        return temp       

class 装备434():
    名称 = '天御雷罚战甲'
    所属套装 = '天御之灾'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.光属性强化加成(24)
        属性.物理攻击力 += 74
        属性.魔法攻击力 += 74
        属性.独立攻击力 += 74
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.03
        属性.魔法暴击率 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '光属性强化 +24<br>'
        temp += '物理暴击率 +3%<br>'
        temp += '魔法暴击率 +3%<br>'
        return temp     

class 装备435():
    名称 = '天御虫噬战甲'
    所属套装 = '天御之灾'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':34, '轻甲':41, '重甲':37, '板甲':34}	
    智力 = {'布甲':41, '皮甲':34, '轻甲':28, '重甲':28, '板甲':34}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.暗属性强化加成(24)
        属性.物理攻击力 += 74
        属性.魔法攻击力 += 74
        属性.独立攻击力 += 74
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.03
        属性.魔法暴击率 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '暗属性强化 +24<br>'
        temp += '物理攻击力 +74<br>'
        temp += '魔法攻击力 +74<br>'
        temp += '独立攻击力 +74<br>'
        temp += '物理暴击率 +3%<br>'
        temp += '魔法暴击率 +3%<br>'
        return temp      

class 装备436():
    名称 = '天御火袭战甲'
    所属套装 = '天御之灾'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.火属性强化加成(24)
        属性.物理攻击力 += 74
        属性.魔法攻击力 += 74
        属性.独立攻击力 += 74
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.03
        属性.魔法暴击率 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '火属性强化 +24<br>'
        temp += '物理攻击力 +74<br>'
        temp += '魔法攻击力 +74<br>'
        temp += '独立攻击力 +74<br>'
        temp += '物理暴击率 +3%<br>'
        temp += '魔法暴击率 +3%<br>'
        return temp      

class 装备437():
    名称 = '天御凝霜战甲'
    所属套装 = '天御之灾'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.冰属性强化加成(24)
        属性.物理攻击力 += 74
        属性.魔法攻击力 += 74
        属性.独立攻击力 += 74
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.03
        属性.魔法暴击率 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '冰属性强化 +24<br>'
        temp += '物理攻击力 +74<br>'
        temp += '魔法攻击力 +74<br>'
        temp += '独立攻击力 +74<br>'
        temp += '物理暴击率 +3%<br>'
        temp += '魔法暴击率 +3%<br>'
        return temp      

class 装备438():
    名称 = '天御风行战甲'
    所属套装 = '天御之灾'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.所有属性强化加成 (14)
        属性.物理攻击力 += 74
        属性.魔法攻击力 += 74
        属性.独立攻击力 += 74
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.03
        属性.魔法暴击率 += 0.03
        属性.攻击速度 += 0.08
        属性.移动速度 += 0.12
        属性.释放速度 += 0.12
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '所有属性强化 +14<br>'
        temp += '物理攻击力 +74<br>'
        temp += '魔法攻击力 +74<br>'
        temp += '独立攻击力 +74<br>'
        temp += '物理暴击率 +3%<br>'
        temp += '魔法暴击率 +3%<br>'
        temp += '攻击速度 +8%<br>'
        temp += '移动速度 +12%<br>'
        temp += '释放速度 +12%<br>'
        return temp       

class 装备439(改造产物):
    名称 = '天御万物'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    关联套装 = '天御之灾[5]'
    def 改造属性(self, 属性, x):
        属性.最终伤害加成(0.02 * x)
        if x >= 1:
            属性.百分比力智加成(0.28)
        if x >= 3:
            属性.所有属性强化加成 (50)
            属性.百分比三攻加成(0.32)
            属性.技能攻击力加成(0.20)
        if x >= 5:
            属性.最终伤害加成(0.17)
            属性.属性附加加成(0.25)
            属性.伤害增加加成(0.18)
        pass
    def 基础属性(self, 属性):
        属性.伤害增加加成(0.18)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '伤害增加 +18%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '最终伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '百分比力智 +28%<br>'
        if 改造等级 >= 3:
           temp += '所有属性强化 +50<br>'
           temp += '百分比三攻 +32%<br>'
           temp += '技能攻击力 +20%<br>'
        if 改造等级 >= 5:
           temp += '最终伤害 +17%<br>'
           temp += '属性附加 +25%<br>'
           temp += '伤害增加 +18%<br>'
        return temp     

class 装备440():
    名称 = '最佳球手的暴走战衣'
    所属套装 = '最佳球手的绝杀'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':94, '皮甲':136, '轻甲':144, '重甲':140, '板甲':136}	
    智力 = {'布甲':144, '皮甲':136, '轻甲':128, '重甲':128, '板甲':136}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.物理攻击力 += 149
        属性.魔法攻击力 += 149
        属性.独立攻击力 += 149
        属性.伤害增加加成(0.04)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '伤害增加 +4%<br>'
        temp += '物理攻击力 +149<br>'
        temp += '魔法攻击力 +149<br>'
        temp += '独立攻击力 +149<br>'
        return temp      

class 装备441():
    名称 = '最佳球手的反击护具'
    所属套装 = '最佳球手的绝杀'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':330, '皮甲':364, '轻甲':371, '重甲':367, '板甲':364}	
    智力 = {'布甲':371, '皮甲':364, '轻甲':358, '重甲':358, '板甲':364}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        return temp      

class 装备442():
    名称 = '最佳球手的奇袭长裤'
    所属套装 = '最佳球手的绝杀'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.爆伤 = max(属性.爆伤, 0.18)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '暴伤 +18%(取最大值)<br>'
        return temp  

class 装备443():
    名称 = '最佳球手的冲锋腰带'
    所属套装 = '最佳球手的绝杀'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        属性.物理攻击力 += 138
        属性.魔法攻击力 += 138
        属性.独立攻击力 += 138
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.回避率 += 0.05
        属性.物理暴击率 += 0.15
        属性.魔法暴击率 += 0.15
        属性.命中率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '物理攻击力 +138<br>'
        temp += '魔法攻击力 +138<br>'
        temp += '独立攻击力 +138<br>'
        temp += '物理暴击率 +15%<br>'
        temp += '魔法暴击率 +15%<br>'
        temp += '命中率 +5%<br>'
        temp += '回避率 +5%<br>'
        return temp     

class 装备444():
    名称 = '最佳球手的逆袭跑鞋'
    所属套装 = '最佳球手的绝杀'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '轻甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.06
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '移动速度 +6%<br>'
        return temp      

class 装备445(改造产物):
    名称 = '最佳球手之球'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    关联套装 = '最佳球手的绝杀[5]'
    def 改造属性(self, 属性, x):
        属性.百分比力智加成(0.02 * x)
        if x >= 1:
            属性.暴击伤害加成(0.35)
            属性.伤害增加加成(0.20)
        if x >= 3:
            属性.百分比力智加成(0.20)
            属性.技能攻击力加成(0.20)
            属性.伤害增加加成(0.10)
        if x >= 5:
            属性.附加伤害加成(0.65)
        pass
    def 基础属性(self, 属性):
        属性.最终伤害加成(0.45)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '最终伤害 +45%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '百分比力智 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '暴击伤害 +35%<br>'
           temp += '伤害增加 +20%<br>'
        if 改造等级 >= 3:
           temp += '百分比力智 +20%<br>'
           temp += '技能攻击力 +20%<br>'
           temp += '伤害增加 +10%<br>'
        if 改造等级 >= 5:
           temp += '附加伤害 +65%<br>'
        
        return temp

class 装备446():
    名称 = '战术之王的御敌胸甲'
    所属套装 = '战术之王的御敌'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':33, '皮甲':76, '轻甲':84, '重甲':79, '板甲':76}	
    智力 = {'布甲':84, '皮甲':76, '轻甲':67, '重甲':67, '板甲':76}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.物理攻击力 += 80
        属性.魔法攻击力 += 80
        属性.独立攻击力 += 80
        pass
    def 其它属性(self, 属性):
        属性.命中率 += 0.02
        属性.回避率 += 0.02
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '物理攻击力 +80<br>'
        temp += '魔法攻击力 +80<br>'
        temp += '独立攻击力 +80<br>'
        temp += '命中率 +2%<br>'
        temp += '回避率 +2%<br>'
        return temp   

class 装备447():
    名称 = '战术之王的御敌肩甲'
    所属套装 = '战术之王的御敌'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':33, '皮甲':67, '轻甲':74, '重甲':70, '板甲':67}	
    智力 = {'布甲':74, '皮甲':67, '轻甲':61, '重甲':61, '板甲':67}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.10
        属性.移动速度 += 0.10
        属性.释放速度 += 0.15
        属性.命中率 += 0.10
        属性.回避率 += 0.01
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        temp += '命中率 +10%<br>'
        temp += '回避率 +1%<br>'
        return temp      

class 装备448():
    名称 = '战术之王的御敌护腿'
    所属套装 = '战术之王的御敌'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':33, '皮甲':76, '轻甲':84, '重甲':79, '板甲':76}	
    智力 = {'布甲':84, '皮甲':76, '轻甲':67, '重甲':67, '板甲':76}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.12
        属性.魔法暴击率 += 0.12
        属性.命中率 += 0.02
        属性.回避率 += 0.02
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '物理暴击率 +12%<br>'
        temp += '魔法暴击率 +12%<br>'
        temp += '命中率 +2%<br>'
        temp += '回避率 +2%<br>'
        return temp     

class 装备449():
    名称 = '战术之王的御敌腰带'
    所属套装 = '战术之王的御敌'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':33, '皮甲':58, '轻甲':64, '重甲':61, '板甲':58}	
    智力 = {'布甲':64, '皮甲':58, '轻甲':53, '重甲':53, '板甲':58}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(20)
        pass
    def 其它属性(self, 属性):
        属性.命中率 += 0.01
        属性.回避率 += 0.01
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '所有属性强化 +20<br>'
        temp += '命中率 +1%<br>'
        temp += '回避率 +1%<br>'
        return temp    

class 装备450():
    名称 = '战术之王的御敌长靴'
    所属套装 = '战术之王的御敌'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':33, '皮甲':58, '轻甲':64, '重甲':61, '板甲':58}	
    智力 = {'布甲':64, '皮甲':58, '轻甲':53, '重甲':53, '板甲':58}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.力量 += 120
        属性.智力 += 120
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        属性.命中率 += 0.01
        属性.回避率 += 0.01
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '力量 +120<br>'
        temp += '智力 +120<br>'
        temp += '移动速度 +4%<br>'
        temp += '命中率 +1%<br>'
        temp += '回避率 +1%<br>'
        return temp     

class 装备451(改造产物):
    名称 = '战术之王的战术指挥棒'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    关联套装 = '战术之王的御敌[5]'
    def 改造属性(self, 属性, x):
        属性.百分比三攻加成(0.02 * x)
        if x >= 1:
            属性.最终伤害加成(0.32)
            属性.技能等级加成('所有', 60, 80, 3)
        if x >= 3:
            属性.百分比三攻加成(0.30)
            属性.技能攻击力加成(0.20)
        if x >= 5:
            属性.技能攻击力加成(0.10)
        pass
    def 基础属性(self, 属性):
        属性.爆伤 = max(属性.爆伤, 0.42)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '爆伤 +42%(取最高值)<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '百分比三攻 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '最终伤害 +32%<br>'
           temp += 'Lv60-80 技能等级+3<br>'
        if 改造等级 >= 3:
           temp += '百分比三攻 +30%<br>'
           temp += '技能攻击力 +20%<br>'
        if 改造等级 >= 5:
           temp += '技能攻击力 +10%<br>'
        return temp

class 装备452():
    名称 = '暗魅之影上衣'
    所属套装 = '杀意决'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':50, '皮甲':92, '轻甲':100, '重甲':96, '板甲':92}	
    智力 = {'布甲':100, '皮甲':92, '轻甲':84, '重甲':84, '板甲':92}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.黄字 = max(属性.黄字, 0.18)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '黄字 +18%(取最高值)<br>'
        return temp      

class 装备453():
    名称 = '冥殇之刃肩甲'
    所属套装 = '杀意决'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':33, '皮甲':67, '轻甲':74, '重甲':70, '板甲':67}	
    智力 = {'布甲':74, '皮甲':67, '轻甲':61, '重甲':61, '板甲':67}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.物理攻击力 += 66
        属性.魔法攻击力 += 66
        属性.独立攻击力 += 66
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.物理暴击率 += 0.10
        属性.魔法暴击率 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '物理攻击力 +66<br>'
        temp += '魔法攻击力 +66<br>'
        temp += '独立攻击力 +66<br>'
        temp += '攻击速度 +15%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp       

class 装备454():
    名称 = '血舞之牙护腿'
    所属套装 = '杀意决'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':50, '皮甲':92, '轻甲':100, '重甲':96, '板甲':92}	
    智力 = {'布甲':100, '皮甲':92, '轻甲':84, '重甲':84, '板甲':92}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.04)
        属性.物理攻击力 += 121
        属性.魔法攻击力 += 121
        属性.独立攻击力 += 121
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '暴击伤害 +4%<br>'
        temp += '物理攻击力 +121<br>'
        temp += '魔法攻击力 +121<br>'
        temp += '独立攻击力 +121<br>'
        return temp       

class 装备455():
    名称 = '亡灵之帐腰带'
    所属套装 = '杀意决'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':33, '皮甲':58, '轻甲':64, '重甲':61, '板甲':58}	
    智力 = {'布甲':64, '皮甲':58, '轻甲':53, '重甲':53, '板甲':58}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        属性.物理攻击力 += 116
        属性.魔法攻击力 += 116
        属性.独立攻击力 += 116
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '物理攻击力 +116<br>'
        temp += '魔法攻击力 +116<br>'
        temp += '独立攻击力 +116<br>'
        return temp      

class 装备456():
    名称 = '黄泉之风战靴'
    所属套装 = '杀意决'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':33, '皮甲':58, '轻甲':64, '重甲':61, '板甲':58}	
    智力 = {'布甲':64, '皮甲':58, '轻甲':53, '重甲':53, '板甲':58}
    类型 = '皮甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(20)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.22
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '所有属性强化 +20<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +22%<br>'
        return temp      

class 装备457(改造产物):
    名称 = '杀戮之决'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    关联套装 = '杀意决[5]'
    def 改造属性(self, 属性, x):
        属性.最终伤害加成(0.02 * x)
        if x >= 1:
            属性.技能等级加成('所有', 50, 50, 3)
            属性.技能等级加成('所有', 85, 85, 3)
            属性.技能等级加成('所有', 100, 100, 1)
            属性.所有属性强化加成(50)
        if x >= 3:
            属性.百分比力智加成(0.13)
            属性.伤害增加加成(0.30)
            属性.暴击伤害加成(0.30)
        if x >= 5:
            属性.最终伤害加成(0.10)
            属性.技能攻击力加成(0.42)
        pass
    def 基础属性(self, 属性):
        属性.百分比三攻加成(0.38)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '百分比三攻 +38%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '最终伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += 'Lv50  技能等级+3<br>'
           temp += 'Lv85  技能等级+3<br>'
           temp += 'Lv100 技能等级+1<br>'
           temp += '所有属性强化 +50<br>'
        if 改造等级 >= 3:
           temp += '百分比力智 +13%<br>'
           temp += '伤害增加 +30%<br>'       
           temp += '暴击伤害 +30%<br>'
        if 改造等级 >= 5:
           temp += '最终伤害 +10%<br>'
           temp += '技能攻击力 +42%<br>'
        return temp     

class 装备458():
    名称 = '逝魔之疾咒长袍'
    所属套装 = '逝魔之力'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.15)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '百分比三攻 +15%<br>'
        return temp      

class 装备459():
    名称 = '逝魔之灵悟肩甲'
    所属套装 = '逝魔之力'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':34, '轻甲':41, '重甲':37, '板甲':34}	
    智力 = {'布甲':41, '皮甲':34, '轻甲':28, '重甲':28, '板甲':34}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.12)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '百分比三攻 +12%<br>'
        return temp

class 装备460():
    名称 = '逝魔之爆裂长裤'
    所属套装 = '逝魔之力'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.爆伤 = max(属性.爆伤, 0.15)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '爆伤 +15%(取最大值)<br>'
        return temp     

class 装备461():
    名称 = '逝魔之灵心腰带'
    所属套装 = '逝魔之力'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.魔法暴击率 += 0.20
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '魔法暴击率 +20%<br>'
        return temp      

class 装备462():
    名称 = '逝魔之风速短靴'
    所属套装 = '逝魔之力'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':31, '皮甲':25, '轻甲':20, '重甲':20, '板甲':25}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(20)
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.16
        属性.释放速度 += 0.25
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '所有属性强化 +20<br>'
        temp += '移动速度 +16%<br>'
        temp += '释放速度 +25%<br>'
        return temp   

class 装备463(改造产物):
    名称 = '逝魔之痕'
    部位 = '项链'
    类型 = '首饰'
    力量 = 100
    智力 = 147
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    关联套装 = '逝魔之力[5]'
    def 改造属性(self, 属性, x):
        属性.暴击伤害加成(0.02 * x)
        if x >= 1:
            属性.百分比力智加成(0.40)
        if x >= 3:
            属性.所有属性强化加成(42)
            属性.伤害增加加成(0.30)
            属性.技能攻击力加成(0.28)
        if x >= 5:
            属性.技能等级加成('所有', 1, 85, 2)
            属性.技能等级加成('所有', 100, 100, 2)
            属性.技能攻击力加成(0.18)
        pass
    def 基础属性(self, 属性):
        属性.最终伤害加成(0.35)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +100<br>'
        temp += '智力 +147<br>'
        temp += '最终伤害 +35%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '暴击伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '百分比力智 +40%<br>'
        if 改造等级 >= 3:
           temp += '所有属性强化 +42<br>'
           temp += '伤害增加 +30%<br>'
           temp += '技能攻击力 +28%<br>'
        if 改造等级 >= 5:
           temp += 'Lv1-85 技能等级+2<br>'
           temp += 'Lv100  技能等级+2<br>'
           temp += '技能攻击力 +18%<br>'
        return temp       

class 装备464():
    名称 = '封霜雪影长袍'
    所属套装 = '天劫'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.冰属性强化加成(12)
    def 进图属性(self, 属性):
        属性.冰属性强化加成(44 * 天劫减抗)
        pass
    def 其它属性(self, 属性):
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '冰属性强化 +12<br>'
        if 天劫减抗 == 1:
            temp += '冰属性强化 +44<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp      

class 装备465():
    名称 = '蚀日无辉肩甲'
    所属套装 = '天劫'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':34, '轻甲':41, '重甲':37, '板甲':34}	
    智力 = {'布甲':85, '皮甲':78, '轻甲':72, '重甲':72, '板甲':78}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.光属性强化加成(12)
    def 进图属性(self, 属性):
        属性.光属性强化加成(44 * 天劫减抗)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '光属性强化 +12<br>'
        if 天劫减抗 == 1:
            temp += '光属性强化 +44<br>'
        return temp      

class 装备466():
    名称 = '火殒灭炎长裤'
    所属套装 = '天劫'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':43, '轻甲':51, '重甲':46, '板甲':43}	
    智力 = {'布甲':51, '皮甲':43, '轻甲':34, '重甲':34, '板甲':43}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.火属性强化加成(12)
    def 进图属性(self, 属性):
        属性.火属性强化加成(44 * 天劫减抗)
        pass
    def 其它属性(self, 属性):
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '火属性强化 +12<br>'
        if 天劫减抗 == 1:
            temp += '火属性强化 +44<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp     

class 装备467():
    名称 = '暗殇绝影腰带'
    所属套装 = '天劫'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':75, '皮甲':69, '轻甲':64, '重甲':64, '板甲':69}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.暗属性强化加成(12)
        pass
    def 进图属性(self, 属性):
        属性.暗属性强化加成(44 * 天劫减抗)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '暗属性强化 +12<br>'
        if 天劫减抗 == 1:
            temp += '暗属性强化 +44<br>'
        return temp      

class 装备468():
    名称 = '闲云碎步短靴'
    所属套装 = '天劫'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':25, '轻甲':31, '重甲':28, '板甲':25}	
    智力 = {'布甲':75, '皮甲':69, '轻甲':64, '重甲':64, '板甲':69}
    类型 = '布甲'
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(30)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.06
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.转甲选项 == 1:
            temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
            temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        else:
            temp += '力量 +' + str(self.力量[self.类型]) + '<br>'
            temp += '智力 +' + str(self.智力[self.类型]) + '<br>'    
        temp += '所有属性强化 +30<br>'
        temp += '移动速度 +6%<br>'
        return temp      

class 装备469(改造产物):
    名称 = '全元素水晶'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 146
    智力 = 146
    关联套装 = '天劫[5]'
    def 改造属性(self, 属性, x):
        属性.最终伤害加成(0.02 * x)
        if x >= 1:
            属性.百分比力智加成(0.15)
            属性.属性附加加成(0.35)
        if x >= 3:
            属性.暴击伤害加成(0.20)
            属性.最终伤害加成(0.26)
        if x >= 5:
            属性.技能攻击力加成(0.10)
        pass
    def 基础属性(self, 属性):
        属性.百分比力智加成(0.25)
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +146<br>'
        temp += '智力 +146<br>'
        temp += '百分比力智 +25%<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '最终伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '百分比力智 +15%<br>'
           temp += '属性附加 +35%<br>'
        if 改造等级 >= 3:
           temp += '暴击伤害 +20%<br>'
           temp += '最终伤害 +26%<br>'
        if 改造等级 >= 5:
           temp += '技能攻击力 +10%<br>'
        return temp      

class 装备470():
    名称 = '冰雪公主的霜语手镯'
    所属套装 = '冰雪公主的霜语首饰'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 41
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.冰属性强化加成(22)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +41<br>'
        temp += '冰属性强化 +22<br>'
        return temp    

class 装备471():
    名称 = '冰雪公主的霜语项链'
    所属套装 = '冰雪公主的霜语首饰'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 41
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.冰属性强化加成(30)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +41<br>'
        temp += '冰属性强化 +30<br>'
        return temp       

class 装备472():
    名称 = '冰雪公主的霜语戒指'
    所属套装 = '冰雪公主的霜语首饰'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 62
    智力 = 62
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.冰属性强化加成(30)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +62<br>'
        temp += '智力 +62<br>'
        temp += '冰属性强化 +30<br>'
        return temp       

class 装备473(改造产物):
    名称 = '冰雪公主的结晶'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    关联套装 = '冰雪公主的霜语首饰[3]'
    def 改造属性(self, 属性, x):
        属性.暴击伤害加成(0.02 * x)
        if x >= 1:
            属性.伤害增加加成(0.25)
        if x >= 3:
            属性.最终伤害加成(0.28)
            属性.百分比力智加成(0.22)
            属性.技能攻击力加成(0.15)
        if x >= 4:
            属性.最终伤害加成(0.58)
        pass
    def 基础属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '暴击伤害 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
           temp += '伤害增加 +25%<br>'
        if 改造等级 >= 3:
           temp += '最终伤害 +28%<br>'
           temp += '百分比力智 +22%<br>'
           temp += '技能攻击力 +15%<br>'
        if 改造等级 >= 5:
           temp += '最终伤害 +58%<br>'
        return temp 

class 装备474():
    名称 = '精炼的毁伤魔石手环'
    所属套装 = '精炼的异界魔石首饰'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 96
    智力 = 55
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.07)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +96<br>'
        temp += '智力 +55<br>'
        temp += '技能攻击力 +7%<br>'
        return temp       

class 装备475():
    名称 = '精炼的混沌魔石项链'
    所属套装 = '精炼的异界魔石首饰'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 41
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.黄字 = max(属性.黄字, 0.20)
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +41<br>'
        temp += '黄字 +20%(取最高值)<br>'
        return temp     

class 装备476():
    名称 = '精炼的遗忘魔石戒指'
    所属套装 = '精炼的异界魔石首饰'
    模式 = 1
    等级 = 85
    品质 = '史诗'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 62
    智力 = 62
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +62<br>'
        temp += '智力 +62<br>'
        return temp      

class 装备477(改造产物):
    名称 = '扭曲的异界魔石'
    部位 = '魔法石'
    类型 = '特殊'
    力量 = 169
    智力 = 169
    关联套装 = '精炼的异界魔石首饰[3]'
    def 改造属性(self, 属性, x):
        属性.伤害增加加成(0.02 * x)
        if x >= 1:
            属性.暴击伤害加成(0.22)
        if x >= 3:
            属性.百分比三攻加成(0.40)
            属性.伤害增加加成(0.13)
            属性.最终伤害加成(0.20)
        if x >= 4:
            属性.所有属性强化加成(57)
            属性.技能等级加成('所有', 1, 85, 2)
            属性.技能等级加成('所有', 100, 100, 2)
        pass
    def 基础属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +169<br>'
        temp += '智力 +169<br>'
        if self.关联套装 not in 属性.套装栏:
            temp += '<font color="#8C652F">改造属性未生效</font><br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '伤害增加 +' + str(2 * 改造等级) + '%<br>'
        if 改造等级 >= 1:
            temp += '暴击伤害 +22%<br>'
        if 改造等级 >= 3:
            temp += '百分比三攻 +40%<br>'
            temp += '伤害增加 +13%<br>'
            temp += '最终伤害 +20%<br>'
        if 改造等级 >= 5:
            temp += '所有属性强化 +57<br>'
            temp += 'Lv1-85 技能等级+2<br>'
            temp += 'Lv100  技能等级+2<br>'
        return temp

class 装备478():
    名称 = '感染者臂章'
    所属套装 = '无'
    模式 = 1
    等级 = 90
    品质 = '传说'
    部位 = '辅助装备'
    类型 = '特殊'
    力量 = 41
    智力 = 41
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        if 属性.职业 == '街霸':
            for i in 属性.技能栏:
                if i.是否有伤害 == 1:
                    i.中毒倍率 += 0.5
                    if 属性.角色 == '格斗家(男)':
                        i.感电倍率 += 0.5
                    else:
                        i.涂毒倍率 += 0.5
                    i.出血倍率 += 0.5
                    i.灼伤倍率 += 0.5
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +41<br>'
        temp += '智力 +41<br>'
        temp += '中毒、涂毒伤害 +50%<br>'
        temp += '感电伤害 +50%<br>'
        temp += '出血伤害 +50%<br>'
        temp += '灼伤伤害 +50%<br>'
        return temp

#endregion

#region 100光环传说
class 装备479():
    名称 = '轮回·先贤的馈赠手镯'
    模式 = 1
    所属套装 = '智慧产物'
    所属套装2 = '先贤的馈赠'
    等级 = 100
    品质 = '史诗'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 147
    智力 = 100
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.16)
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        属性.力量 += 25 * 属性.获取改造(self.部位)
        属性.智力 += 25 * 属性.获取改造(self.部位)
        属性.技能攻击力加成(0.02 * 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +147<br>'
        temp += '智力 +100<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +28<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '力量 +' + str(25 * 改造等级) + '<br>'
            temp += '智力 +' + str(25 * 改造等级) + '<br>'
            temp += '技能攻击力 +' + str(2 * 改造等级) + '%<br>'
        return temp      

class 装备480():
    名称 = '时空：先贤的馈赠手镯'
    模式 = 1
    所属套装 = '先贤的馈赠'
    等级 = 100
    品质 = '传说'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 46
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.16)
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +46<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +28<br>'
        return temp      

class 装备481():
    名称 = '先贤的馈赠项链'
    模式 = 1
    所属套装 = '先贤的馈赠'
    等级 = 100
    品质 = '传说'
    部位 = '项链'
    类型 = '首饰'
    力量 = 0
    智力 = 46
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.20)
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '智力 +46<br>'
        temp += '百分比三攻 +20%<br>'
        temp += '所有属性强化 +28<br>'
        return temp       

class 装备482():
    名称 = '先贤的馈赠戒指'
    模式 = 1
    所属套装 = '先贤的馈赠'
    等级 = 100
    品质 = '传说'
    部位 = '戒指'
    类型 = '首饰'
    力量 = 68
    智力 = 68
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.16)
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +68<br>'
        temp += '智力 +68<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +28<br>'
        return temp      

class 装备483():
    名称 = '轮回·鲜红血纹皮甲胸铠'
    模式 = 1
    所属套装 = '智慧产物'
    所属套装2 = '鲜红血纹'
    等级 = 100
    品质 = '史诗'
    部位 = '上衣'
    力量 = {'布甲':100, '皮甲':149, '轻甲':158, '重甲':154, '板甲':149}
    智力 = {'布甲':158, '皮甲':149, '轻甲':139, '重甲':139, '板甲':149}
    类型 = '皮甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.20)
        属性.暴击伤害加成(0.15)
        pass
    def 进图属性(self, 属性):
        属性.力量 += 25 * 属性.获取改造(self.部位)
        属性.智力 += 25 * 属性.获取改造(self.部位)
        属性.技能攻击力加成(0.02 * 属性.获取改造(self.部位))
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +20%<br>'
        temp += '暴击伤害 +15%<br>'
        改造等级 = 属性.获取改造(self.部位)
        if 改造等级 > 0:
            temp += '<font color="#FF8200">改造属性(+' + str(改造等级) + ')：</font><br>'
            temp += '力量 +' + str(25 * 改造等级) + '<br>'
            temp += '智力 +' + str(25 * 改造等级) + '<br>'
            temp += '技能攻击力 +' + str(2 * 改造等级) + '%<br>'
        return temp      

class 装备484():
    名称 = '时空：鲜红血纹皮甲胸铠'
    模式 = 1
    所属套装 = '鲜红血纹'
    等级 = 100
    品质 = '传说'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':47, '轻甲':57, '重甲':52, '板甲':47}
    智力 = {'布甲':57, '皮甲':47, '轻甲':37, '重甲':37, '板甲':47}
    类型 = '皮甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.14)
        属性.暴击伤害加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +14%<br>'
        temp += '暴击伤害 +15%<br>'
        return temp  

class 装备485():
    名称 = '鲜红血纹皮甲护肩'
    模式 = 1
    所属套装 = '鲜红血纹'
    等级 = 100
    品质 = '传说'
    部位 = '头肩'
    力量 = {'布甲':0, '皮甲':39, '轻甲':45, '重甲':42, '板甲':39}
    智力 = {'布甲':45, '皮甲':39, '轻甲':31, '重甲':31, '板甲':39}
    类型 = '皮甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.05)
        属性.百分比三攻加成(0.04)
        属性.百分比力智加成(0.12)
        属性.所有属性强化加成(10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +5%<br>'
        temp += '百分比三攻 +4%<br>'
        temp += '百分比力智 +12%<br>'
        temp += '所有属性强化 +10<br>'
        return temp    

class 装备486():
    名称 = '鲜红血纹皮甲护腿'
    模式 = 1
    所属套装 = '鲜红血纹'
    等级 = 100
    品质 = '传说'
    部位 = '下装'
    力量 = {'布甲':0, '皮甲':47, '轻甲':57, '重甲':52, '板甲':47}
    智力 = {'布甲':57, '皮甲':47, '轻甲':37, '重甲':37, '板甲':47}
    类型 = '皮甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.09)
        属性.暴击伤害加成(0.15)
        属性.所有属性强化加成(14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +9%<br>'
        temp += '暴击伤害 +15%<br>'
        temp += '所有属性强化 +14<br>'
        return temp    

class 装备487():
    名称 = '鲜红血纹皮甲腰带'
    模式 = 1
    所属套装 = '鲜红血纹'
    等级 = 100
    品质 = '传说'
    部位 = '腰带'
    力量 = {'布甲':0, '皮甲':29, '轻甲':34, '重甲':31, '板甲':29}
    智力 = {'布甲':34, '皮甲':29, '轻甲':23, '重甲':23, '板甲':29}
    类型 = '皮甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.05)
        属性.百分比三攻加成(0.04)
        属性.百分比力智加成(0.12)
        属性.所有属性强化加成(10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +5%<br>'
        temp += '百分比三攻 +4%<br>'
        temp += '百分比力智 +12%<br>'
        temp += '所有属性强化 +10<br>'
        return temp   

class 装备488():
    名称 = '鲜红血纹皮甲战靴'
    模式 = 1
    所属套装 = '鲜红血纹'
    等级 = 100
    品质 = '传说'
    部位 = '鞋'
    力量 = {'布甲':0, '皮甲':29, '轻甲':34, '重甲':31, '板甲':29}
    智力 = {'布甲':34, '皮甲':29, '轻甲':23, '重甲':23, '板甲':29}
    类型 = '皮甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.05)
        属性.百分比三攻加成(0.04)
        属性.百分比力智加成(0.12)
        属性.所有属性强化加成(10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '附加伤害 +5%<br>'
        temp += '百分比三攻 +4%<br>'
        temp += '百分比力智 +12%<br>'
        temp += '所有属性强化 +10<br>'
        temp += '移动速度 +4%<br>'
        return temp
class 装备489():
    名称 = '先贤的馈赠手镯'
    模式 = 1
    所属套装 = '先贤的馈赠'
    等级 = 100
    品质 = '传说'
    部位 = '手镯'
    类型 = '首饰'
    力量 = 46
    智力 = 0
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.16)
        属性.所有属性强化加成(28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +46<br>'
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +28<br>'
        return temp
class 装备490():
    名称 = '鲜红血纹皮甲胸铠'
    模式 = 1
    所属套装 = '鲜红血纹'
    等级 = 100
    品质 = '传说'
    部位 = '上衣'
    力量 = {'布甲':0, '皮甲':47, '轻甲':57, '重甲':52, '板甲':47}
    智力 = {'布甲':57, '皮甲':47, '轻甲':37, '重甲':37, '板甲':47}
    类型 = '皮甲'
    物理攻击力 = 0
    魔法攻击力 = 0
    独立攻击力 = 0
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.09)
        属性.暴击伤害加成(0.15)
        属性.所有属性强化加成(14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '力量 +' + str(self.力量[属性.防具类型]) + '<br>'
        temp += '智力 +' + str(self.智力[属性.防具类型]) + '<br>'
        temp += '伤害增加 +9%<br>'
        temp += '暴击伤害 +15%<br>'
        temp += '所有属性强化 +14<br>'
        return temp
#endregion

#region  暗黑圣战之溯回武器
class 暗黑圣战之溯回武器():
    模式 = 1
    所属套装 = '无'
    等级 = 100
    品质 = '传说'
    部位 = '武器'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.30)
        属性.技能攻击力加成(0.52)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        if self.力量 != 0:
            temp += '力量 +' + str(self.力量) + '<br>'
        if self.智力 != 0:
            temp += '智力 +' + str(self.智力) + '<br>'
        temp += '物理攻击力 +' + str(self.物理攻击力) + '<br>'
        temp += '魔法攻击力 +' + str(self.魔法攻击力) + '<br>'
        temp += '独立攻击力 +' + str(self.独立攻击力) + '<br>'
        temp += '技能攻击力 +52%<br>'
        temp += '最终伤害 +30%<br>'
        return temp        

class 装备491(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：短剑'
    类型 = '短剑'
    力量 = 0
    智力 = 78
    物理攻击力 = 1113
    魔法攻击力 = 1348
    独立攻击力 = 719

class 装备492(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：太刀'
    类型 = '太刀'
    力量 = 78
    智力 = 117
    物理攻击力 = 1113
    魔法攻击力 = 1230
    独立攻击力 = 719

class 装备493(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：钝器'
    类型 = '钝器'
    力量 = 117
    智力 = 0
    物理攻击力 = 1289
    魔法攻击力 = 1113
    独立攻击力 = 719

class 装备494(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：巨剑'
    类型 = '巨剑'
    力量 = 78
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备495(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：光剑'
    类型 = '光剑'
    力量 = 78
    智力 = 0
    物理攻击力 = 1089
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备496(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：手套'
    类型 = '手套'
    力量 = 0
    智力 = 78
    物理攻击力 = 1113
    魔法攻击力 = 1348
    独立攻击力 = 719

class 装备497(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：臂铠'
    类型 = '臂铠'
    力量 = 117
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备498(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：爪'
    类型 = '爪'
    力量 = 78
    智力 = 39
    物理攻击力 = 1172
    魔法攻击力 = 1172
    独立攻击力 = 719

class 装备499(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：拳套'
    类型 = '拳套'
    力量 = 78
    智力 = 0
    物理攻击力 = 1230
    魔法攻击力 = 1113
    独立攻击力 = 719

class 装备500(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：东方棍'
    类型 = '东方棍'
    力量 = 78
    智力 = 117
    物理攻击力 = 1113
    魔法攻击力 = 1172
    独立攻击力 = 719

class 装备501(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：左轮枪'
    类型 = '左轮枪'
    力量 = 78
    智力 = 0
    物理攻击力 = 1178
    魔法攻击力 = 991
    独立攻击力 = 719

class 装备502(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：自动手枪'
    类型 = '自动手枪'
    力量 = 0
    智力 = 78
    物理攻击力 = 826
    魔法攻击力 = 1211
    独立攻击力 = 719

class 装备503(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：步枪'
    类型 = '步枪'
    力量 = 78
    智力 = 117
    物理攻击力 = 1266
    魔法攻击力 = 1101
    独立攻击力 = 719

class 装备504(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：手炮'
    类型 = '手炮'
    力量 = 117
    智力 = 0
    物理攻击力 = 1376
    魔法攻击力 = 826
    独立攻击力 = 719

class 装备505(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：手弩'
    类型 = '手弩'
    力量 = 78
    智力 = 39
    物理攻击力 = 991
    魔法攻击力 = 1101
    独立攻击力 = 719

class 装备506(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：矛'
    类型 = '矛'
    力量 = 117
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 996
    独立攻击力 = 719

class 装备507(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：棍棒'
    类型 = '棍棒'
    力量 = 78
    智力 = 78
    物理攻击力 = 1265
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备508(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：魔杖'
    类型 = '魔杖'
    力量 = 0
    智力 = 117
    物理攻击力 = 1055
    魔法攻击力 = 1289
    独立攻击力 = 719

class 装备509(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：法杖'
    类型 = '法杖'
    力量 = 0
    智力 = 78
    物理攻击力 = 1113
    魔法攻击力 = 1406
    独立攻击力 = 719

class 装备510(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：扫把'
    类型 = '扫把'
    力量 = 0
    智力 = 78
    物理攻击力 = 1172
    魔法攻击力 = 1289
    独立攻击力 = 719

class 装备511(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：十字架'
    类型 = '十字架'
    力量 = 0
    智力 = 78
    物理攻击力 = 1172
    魔法攻击力 = 1113
    独立攻击力 = 719

class 装备512(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：念珠'
    类型 = '念珠'
    力量 = 0
    智力 = 117
    物理攻击力 = 1055
    魔法攻击力 = 1348
    独立攻击力 = 719

class 装备513(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：图腾'
    类型 = '图腾'
    力量 = 117
    智力 = 0
    物理攻击力 = 1230
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备514(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：镰刀'
    类型 = '镰刀'
    力量 = 78
    智力 = 78
    物理攻击力 = 1113
    魔法攻击力 = 1172
    独立攻击力 = 719

class 装备515(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：战斧'
    类型 = '战斧'
    力量 = 78
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 996
    独立攻击力 = 719

class 装备516(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：匕首'
    类型 = '匕首'
    力量 = 78
    智力 = 0
    物理攻击力 = 1110
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备517(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：双剑'
    类型 = '双剑'
    力量 = 78
    智力 = 0
    物理攻击力 = 1279
    魔法攻击力 = 937
    独立攻击力 = 719

class 装备518(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：手杖'
    类型 = '手杖'
    力量 = 0
    智力 = 78
    物理攻击力 = 1033
    魔法攻击力 = 1348
    独立攻击力 = 719

class 装备519(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：苦无'
    类型 = '苦无'
    力量 = 0
    智力 = 117
    物理攻击力 = 979
    魔法攻击力 = 1289
    独立攻击力 = 719

class 装备520(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：长枪'
    类型 = '长枪'
    力量 = 117
    智力 = 0
    物理攻击力 = 1230
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备521(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：战戟'
    类型 = '战戟'
    力量 = 78
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 996
    独立攻击力 = 719

class 装备522(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：光枪'
    类型 = '光枪'
    力量 = 78
    智力 = 78
    物理攻击力 = 1113
    魔法攻击力 = 1348
    独立攻击力 = 719

class 装备523(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：暗矛'
    类型 = '暗矛'
    力量 = 78
    智力 = 117
    物理攻击力 = 1113
    魔法攻击力 = 1230
    独立攻击力 = 719

class 装备524(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：长刀'
    类型 = '长刀'
    力量 = 78
    智力 = 78
    物理攻击力 = 1265
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备525(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：小太刀'
    类型 = '小太刀'
    力量 = 78
    智力 = 39
    物理攻击力 = 1172
    魔法攻击力 = 1172
    独立攻击力 = 719

class 装备526(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：重剑'
    类型 = '重剑'
    力量 = 78
    智力 = 0
    物理攻击力 = 1406
    魔法攻击力 = 1055
    独立攻击力 = 719

class 装备527(暗黑圣战之溯回武器):
    名称 = '暗黑圣战之溯回：源力剑'
    类型 = '源力剑'
    力量 = 0
    智力 = 78
    物理攻击力 = 1113
    魔法攻击力 = 1348
    独立攻击力 = 719

#endregion

#region  防具套装
class 套装效果0():
    名称 = '遗忘魔法师的馈赠'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.14)
        属性.技能攻击力加成(0.14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '最终伤害 +14%<br>'
        temp += '技能攻击力 +14%<br>'
        return temp     

class 套装效果1():
    名称 = '死亡阴影'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.14)
        属性.所有属性强化加成(55)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.10
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +14%<br>'
        temp += '所有属性强化 +55<br>'
        temp += '攻击速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        return temp    

class 套装效果2():
    名称 = '贫瘠沙漠的遗产'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.22)
        if 属性.贫瘠沙漠的遗产 != 0:
            属性.技能攻击力加成(0 + 属性.技能栏空位 / 100)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +22%<br>'
        if 属性.贫瘠沙漠的遗产 != 0:
            temp += '技能攻击力 +' +str(属性.技能栏空位) +'%<br>'
        return temp  

class 套装效果3():
    名称 = '噩梦：地狱之路'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.16)
        属性.最终伤害加成(0.06)
        属性.技能攻击力加成(0.06)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +16%<br>'
        temp += '最终伤害 +6%<br>'
        temp += '技能攻击力 +6%<br>'
        return temp     

class 套装效果4():
    名称 = '永恒不息之路'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.32)
        属性.技能倍率加成(60, 0.20)
        属性.技能冷却缩减(60, 60, -0.30)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +32%<br>'
        temp += 'Lv60技能：<br>攻击力 +20% CD +30%<br>'
        return temp       

class 套装效果5():
    名称 = '天堂舞姬'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.17)
        属性.最终伤害加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +17%<br>'
        temp += '最终伤害 +10%<br>'
        return temp     

class 套装效果6():
    名称 = '皇家裁决者宣言'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.16)
        属性.所有属性强化加成(52)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.命中率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +16%<br>'
        temp += '所有属性强化 +52<br>'
        temp += '命中率 +5%<br>'
        return temp    

class 套装效果7():
    名称 = '炙炎之盛宴'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.18)
        属性.所有属性强化加成(40)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +18%<br>'
        temp += '所有属性强化 +40<br>'
        return temp  

class 套装效果8():
    名称 = '传奇铁匠-封神'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.14)
        属性.最终伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +14%<br>'
        temp += '最终伤害 +14%<br>'
        return temp     

class 套装效果9():
    名称 = '命运歧路'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.15)
        属性.附加伤害加成(0.13)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +15%<br>'
        temp += '附加伤害 +13%<br>'
        return temp   

class 套装效果10():
    名称 = '古代祭祀的神圣仪式'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.08)
        属性.伤害增加加成(0.21)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.回避率 += 0.06
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +8%<br>'
        temp += '伤害增加 +21%<br>'
        temp += '回避率 +6%<br>'
        return temp      

class 套装效果11():
    名称 = '龙血玄黄'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.23)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.1
        属性.魔法暴击率 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +23%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp    

class 套装效果12():
    名称 = '擎天战甲'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.14)
        属性.暴击伤害加成(0.14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +14%<br>'
        temp += '暴击伤害 +14%<br>'
        return temp      

class 套装效果13():
    名称 = '荆棘漫天'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.12)
        属性.暴击伤害加成(0.11)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.10
        属性.魔法暴击率 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +12%<br>'
        temp += '暴击伤害 +11%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp

class 套装效果14():
    名称 = '大自然的呼吸'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.16)
        属性.暴击伤害加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +16%<br>'
        temp += '暴击伤害 +15%<br>'
        return temp     

class 套装效果15():
    名称 = '遗忘魔法师的馈赠'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.22)
        属性.暴击伤害加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +22%<br>'
        temp += '暴击伤害 +10%<br>'
        return temp      

class 套装效果16():
    名称 = '死亡阴影'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.14)
        属性.技能攻击力加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '最终伤害 +14%<br>'
        temp += '技能攻击力 +16%<br>'
        return temp

class 套装效果17():
    名称 = '贫瘠沙漠的遗产'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.15)
        属性.所有属性强化加成(60)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '技能攻击力 +15%<br>'
        temp += '所有属性强化 +60<br>'
        return temp

class 套装效果18():
    名称 = '噩梦：地狱之路'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(66)
        属性.技能等级加成('所有', 1, 85, 1) 
        属性.技能等级加成('所有', 100, 100, 1) 
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '所有属性强化 +66<br>'
        temp += 'Lv1-85 技能等级+1<br>'
        temp += 'Lv100  技能等级+1<br>'
        return temp    

class 套装效果19():
    名称 = '永恒不息之路'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.32)
        属性.技能倍率加成(70, 0.20)
        属性.技能冷却缩减(70, 70, -0.30)    
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '最终伤害 +32%<br>'
        temp += 'Lv70技能：<br>攻击力 +20% CD +30%<br>'
        return temp     

class 套装效果20():
    名称 = '天堂舞姬'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.11)
        属性.伤害增加加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.10
        属性.移动速度 += 0.10
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +11%<br>'
        temp += '伤害增加 +16%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        return temp     

class 套装效果21():
    名称 = '皇家裁决者宣言'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.15)
        属性.所有属性强化加成(62)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.移动速度 += 0.05
        属性.释放速度 += 0.08
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +15%<br>'
        temp += '所有属性强化 +62<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +5%<br>'
        temp += '释放速度 +8%<br>'
        return temp  

class 套装效果22():
    名称 = '炙炎之盛宴'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.10)
        属性.技能攻击力加成(0.20)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +10%<br>'
        temp += '技能攻击力 +20%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp    

class 套装效果23():
    名称 = '传奇铁匠-封神'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.21)
        if 属性.装备检查('天堂之翼'):
            属性.技能冷却缩减(1, 45, 0.30)
            属性.技能冷却缩减(60, 80, 0.30)
        else:
            属性.技能冷却缩减(1, 45, 0.20)
            属性.技能冷却缩减(60, 80, 0.20)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +21%<br>'
        if 属性.装备检查('天堂之翼'):
            temp += 'Lv1-45  技能CD-30%<br>'
            temp += 'Lv60-80 技能CD-30%<br>'
        else:
            temp += 'Lv1-45  技能CD-20%<br>'
            temp += 'Lv60-80 技能CD-20%<br>'
        return temp    

class 套装效果24():
    名称 = '命运歧路'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.12)
        属性.暴击伤害加成(0.17)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.21
        属性.移动速度 += 0.21
        属性.释放速度 += 0.315  
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +12%<br>'
        temp += '暴击伤害 +17%<br>'
        temp += '攻击速度 +21%<br>'
        temp += '移动速度 +21%<br>'
        temp += '释放速度 +31.5%<br>'
        return temp   

class 套装效果25():
    名称 = '古代祭祀的神圣仪式'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.08)
        属性.附加伤害加成(0.21)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +8%<br>'
        temp += '附加伤害 +21%<br>'
        return temp 

class 套装效果26():
    名称 = '龙血玄黄'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.24)
        属性.所有属性强化加成(24)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +24%<br>'
        temp += '所有属性强化 +24<br>'
        return temp    

class 套装效果27():
    名称 = '擎天战甲'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.32)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +32%<br>'
        return temp     

class 套装效果28():
    名称 = '荆棘漫天'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.25)
        属性.技能冷却缩减(1, 45, 0.15)
        属性.技能冷却缩减(60, 80, 0.15)
        属性.技能冷却缩减(90, 95, 0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +25%<br>'
        temp += 'Lv1-45  技能CD-15%<br>'
        temp += 'Lv60-80 技能CD-15%<br>'
        temp += 'Lv90-95 技能CD-15%<br>'
        return temp 

class 套装效果29():
    名称 = '大自然的呼吸'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.15)
        属性.技能攻击力加成(0.13)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.移动速度 += 0.05
        属性.释放速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +15%<br>'
        temp += '技能攻击力 +13%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +5%<br>'
        temp += '释放速度 +10%<br>'
        return temp      

class 套装效果30():
    名称 = '遗忘魔法师的馈赠'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.13)
        属性.技能等级加成('所有', 1, 85, 2)
        属性.技能等级加成('所有', 100, 100, 2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +13%<br>'
        temp += 'Lv1-85 技能等级+2<br>'
        temp += 'Lv100  技能等级+2<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp   

class 套装效果31():
    名称 = '死亡阴影'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.46)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '技能攻击力 +46%<br>'
        return temp
class 套装效果32():
    名称 = '贫瘠沙漠的遗产'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.42)
        if 属性.贫瘠沙漠的遗产 == 2:
            属性.技能攻击力加成(0.04)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '技能攻击力 +42%<br>'
        if 属性.贫瘠沙漠的遗产 == 2:
            temp += '技能攻击力 +4%<br>'
        return temp      

class 套装效果33():
    名称 = '噩梦：地狱之路'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.46)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '技能攻击力 +46%<br>'
        return temp    

class 套装效果34():
    名称 = '永恒不息之路'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.23)
        属性.伤害增加加成(0.20)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.释放速度 += 0.225
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +23%<br>'
        temp += '伤害增加 +20%<br>'
        temp += '攻击速度 +15%<br>'
        temp += '释放速度 +22.5%<br>'
        return temp       

class 套装效果35():
    名称 = '天堂舞姬'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.12)
        属性.技能攻击力加成(0.20)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.10
        属性.魔法暴击率 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +12%<br>'
        temp += '技能攻击力 +20%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp 

class 套装效果36():
    名称 = '皇家裁决者宣言'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.属性附加加成(0.20)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '属性附加 +20%<br>'
        return temp  

class 套装效果37():
    名称 = '炙炎之盛宴'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.22)
        属性.技能冷却缩减(1, 100, 0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.攻击速度 += 0.05
        属性.移动速度 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '最终伤害 +22%<br>'
        temp += 'Lv1-100 技能CD-15%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +5%<br>'
        return temp
      

class 套装效果38():
    名称 = '传奇铁匠-封神'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.27)
        属性.技能冷却缩减(50, 50, 0.30)
        属性.技能冷却缩减(85, 85, 0.30)
        属性.技能冷却缩减(100, 100, 0.17)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        属性.释放速度 += 0.20
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +27%<br>'
        temp += 'Lv50  技能CD-30%<br>'
        temp += 'Lv85  技能CD-30%<br>'
        temp += 'Lv100 技能CD-17%<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        temp += '释放速度 +20%<br>'
        return temp    

class 套装效果39():
    名称 = '命运歧路'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.11)
        属性.最终伤害加成(0.30)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +11%<br>'
        temp += '最终伤害 +30%<br>'
        return temp

class 套装效果40():
    名称 = '古代祭祀的神圣仪式'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.21)
        属性.技能攻击力加成(0.25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +21%<br>'
        temp += '技能攻击力 +25%<br>'
        return temp     

class 套装效果41():
    名称 = '龙血玄黄'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            属性.附加伤害加成(0.41)
        else:
            属性.附加伤害加成(0.40)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        属性.释放速度 += 0.225
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.角色熟练度 == 0 or 属性.装备检查('战无不胜上衣'):
            temp += '附加伤害 +41%<br>'
        else:
            temp += '附加伤害 +40%<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        temp += '释放速度 +22.5%<br>'
        return temp 

class 套装效果42():
    名称 = '擎天战甲'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.属性附加加成(0.12)
        if 属性.擎天战甲 == 0:
            属性.技能攻击力加成(0.05)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.擎天战甲 == 0:
            属性.攻击速度 += 0.2
            属性.移动速度 += 0.2
            属性.释放速度 += 0.3
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '属性附加 +12%<br>'
        if 属性.擎天战甲 == 0:
            temp += '技能攻击力 +5%<br>'
            temp += '攻击速度 +20%<br>'
            temp += '移动速度 +20%<br>'
            temp += '释放速度 +30%<br>'
        return temp      

class 套装效果43():
    名称 = '荆棘漫天'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.10)
        属性.技能攻击力加成(0.28)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.1
        属性.移动速度 += -0.02
        属性.释放速度 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +10%<br>'
        temp += '技能攻击力 +28%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 -2%<br>'
        temp += '释放速度 +10%<br>'
        return temp       

class 套装效果44():
    名称 = '大自然的呼吸'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.11)
        属性.技能攻击力加成(0.10)
        属性.所有属性强化加成(64)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.10
        属性.魔法暴击率 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '最终伤害 +11%<br>'
        temp += '技能攻击力 +10%<br>'
        temp += '所有属性强化 +64<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp
#endregion

#region  散搭套装
class 套装效果45():
    名称 = '深渊窥视者'
    件数 = 2
    类型 = '上链左'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.09)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 1, 48, 2)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +9%<br>'
        temp += 'Lv1-48 技能等级+2<br>'
        return temp    

class 套装效果46():
    名称 = '圣者的黄昏'
    件数 = 2
    类型 = '上链左'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.11)
        属性.附加伤害加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +11%<br>'
        temp += '附加伤害 +10%<br>'
        temp += '移动速度 +5%<br>'
        return temp     

class 套装效果47():
    名称 = '坎坷命运'
    件数 = 2
    类型 = '上链左'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.14)
        属性.技能攻击力加成(0.09)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.03
        属性.移动速度 += 0.03
        属性.释放速度 += 0.045
        if 属性.装备检查('地狱边缘'):
            属性.攻击速度 -= 0.01
            属性.移动速度 -= 0.01
            属性.释放速度 -= 0.015
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +14%<br>'
        temp += '技能攻击力 +9%<br>'
        temp += '攻击速度 +3%<br>'
        temp += '移动速度 +3%<br>'
        temp += '释放速度 +4.5%<br>'
        if 属性.装备检查('地狱边缘'):
            temp += '攻击速度 -1%<br>'
            temp += '移动速度 -1%<br>'
            temp += '释放速度 -1.5%<br>'
        return temp    

class 套装效果48():
    名称 = '吞噬愤怒'
    件数 = 2
    类型 = '上链左'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.10)
        属性.暴击伤害加成(0.11)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('灭世之怒'):
            属性.攻击速度 += 0.15
            属性.移动速度 += 0.15
            属性.释放速度 += 0.225
        else:
            属性.攻击速度 += 0.10
            属性.移动速度 += 0.10
            属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +10%<br>'
        temp += '暴击伤害 +11%<br>'
        if 属性.装备检查('灭世之怒'):
            temp += '攻击速度 +15%<br>'
            temp += '移动速度 +15%<br>'
            temp += '释放速度 +22.5%<br>'
        else:
            temp += '攻击速度 +10%<br>'
            temp += '移动速度 +10%<br>'
            temp += '释放速度 +15%<br>'
        return temp   

class 套装效果49():
    名称 = '黑魔法探求者'
    件数 = 2
    类型 = '镯下右'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.12)
        属性.技能攻击力加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +12%<br>'
        temp += '技能攻击力 +10%<br>'
        return temp        

class 套装效果50():
    名称 = '时空旅行者'
    件数 = 2
    类型 = '镯下右'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.10)
        属性.最终伤害加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +10%<br>'
        temp += '最终伤害 +10%<br>'
        return temp

class 套装效果51():
    名称 = '穿透命运的呐喊'
    件数 = 2
    类型 = '镯下右'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.23)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +23%<br>'
        return temp    

class 套装效果52():
    名称 = '狂乱追随者'
    件数 = 2
    类型 = '镯下右'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.18)
        属性.所有属性强化加成(25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.释放速度 += 0.225
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +18%<br>'
        temp += '所有属性强化 +25<br>'
        temp += '攻击速度 +15%<br>'
        temp += '释放速度 +22.5%<br>'
        return temp  

class 套装效果53():
    名称 = '地狱求道者'
    件数 = 2
    类型 = '环鞋指'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.10)
        属性.最终伤害加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +10%<br>'
        temp += '最终伤害 +10%<br>'
        return temp 

class 套装效果54():
    名称 = '次元旅行者'
    件数 = 2
    类型 = '环鞋指'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.22)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.10
        属性.魔法暴击率 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +22%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp

class 套装效果55():
    名称 = '天命无常'
    件数 = 2
    类型 = '环鞋指'
    def 城镇属性(self, 属性):
        属性.伤害增加加成(0.07)
        属性.附加伤害加成(0.08)
        属性.技能攻击力加成(0.05)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.天命无常 == 0:
            if 属性.装备检查('命运反抗者'):
                属性.移动速度 += 0.08
                属性.攻击速度 += 0.08
                属性.释放速度 += 0.12
            else:
                属性.移动速度 += 0.07
                属性.攻击速度 += 0.07
                属性.释放速度 += 0.105
        else:
            属性.移动速度 += 0.02 * 属性.天命无常
            属性.攻击速度 += 0.02 * 属性.天命无常
            属性.释放速度 += 0.03 * 属性.天命无常
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '伤害增加 +7%<br>'
        temp += '附加伤害 +8%<br>'
        temp += '技能攻击力 +5%<br>'
        if 属性.天命无常 == 0:
            if 属性.装备检查('命运反抗者'):
                temp += '移动速度 +8%<br>'
                temp += '攻击速度 +8%<br>'
                temp += '释放速度 +12%<br>'
            else:
                temp += '移动速度 +7%<br>'
                temp += '攻击速度 +7%<br>'
                temp += '释放速度 +10.5%<br>'
        else:
            temp += '移动速度 +' +str(2*属性.天命无常) +'%<br>'
            temp += '攻击速度 +' +str(2*属性.天命无常) +'%<br>'
            temp += '释放速度 +' +str(3*属性.天命无常) +'%<br>'
        return temp     

class 套装效果56():
    名称 = '悲剧的残骸'
    件数 = 2
    类型 = '环鞋指'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.23)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '最终伤害 +23%<br>'
        return temp
     

class 套装效果57():
    名称 = '深渊窥视者'
    件数 = 3
    类型 = '上链左'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.13)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 60, 80, 2)
        属性.技能等级加成('所有', 50, 50, 1)
        属性.技能等级加成('所有', 85, 85, 1)
        属性.技能等级加成('所有', 100, 100, 1)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '技能攻击力 +13%<br>'
        temp += 'Lv60-80 技能等级+2<br>'
        temp += 'Lv50  技能等级+1<br>'
        temp += 'Lv85  技能等级+1<br>'
        temp += 'Lv100 技能等级+1<br>'
        return temp       

class 套装效果58():
    名称 = '圣者的黄昏'
    件数 = 3
    类型 = '上链左'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.05)
        属性.技能攻击力加成(0.12)
        属性.所有属性强化加成(32)
        属性.技能冷却缩减(1, 45, 0.10)
        属性.技能冷却缩减(60, 80, 0.10)
        属性.技能冷却缩减(90, 95, 0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.移动速度 += 0.05
        属性.物理暴击率 += 0.15
        属性.魔法暴击率 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +5%<br>'
        temp += '技能攻击力 +12%<br>'
        temp += '所有属性强化 +32<br>'
        temp += 'Lv1-45  技能CD-10%<br>'
        temp += 'Lv60-80 技能CD-10%<br>'
        temp += 'Lv90-95 技能CD-10%<br>'
        temp += '移动速度 +5%<br>'
        temp += '物理暴击率 +15%<br>'
        temp += '魔法暴击率 +15%<br>'
        return temp      

class 套装效果59():
    名称 = '坎坷命运'
    件数 = 3
    类型 = '上链左'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.20)
        属性.技能攻击力加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.03
        属性.移动速度 += 0.03
        属性.释放速度 += 0.045
        if 属性.装备检查('地狱边缘'):
            属性.攻击速度 -= 0.01
            属性.移动速度 -= 0.01
            属性.释放速度 -= 0.015
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +20%<br>'
        temp += '技能攻击力 +10%<br>'
        temp += '攻击速度 +3%<br>'
        temp += '移动速度 +3%<br>'
        temp += '释放速度 +4.5%<br>'
        if 属性.装备检查('地狱边缘'):
            temp += '攻击速度 -1%<br>'
            temp += '移动速度 -1%<br>'
            temp += '释放速度 -1.5%<br>'
        return temp     

class 套装效果60():
    名称 = '吞噬愤怒'
    件数 = 3
    类型 = '上链左'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.30)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +30%<br>'
        return temp     

class 套装效果61():
    名称 = '黑魔法探求者'
    件数 = 3
    类型 = '镯下右'
    def 城镇属性(self, 属性):
        属性.属性附加加成(0.13)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.10
        属性.魔法暴击率 += 0.1
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '属性附加 +13%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp       

class 套装效果62():
    名称 = '时空旅行者'
    件数 = 3
    类型 = '镯下右'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.17)
        属性.技能攻击力加成(0.13)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +17%<br>'
        temp += '技能攻击力 +13%<br>'
        return temp    

class 套装效果63():
    名称 = '穿透命运的呐喊'
    件数 = 3
    类型 = '镯下右'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.14)
        属性.技能攻击力加成(0.16)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +14%<br>'
        temp += '技能攻击力 +16%<br>'
        return temp

class 套装效果64():
    名称 = '狂乱追随者'
    件数 = 3
    类型 = '镯下右'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.16)
        属性.技能攻击力加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +16%<br>'
        temp += '技能攻击力 +15%<br>'
        return temp     

class 套装效果65():
    名称 = '地狱求道者'
    件数 = 3
    类型 = '环鞋指'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.16)
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(40)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.15
        属性.移动速度 += 0.15
        属性.释放速度 += 0.20
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '技能攻击力 +16%<br>'
        temp += '所有属性强化 +40<br>'
        temp += '攻击速度 +15%<br>'
        temp += '移动速度 +15%<br>'
        temp += '释放速度 +20%<br>'
        return temp

class 套装效果66():
    名称 = '次元旅行者'
    件数 = 3
    类型 = '环鞋指'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.10)
        属性.技能攻击力加成(0.18)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +10%<br>'
        temp += '技能攻击力 +18%<br>'
        return temp     

class 套装效果67():
    名称 = '天命无常'
    件数 = 3
    类型 = '环鞋指'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.10)
        属性.技能攻击力加成(0.07)
        属性.百分比力智加成(0.07)
        if 属性.天命无常 == 0:
            if 属性.装备检查('命运反抗者'):
                属性.百分比力智加成(0.056)
            else:
                属性.百分比力智加成(0.046666667)
        if 属性.天命无常 == 4 or 属性.天命无常 == 5:
            属性.百分比力智加成(0.07)
        if 属性.天命无常 == 6:
            属性.百分比力智加成(0.14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.天命无常 == 0:
            if 属性.装备检查('命运反抗者'):
                属性.移动速度 += 0.066
                属性.攻击速度 += 0.066
            else:
                属性.移动速度 += 0.055
                属性.攻击速度 += 0.055 
        if 属性.天命无常 >= 4:
            属性.移动速度 += 0.03 * 属性.天命无常
            属性.攻击速度 += 0.03 * 属性.天命无常
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +10%<br>'
        temp += '技能攻击力 +7%<br>'
        temp += '百分比力智 +7%<br>'
        if 属性.天命无常 == 0:
            if 属性.装备检查('命运反抗者'):
                temp += '百分比力智 +5.6%<br>'
                temp += '移动速度 +6.6%<br>'
                temp += '攻击速度 +6.6%<br>'
            else:
                temp += '移动速度 +5.5%<br>'
                temp += '攻击速度 +5.5%<br>'
                temp += '百分比力智 +4.6666667%<br>'
        if 属性.天命无常 == 4 or 属性.天命无常 == 5:
            temp += '百分比力智 +7%<br>'
            temp += '移动速度 +' +str(3 * 属性.天命无常) +'%<br>'
            temp += '攻击速度 +' +str(3 * 属性.天命无常) +'%<br>'
        if 属性.天命无常 == 6:
            temp += '百分比力智 +14%<br>'
            temp += '移动速度 +' +str(3 * 属性.天命无常) +'%<br>'
            temp += '攻击速度 +' +str(3 * 属性.天命无常) +'%<br>'
        return temp     

class 套装效果68():
    名称 = '悲剧的残骸'
    件数 = 3
    类型 = '环鞋指'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.29)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +29%<br>'
        return temp

#endregion

#region  首饰套装
class 套装效果69():
    名称 = '上古尘封术士'
    件数 = 2
    类型 = '首饰'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.10)
        属性.百分比三攻加成(0.14)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +10%<br>'
        temp += '百分比三攻 +14%<br>'
        return temp   

class 套装效果70():
    名称 = '破晓曦光'
    件数 = 2
    类型 = '首饰'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.10)
        属性.最终伤害加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +10%<br>'
        temp += '最终伤害 +10%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp


class 套装效果71():
    名称 = '幸运三角'
    件数 = 2
    类型 = '首饰'
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(77)
        属性.物理攻击力 += 77
        属性.魔法攻击力 += 77
        属性.独立攻击力 += 77
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.07
        属性.魔法暴击率 += 0.07
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '所有属性强化 +77<br>'
        temp += '物理暴击率 +7%<br>'
        temp += '魔法暴击率 +7%<br>'
        return temp
    

class 套装效果72():
    名称 = '精灵使的权能'
    件数 = 2
    类型 = '首饰'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.10)
        属性.技能攻击力加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +10%<br>'
        temp += '技能攻击力 +12%<br>'
        return temp   

class 套装效果73():
    名称 = '上古尘封术士'
    件数 = 3
    类型 = '首饰'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.20)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +20%<br>'
        return temp


class 套装效果74():
    名称 = '破晓曦光'
    件数 = 3
    类型 = '首饰'
    def 城镇属性(self, 属性):
        属性.属性附加加成(0.10)
        属性.技能等级加成('所有', 100, 100, 1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.10
        属性.移动速度 += 0.10
        属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '属性附加 +10%<br>'
        temp += 'Lv100 技能等级+1<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        return temp    

class 套装效果75():
    名称 = '幸运三角'
    件数 = 3
    类型 = '首饰'
    def 城镇属性(self, 属性):
        if 属性.幸运三角 == 0:
            属性.技能攻击力加成(0.2915)
        elif 属性.幸运三角 == 1:
           属性.技能攻击力加成(0.27)
        elif 属性.幸运三角 == 2:
            属性.技能攻击力加成(0.31)
        elif 属性.幸运三角 == 3:
            属性.技能攻击力加成(0.34)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.幸运三角 == 0:
            属性.攻击速度 += 0.005
            属性.移动速度 += 0.005
            属性.释放速度 += 0.0075
        if 属性.幸运三角 == 3:
            属性.攻击速度 += 0.10
            属性.移动速度 += 0.10
            属性.释放速度 += 0.15  
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.幸运三角 == 0:
            temp += '技能攻击力 +29.15%<br>'
            temp += '攻击速度 +0.5%<br>'
            temp += '移动速度 +0.5%<br>'
            temp += '释放速度 +0.75%<br>'
        if 属性.幸运三角 == 1:
            temp += '技能攻击力 +27%<br>'
        if 属性.幸运三角 == 2:
            temp += '技能攻击力 +31%<br>'
        if 属性.幸运三角 == 3:
            temp += '技能攻击力 +34%<br>'
            temp += '攻击速度 +10%<br>'
            temp += '移动速度 +10%<br>'
            temp += '释放速度 +15%<br>'
        return temp       

class 套装效果76():
    名称 = '精灵使的权能'
    件数 = 3
    类型 = '首饰'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.10)
        属性.技能冷却缩减(1, 100, 0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +10%<br>'
        temp += 'Lv1-100 技能CD-10%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp
#endregion

#region  特殊套装
class 套装效果77():
    名称 = '军神的隐秘遗产'
    件数 = 2
    类型 = '特殊'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.10)
        属性.最终伤害加成(0.08)
        if 属性.装备检查('军神的遗书'):
            if 属性.装备检查('军神的心之所念'):
                属性.暴击伤害加成(0.05)
            if 属性.装备检查('军神的古怪耳环'):
                属性.暴击伤害加成(0.05)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('军神的遗书'):
            if 属性.装备检查('军神的心之所念'):
                属性.攻击速度 += 0.05
                属性.移动速度 += 0.10
                属性.释放速度 += 0.075
            if 属性.装备检查('军神的古怪耳环'):
                属性.移动速度 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +10%<br>'
        temp += '最终伤害 +8%<br>'
        if 属性.装备检查('军神的遗书'):
            if 属性.装备检查('军神的心之所念'):
                temp += '暴击伤害 +5%<br>'
                temp += '攻击速度 +5%<br>'
                temp += '移动速度 +10%<br>'
                temp += '释放速度 +7.5%<br>'
            if 属性.装备检查('军神的古怪耳环'):
                temp += '暴击伤害 +5%<br>'
                temp += '移动速度 +5%<br>'
        return temp     

class 套装效果78():
    名称 = '时间战争的残骸'
    件数 = 2
    类型 = '特殊'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.11)
        属性.暴击伤害加成(0.11)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +11%<br>'
        temp += '暴击伤害 +11%<br>'
        return temp    

class 套装效果79():
    名称 = '灵宝：世间真理'
    件数 = 2
    类型 = '特殊'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.15)
        属性.技能攻击力加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +15%<br>'
        temp += '技能攻击力 +7%<br>'
        return temp
class 套装效果80():
    名称 = '能量主宰'
    件数 = 2
    类型 = '特殊'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.12)
        属性.伤害增加加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +12%<br>'
        temp += '伤害增加 +12%<br>'
        return temp  

class 套装效果81():
    名称 = '军神的隐秘遗产'
    件数 = 3
    类型 = '特殊'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.10)
        if 属性.军神的隐秘遗产 == 0:
            属性.百分比力智加成(0.10)
        if 属性.军神的隐秘遗产 == 1:
            属性.百分比力智加成(0.10)
        if 属性.军神的隐秘遗产 == 2:
            属性.百分比力智加成(0.08)
        if 属性.军神的隐秘遗产 == 3:
            属性.百分比力智加成(0.06)
        if 属性.军神的隐秘遗产 == 4:
            属性.百分比力智加成(0.04)
        if 属性.军神的隐秘遗产 == 5:
            属性.百分比力智加成(0.02)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.军神的隐秘遗产 == 0:
            属性.攻击速度 += 0.10
            属性.释放速度 += 0.15
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '技能攻击力 +10%<br>'
        if 属性.军神的隐秘遗产 == 0:
            temp += '百分比力智 +10%<br>'
        if 属性.军神的隐秘遗产 == 1:
            temp += '百分比力智 +10%<br>'
        if 属性.军神的隐秘遗产 == 2:
            temp += '百分比力智 +8%<br>'
        if 属性.军神的隐秘遗产 == 3:
            temp += '百分比力智 +6%<br>'
        if 属性.军神的隐秘遗产 == 4:
            temp += '百分比力智 +4%<br>'
        if 属性.军神的隐秘遗产 == 5:
            temp += '百分比力智 +2%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        return temp      

class 套装效果82():
    名称 = '时间战争的残骸'
    件数 = 3
    类型 = '特殊'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.10)
        属性.技能攻击力加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +10%<br>'
        temp += '技能攻击力 +10%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp
      

class 套装效果83():
    名称 = '灵宝：世间真理'
    件数 = 3
    类型 = '特殊'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        属性.技能等级加成('所有', 1, 85, 1)
        属性.技能等级加成('所有', 100, 100, 1)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.10
        属性.移动速度 += 0.10
        属性.释放速度 += 0.15
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +12%<br>'
        temp += 'Lv1-85 技能等级+1<br>'
        temp += 'Lv100  技能等级+1<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp   

class 套装效果84():
    名称 = '能量主宰'
    件数 = 3
    类型 = '特殊'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.10)
        属性.技能攻击力加成(0.08)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.10
        属性.魔法暴击率 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +10%<br>'
        temp += '技能攻击力 +8%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp
#endregion

#region  其它套装
class 套装效果85():
    名称 = '超界·苍穹之云'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.10)
        属性.伤害增加加成(0.13)
        属性.技能等级加成('所有', 50, 50, 2)
        属性.技能等级加成('所有', 85, 85, 2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.释放速度 += 0.075
        属性.移动速度 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +10%<br>'
        temp += '伤害增加 +13%<br>'
        temp += 'Lv50 技能等级+2<br>'
        temp += 'Lv85 技能等级+2<br>'
        temp += '攻击速度 +5%<br>'
        temp += '释放速度 +7.5%<br>'
        temp += '移动速度 +5%<br>'
        return temp      

class 套装效果86():
    名称 = '超界·苍穹之云'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.36)
        属性.技能等级加成('所有', 50, 50, 2)
        属性.技能等级加成('所有', 85, 85, 2)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.17
        属性.释放速度 += 0.255
        属性.移动速度 += 0.17
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +36%<br>'
        temp += 'Lv50 技能等级+2<br>'
        temp += 'Lv85 技能等级+2<br>'
        temp += '攻击速度 +17%<br>'
        temp += '释放速度 +25.5%<br>'
        temp += '移动速度 +17%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp

class 套装效果87():
    名称 = '超界·永恒的季节'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.技能攻击力加成(0.12)
        属性.最终伤害加成(0.25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.10
        属性.魔法暴击率 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '技能攻击力 +12%<br>'
        temp += '最终伤害 +25%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp

class 套装效果88():
    名称 = '超界·永恒的季节'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.48)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.17
        属性.释放速度 += 0.255
        属性.移动速度 += 0.17
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +48%<br>'
        temp += '攻击速度 +17%<br>'
        temp += '释放速度 +25.5%<br>'
        temp += '移动速度 +17%<br>'
        return temp
     

class 套装效果89():
    名称 = '超界·亿万年的星光'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.技能等级加成('所有', 50, 50, 2)
        属性.技能等级加成('所有', 85, 85, 1)
        属性.最终伤害加成(0.25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += 'Lv50 技能等级+2<br>'
        temp += 'Lv85 技能等级+1<br>'
        temp += '最终伤害 +25%<br>'
        return temp 

class 套装效果90():
    名称 = '超界·亿万年的星光'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.属性附加加成(0.35)
        属性.技能等级加成('所有', 85, 85, 1)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.10
        属性.释放速度 += 0.15
        属性.移动速度 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '属性附加 +35%<br>'
        temp += 'Lv85 技能等级+1<br>'
        temp += '攻击速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        temp += '移动速度 +10%<br>'
        return temp  

class 套装效果91():
    名称 = '超界·精灵的荣耀'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.06
        属性.释放速度 += 0.09
        属性.移动速度 += 0.06
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +35%<br>'
        temp += '攻击速度 +6%<br>'
        temp += '释放速度 +9%<br>'
        temp += '移动速度 +6%<br>'
        return temp  

class 套装效果92():
    名称 = '超界·精灵的荣耀'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.45)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.06
        属性.释放速度 += 0.09
        属性.移动速度 += 0.06
        属性.物理暴击率 += 0.10
        属性.魔法暴击率 += 0.10
        属性.移动速度 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +45%<br>'
        temp += '攻击速度 +6%<br>'
        temp += '释放速度 +9%<br>'
        temp += '移动速度 +6%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        temp += '移动速度 +10%<br>'
        return temp     

class 套装效果93():
    名称 = '超界·幸运的五彩石'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(25)
        属性.最终伤害加成(0.25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.10
        属性.魔法暴击率 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '所有属性强化 +25<br>'
        temp += '最终伤害 +25%<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp
  

class 套装效果94():
    名称 = '超界·幸运的五彩石'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.属性附加加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.10
        属性.释放速度 += 0.15
        属性.移动速度 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '属性附加 +35%<br>'
        temp += '攻击速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        temp += '移动速度 +10%<br>'
        return temp     

class 套装效果95():
    名称 = '黑暗的第一权能'
    件数 = 3
    类型 = '首饰'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.12)
        属性.百分比力智加成(0.12)
        属性.技能攻击力加成(0.08)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.释放速度 += 0.075
        属性.移动速度 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +12%<br>'
        temp += '百分比力智 +12%<br>'
        temp += '技能攻击力 +8%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '释放速度 +7.5%<br>'
        temp += '移动速度 +5%<br>'
        return temp     

class 套装效果96():
    名称 = '黑暗的第二权能'
    件数 = 3
    类型 = '特殊'
    def 城镇属性(self, 属性):
        属性.暴击伤害加成(0.10)
        属性.百分比力智加成(0.08)
        属性.技能攻击力加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.释放速度 += 0.075
        属性.移动速度 += 0.05
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '暴击伤害 +10%<br>'
        temp += '百分比力智 +8%<br>'
        temp += '技能攻击力 +15%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '释放速度 +7.5%<br>'
        temp += '移动速度 +5%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp
      

class 套装效果97():
    名称 = '维度崩坏'
    件数 = 3
    类型 = '首饰'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·维度冲击臂环'):
            属性.力量 += 200
            属性.智力 += 200
            属性.百分比力智加成(0.15)
            属性.附加伤害加成(0.10)
            属性.暴击伤害加成(0.10)
            属性.百分比三攻加成(0.13)
        elif 属性.装备检查('时空：维度冲击臂环'):
            属性.附加伤害加成(0.05)
            属性.暴击伤害加成(0.15)
        else:
            属性.百分比力智加成(0.04)
            属性.附加伤害加成(0.04)
            属性.技能攻击力加成(0.08)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·维度冲击臂环'):
            属性.物理暴击率 += 0.03
            属性.魔法暴击率 += 0.03
        else:
            pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·维度冲击臂环'):
            temp += '力量 +200<br>'
            temp += '智力 +200<br>'
            temp += '百分比力智 +15%<br>'
            temp += '附加伤害 +10%<br>'
            temp += '暴击伤害 +10%<br>'
            temp += '百分比三攻 +13%<br>'
            temp += '物理暴击率 +3%<br>'
            temp += '魔法暴击率 +3%<br>'
        elif 属性.装备检查('时空：维度冲击臂环'):
            temp += '附加伤害 +5%<br>'
            temp += '暴击伤害 +15%<br>'
        else:
            temp += '百分比力智 +4%<br>'
            temp += '附加伤害 +4%<br>'
            temp += '技能攻击力 +8%<br>'
        return temp      

class 套装效果98():
    名称 = '暗之腐蚀'
    件数 = 3
    类型 = '特殊'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·腐蚀之黑色十字耳环'):
            属性.力量 += 200
            属性.智力 += 200
            属性.百分比力智加成(0.05)
            属性.附加伤害加成(0.16)
            属性.暴击伤害加成(0.23)
            属性.技能攻击力加成(0.05)
        elif 属性.装备检查('时空：腐蚀之黑色十字耳环'):
            属性.附加伤害加成(0.13)
            属性.暴击伤害加成(0.05)
            属性.技能攻击力加成(0.05)
        else:
            属性.百分比力智加成(0.05)
            属性.技能攻击力加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·腐蚀之黑色十字耳环'):
            属性.物理暴击率 += 0.04
            属性.魔法暴击率 += 0.04
        else:
            pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·腐蚀之黑色十字耳环'):
            temp += '力量 +200<br>'
            temp += '智力 +200<br>'
            temp += '百分比力智 +5%<br>'
            temp += '附加伤害 +16%<br>'
            temp += '暴击伤害 +23%<br>'
            temp += '技能攻击力 +5%<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        elif 属性.装备检查('时空：腐蚀之黑色十字耳环'):
            temp += '附加伤害 +13%<br>'
            temp += '暴击伤害 +5%<br>'
            temp += '技能攻击力 +5%<br>'
        else:
            temp += '百分比力智 +5%<br>'
            temp += '技能攻击力 +15%<br>'
        return temp

class 套装效果99():
    名称 = '堕落的暗黑之力'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·黑暗幽灵紫杉胸甲'):
            属性.力量 += 200
            属性.智力 += 200
            属性.百分比三攻加成(0.12)
            属性.伤害增加加成(0.10)
            属性.暴击伤害加成(0.10)
            属性.最终伤害加成(0.05)
        elif 属性.装备检查('时空：黑暗幽灵紫杉胸甲'):
            属性.百分比三攻加成(0.06)
            属性.伤害增加加成(0.10)
            属性.暴击伤害加成(0.10)
        else:
            属性.伤害增加加成(0.10)
            属性.暴击伤害加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·黑暗幽灵紫杉胸甲'):
            pass
        else:
            属性.物理暴击率 += 0.04
            属性.魔法暴击率 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·黑暗幽灵紫杉胸甲'):
            temp += '力量 +200<br>'
            temp += '智力 +200<br>'
            temp += '百分比三攻 +12%<br>'
            temp += '伤害增加 +10%<br>'
            temp += '暴击伤害 +10%<br>'
            temp += '最终伤害 +5%<br>'
        elif 属性.装备检查('时空：黑暗幽灵紫杉胸甲'):
            temp += '百分比三攻 +6%<br>'
            temp += '伤害增加 +10%<br>'
            temp += '暴击伤害 +10%<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        else:
            temp += '伤害增加 +10%<br>'
            temp += '暴击伤害 +10%<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        return temp     

class 套装效果100():
    名称 = '堕落的暗黑之力'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·黑暗幽灵紫杉胸甲'):
            属性.力量 += 200
            属性.智力 += 200
            属性.附加伤害加成(0.20)
            属性.最终伤害加成(0.20)
            属性.技能攻击力加成(0.16)
        elif 属性.装备检查('时空：黑暗幽灵紫杉胸甲'):
            属性.附加伤害加成(0.07)
            属性.最终伤害加成(0.20)
            属性.技能攻击力加成(0.10)
        else:
            属性.附加伤害加成(0.13)
            属性.最终伤害加成(0.12)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·黑暗幽灵紫杉胸甲'):
            属性.物理暴击率 += 0.08
            属性.魔法暴击率 += 0.08
        else:
            pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·黑暗幽灵紫杉胸甲'):
            temp += '力量 +200<br>'
            temp += '智力 +200<br>'
            temp += '附加伤害 +20%<br>'
            temp += '最终伤害 +20%<br>'
            temp += '技能攻击力 +16%<br>'
            temp += '物理暴击率 +8%<br>'
            temp += '魔法暴击率 +8%<br>'
        elif 属性.装备检查('时空：黑暗幽灵紫杉胸甲'):
            temp += '附加伤害 +7%<br>'
            temp += '最终伤害 +20%<br>'
            temp += '技能攻击力 +10%<br>'
        else:        
            temp += '附加伤害 +13%<br>'
            temp += '最终伤害 +12%<br>'
        return temp

class 套装效果101():
    名称 = '江山如画'
    件数 = 3
    类型 = '首饰'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.20)
        属性.技能攻击力加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +20%<br>'
        temp += '技能攻击力 +10%<br>'
        return temp     

class 套装效果102():
    名称 = '万物的生灭'
    件数 = 3
    类型 = '特殊'
    def 城镇属性(self, 属性):
        属性.最终伤害加成(0.12)
        属性.技能攻击力加成(0.20)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '最终伤害 +12%<br>'
        temp += '技能攻击力 +20%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp
     

class 套装效果103():
    名称 = '兵法之神'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.12)
        属性.物理攻击力 += 200
        属性.魔法攻击力 += 200
        属性.独立攻击力 += 200
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.10
        属性.移动速度 += 0.10
        属性.释放速度 += 0.15
        属性.物理暴击率 += 0.05
        属性.魔法暴击率 += 0.05
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +12%<br>'
        temp += '物理攻击力 +200<br>'
        temp += '魔法攻击力 +200<br>'
        temp += '独立攻击力 +200<br>'
        temp += '攻击速度 +10%<br>'
        temp += '移动速度 +10%<br>'
        temp += '释放速度 +15%<br>'
        temp += '物理暴击率 +5%<br>'
        temp += '魔法暴击率 +5%<br>'
        return temp      

class 套装效果104():
    名称 = '兵法之神'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.所有属性强化加成(25)
        属性.百分比三攻加成(0.22)
        属性.技能攻击力加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '所有属性强化 +25<br>'
        temp += '百分比三攻 +22%<br>'
        temp += '技能攻击力 +10%<br>'
        return temp  

class 套装效果105():
    名称 = '流逝轮回的记忆'
    件数 = 3
    类型 = '首饰'
    def 城镇属性(self, 属性):
        属性.百分比减防 += 0.02
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比减防 +5%<br>'
        temp += '(BOSS：实际2%)<br>'
        return temp        

class 套装效果106():
    名称 = '无相轮回的希望'
    件数 = 2
    类型 = '特殊'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(10)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '所有属性强化 +10<br>'
        return temp 

class 套装效果107():
    名称 = '魔战无双'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.35)
        属性.技能等级加成('所有', 50, 75, 2)
        属性.技能等级加成('所有', 85, 85, 1)
        try:
            属性.技能栏[属性.技能序号['基础精通']].倍率 *= 1.2
        except:
            pass
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.10 * 3
        属性.移动速度 += 0.10 * 3
        属性.释放速度 += 0.15 * 3
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +35%<br>'
        temp += 'Lv50-75 技能等级+2<br>'
        temp += 'Lv85 技能等级+1<br>'
        temp += '基础精通效果 +20%<br>'
        temp += '攻击速度 +10% x3<br>'
        temp += '移动速度 +10% x3<br>'
        temp += '释放速度 +15% x3<br>'
        return temp     

class 套装效果108():
    名称 = '霸域英豪'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.物理攻击力 += 300
        属性.魔法攻击力 += 300
        属性.独立攻击力 += 300
        属性.力量 += 220
        属性.智力 += 220
        pass
    def 进图属性(self, 属性):
        属性.附加伤害加成(0.40)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.05
        属性.移动速度 += 0.05
        属性.释放速度 += 0.20
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '物理攻击力 +300<br>'
        temp += '魔法攻击力 +300<br>'
        temp += '独立攻击力 +300<br>'
        temp += '力量 +200<br>'
        temp += '智力 +200<br>'
        temp += '附加伤害 +40%<br>'
        temp += '攻击速度 +5%<br>'
        temp += '移动速度 +5%<br>'
        temp += '释放速度 +20%<br>'
        return temp      

class 套装效果109():
    名称 = '千蛛碎影'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比三攻加成(0.12)
        属性.黄字 = max(属性.黄字, 0.45)
        if 属性.职业 == '街霸':
            for i in 属性.技能栏:
                if i.是否有伤害 == 1:
                    i.中毒倍率 += 0.3
                    if 属性.角色 == '格斗家(男)':
                        i.感电倍率 += 0.3
                    else:
                        i.涂毒倍率 += 0.3
                    i.出血倍率 += 0.3
                    i.灼伤倍率 += 0.3
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.10
        属性.魔法暴击率 += 0.10
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '中毒、涂毒伤害 +30%<br>'
        temp += '感电伤害 +30%<br>'
        temp += '出血伤害 +30%<br>'
        temp += '灼伤伤害 +30%<br>'
        temp += '百分比三攻 +12%<br>'
        temp += '黄字 +45%(取最高值)<br>'
        temp += '物理暴击率 +10%<br>'
        temp += '魔法暴击率 +10%<br>'
        return temp     

class 套装效果110():
    名称 = '誓血之盟'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.百分比三攻加成(0.30)
        属性.爆伤 = max(属性.爆伤, 0.20)
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比三攻 +30%<br>'
        temp += '爆伤 +20%(取最高值)<br>'
        return temp    

class 套装效果111():
    名称 = '天御之灾'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        if 天御套装 == 0:
            属性.所有属性强化加成(10)
            属性.属性附加加成(0.20)
            属性.附加伤害加成(0.09)
        elif 天御套装 == 1:
            属性.所有属性强化加成(50)
            属性.属性附加加成(0.25)
        elif 天御套装 == 2:
            属性.附加伤害加成(0.45)
        pass
    def 其它属性(self, 属性):
        if 天御套装 == 0:
            属性.攻击速度 += 0.04
            属性.移动速度 += 0.04
            属性.释放速度 += 0.05
        elif 天御套装 == 2:
            属性.攻击速度 += 0.20
            属性.移动速度 += 0.20
            属性.释放速度 += 0.25            
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 天御套装 == 0:
            temp += '所有属性强化 +10<br>'
            temp += '属性附加 +20%<br>'
            temp += '附加伤害 +9%<br>'
            temp += '攻击速度 +4%<br>'
            temp += '移动速度 +4%<br>'
            temp += '释放速度 +5%<br>'
        elif 天御套装 == 1:
            temp += '所有属性强化 +50<br>'
            temp += '属性附加 +25%<br>'
        elif 天御套装 == 2:
            temp += '附加伤害 +45%<br>'
            temp += '攻击速度 +20%<br>'
            temp += '移动速度 +20%<br>'
            temp += '释放速度 +25%<br>'
        return temp     

class 套装效果112():
    名称 = '最佳球手的绝杀'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.05)
        pass
    def 进图属性(self, 属性):
        属性.百分比三攻加成(0.40)
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.30
        属性.移动速度 += 0.30
        属性.释放速度 += 0.445
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +5%<br>'
        temp += '百分比三攻 +40%<br>'
        temp += '攻击速度 +30%<br>'
        temp += '移动速度 +30%<br>'
        temp += '释放速度 +44.5%<br>'
        return temp   

class 套装效果113():
    名称 = '战术之王的御敌'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(战术白字)
        pass
    def 进图属性(self, 属性):
        属性.力量 += 620
        属性.智力 += 620
        pass
    def 其它属性(self, 属性):
        属性.攻击速度 += 0.20
        属性.移动速度 += 0.20
        属性.释放速度 += 0.20  
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +' + str(int(战术白字 * 100)) +'%<br>'
        temp += '攻击速度 +20%<br>'
        temp += '移动速度 +20%<br>'
        temp += '释放速度 +20%<br>'
        return temp
    

class 套装效果114():
    名称 = '杀意决'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.12)
        属性.力量 += 150
        属性.智力 += 150
        属性.附加伤害加成(0.35)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +12%<br>'
        temp += '力量 +150<br>'
        temp += '智力 +150<br>'
        temp += '附加伤害 +35%<br>'
        return temp


class 套装效果115():
    名称 = '逝魔之力'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        属性.百分比力智加成(0.18)
        属性.魔法攻击力 += 550
        属性.独立攻击力 += 550
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '百分比力智 +18%<br>'
        temp += '魔法攻击力 +550<br>'
        temp += '独立攻击力 +550<br>'
        return temp
    

class 套装效果116():
    名称 = '天劫'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        pass
    def 进图属性(self, 属性):
        属性.所有属性强化加成(50)
        属性.智力 += 400
        属性.技能攻击力加成(0.18)
        属性.百分比减防 += 0.10 * 天劫减防
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '所有属性强化 +50<br>'
        temp += '智力 +400<br>'
        temp += '技能攻击力 +18%<br>'
        if 天劫减防 == 1:
            temp += '百分比减防 +20%<br>'
            temp += '(BOSS：实际10%)<br>'
        return temp  

class 套装效果117():
    名称 = '冰雪公主的霜语首饰'
    件数 = 3
    类型 = '首饰'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.18)
        属性.冰属性强化加成(50)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +18%<br>'
        temp += '冰属性强化 +50<br>'
        return temp  

class 套装效果118():
    名称 = '精炼的异界魔石首饰'
    件数 = 3
    类型 = '首饰'
    def 城镇属性(self, 属性):
        属性.附加伤害加成(0.20)
        属性.所有属性强化加成(18)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        属性.物理暴击率 += 0.12
        属性.魔法暴击率 += 0.12        
        pass
    def 装备描述(self, 属性):
        temp = ''
        temp += '附加伤害 +20%<br>'
        temp += '所有属性强化 +18<br>'
        temp += '物理暴击率 +12%<br>'
        temp += '魔法暴击率 +12%<br>'
        return temp
#endregion

#region 新增传说两件套 &光环套
class 套装效果119():
    名称 = '维度崩坏'
    件数 = 2
    类型 = '首饰'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·维度冲击臂环'):
            pass
        elif 属性.装备检查('时空：维度冲击臂环'):
            属性.百分比力智加成(0.10)
            属性.附加伤害加成(0.05)
        else:
            属性.百分比力智加成(0.04)
            属性.附加伤害加成(0.04)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·维度冲击臂环'):
            pass
        else:
            属性.物理暴击率 += 0.03
            属性.魔法暴击率 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·维度冲击臂环'):
            temp += '无<br>'
        elif 属性.装备检查('时空：维度冲击臂环'):
            temp += '百分比力智 +10%<br>'
            temp += '附加伤害 +5%<br>'
            temp += '物理暴击率 +3%<br>'
            temp += '魔法暴击率 +3%<br>'
        else:
            temp += '百分比力智 +4%<br>'
            temp += '附加伤害 +4%<br>'
            temp += '物理暴击率 +3%<br>'
            temp += '魔法暴击率 +3%<br>'
        return temp   


class 套装效果120():
    名称 = '暗之腐蚀'
    件数 = 2
    类型 = '特殊'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·腐蚀之黑色十字耳环'):
            pass
        elif 属性.装备检查('时空：腐蚀之黑色十字耳环'):
            属性.百分比力智加成(0.10)
            属性.暴击伤害加成(0.05)
        else:
            属性.暴击伤害加成(0.10)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·腐蚀之黑色十字耳环'):
            pass
        else:
            属性.物理暴击率 += 0.04
            属性.魔法暴击率 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·腐蚀之黑色十字耳环'):
            temp += '无<br>'
        elif 属性.装备检查('时空：腐蚀之黑色十字耳环'):
            temp += '百分比力智 +10%<br>'
            temp += '暴击伤害 +5%<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        else:
            temp += '暴击伤害 +10%<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        return temp   

class 套装效果121():
    名称 = '先贤的馈赠'
    件数 = 2
    类型 = '首饰'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·先贤的馈赠手镯'):
            pass
        elif 属性.装备检查('时空：先贤的馈赠手镯'):
            属性.百分比力智加成(0.10)
            属性.附加伤害加成(0.05)
        else:
            属性.百分比力智加成(0.04)
            属性.附加伤害加成(0.04)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·先贤的馈赠手镯'):
            pass
        else:
            属性.物理暴击率 += 0.03
            属性.魔法暴击率 += 0.03
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·先贤的馈赠手镯'):
            temp += '无<br>'
        elif 属性.装备检查('时空：先贤的馈赠手镯'):
            temp += '百分比力智 +10%<br>'
            temp += '附加伤害 +5%<br>'
            temp += '物理暴击率 +3%<br>'
            temp += '魔法暴击率 +3%<br>'
        else:
            temp += '百分比力智 +4%<br>'
            temp += '附加伤害 +4%<br>'
            temp += '物理暴击率 +3%<br>'
            temp += '魔法暴击率 +3%<br>'
        return temp      

class 套装效果122():
    名称 = '先贤的馈赠'
    件数 = 3
    类型 = '首饰'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·先贤的馈赠手镯'):
            属性.力量 += 200
            属性.智力 += 200
            属性.百分比力智加成(0.15)
            属性.附加伤害加成(0.10)
            属性.技能攻击力加成(0.05)
            属性.百分比三攻加成(0.13)
        elif 属性.装备检查('时空：先贤的馈赠手镯'):
            属性.附加伤害加成(0.05)
            属性.技能攻击力加成(0.05)
        else:
            属性.百分比力智加成(0.04)
            属性.附加伤害加成(0.04)
            属性.技能攻击力加成(0.05)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·先贤的馈赠手镯'):
            属性.物理暴击率 += 0.03
            属性.魔法暴击率 += 0.03
        else:
            pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·先贤的馈赠手镯'):
            temp += '力量 +200<br>'
            temp += '智力 +200<br>'
            temp += '百分比力智 +15%<br>'
            temp += '附加伤害 +10%<br>'
            temp += '技能攻击力 +5%<br>'
            temp += '百分比三攻 +13%<br>'
            temp += '物理暴击率 +3%<br>'
            temp += '魔法暴击率 +3%<br>'
        elif 属性.装备检查('时空：先贤的馈赠手镯'):
            temp += '附加伤害 +5%<br>'
            temp += '技能攻击力 +5%<br>'
        else:
            temp += '百分比力智 +4%<br>'
            temp += '附加伤害 +4%<br>'
            temp += '技能攻击力 +5%<br>'
        return temp      

class 套装效果123():
    名称 = '堕落的暗黑之力'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·黑暗幽灵紫杉胸甲'):
            pass
        elif 属性.装备检查('时空：黑暗幽灵紫杉胸甲'):
            属性.最终伤害加成(0.05)
            属性.附加伤害加成(0.07)
        else:
            属性.百分比三攻加成(0.05)
            属性.附加伤害加成(0.07)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·黑暗幽灵紫杉胸甲'):
            pass
        else:
            属性.物理暴击率 += 0.04
            属性.魔法暴击率 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·黑暗幽灵紫杉胸甲'):
            temp += '无<br>'
        elif 属性.装备检查('时空：黑暗幽灵紫杉胸甲'):
            temp += '最终伤害 +5%<br>'
            temp += '附加伤害 +7%<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        else:
            temp += '百分比三攻 +5%<br>'
            temp += '附加伤害 +7%<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        return temp

class 套装效果124():
    名称 = '鲜红血纹'
    件数 = 2
    类型 = '防具'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            pass
        elif 属性.装备检查('时空：鲜红血纹皮甲胸铠'):
            属性.百分比力智加成(0.10)
            属性.所有属性强化加成(25)
        else:
            属性.百分比力智加成(0.05)
            属性.所有属性强化加成(25)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            pass
        else:
            属性.物理暴击率 += 0.04
            属性.魔法暴击率 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            temp += '无<br>'
        elif 属性.装备检查('时空：鲜红血纹皮甲胸铠'):
            temp += '百分比力智 +10%<br>'
            temp += '所有属性强化 +25<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        else:
            temp += '百分比力智 +5%<br>'
            temp += '所有属性强化 +25<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        return temp    

class 套装效果125():
    名称 = '鲜红血纹'
    件数 = 3
    类型 = '防具'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            属性.力量 += 200
            属性.智力 += 200
            属性.附加伤害加成(0.10)
            属性.最终伤害加成(0.10)
            属性.所有属性强化加成(20)
            属性.百分比三攻加成(0.05)
        elif 属性.装备检查('时空：鲜红血纹皮甲胸铠'):
            属性.附加伤害加成(0.10)
            属性.最终伤害加成(0.08)
            属性.所有属性强化加成(15)
            属性.百分比三攻加成(0.05)
        else:
            属性.附加伤害加成(0.10)
            属性.所有属性强化加成(10)
            属性.百分比三攻加成(0.05)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            pass
        else:
            属性.物理暴击率 += 0.04
            属性.魔法暴击率 += 0.04
        pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            temp += '力量 +200<br>'
            temp += '智力 +200<br>'
            temp += '附加伤害 +10%<br>'
            temp += '最终伤害 +10%<br>'
            temp += '所有属性强化 +20<br>'
            temp += '百分比三攻 +5%<br>'
        elif 属性.装备检查('时空：鲜红血纹皮甲胸铠'):
            temp += '附加伤害 +10%<br>'
            temp += '最终伤害 +8%<br>'
            temp += '所有属性强化 +15<br>'
            temp += '百分比三攻 +5%<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        else:
            temp += '附加伤害 +10%<br>'
            temp += '所有属性强化 +10<br>'
            temp += '百分比三攻 +5%<br>'
            temp += '物理暴击率 +4%<br>'
            temp += '魔法暴击率 +4%<br>'
        return temp        

class 套装效果126():
    名称 = '鲜红血纹'
    件数 = 5
    类型 = '防具'
    def 城镇属性(self, 属性):
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            属性.力量 += 200
            属性.智力 += 200
            属性.所有属性强化加成(30)
            属性.最终伤害加成(0.06)
            属性.百分比力智加成(0.10)
            属性.技能攻击力加成(0.16)
            属性.百分比三攻加成(0.15)
        elif 属性.装备检查('时空：鲜红血纹皮甲胸铠'):
            属性.所有属性强化加成(10)
            属性.最终伤害加成(0.05)
            属性.技能攻击力加成(0.10)
            属性.百分比三攻加成(0.15)
        else:
            属性.所有属性强化加成(15)
            属性.百分比力智加成(0.05)
            属性.百分比三攻加成(0.15)
        pass
    def 进图属性(self, 属性):
        pass
    def 其它属性(self, 属性):
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            属性.物理暴击率 += 0.08
            属性.魔法暴击率 += 0.08
        else:
            pass
    def 装备描述(self, 属性):
        temp = ''
        if 属性.装备检查('轮回·鲜红血纹皮甲胸铠'):
            temp += '力量 +200<br>'
            temp += '智力 +200<br>'
            temp += '所有属性强化 +30<br>'
            temp += '最终伤害 +6%<br>'
            temp += '百分比力智 +10%<br>'
            temp += '技能攻击力 +16%<br>'
            temp += '百分比三攻 +15%<br>'
            temp += '物理暴击率 +8%<br>'
            temp += '魔法暴击率 +8%<br>'
        elif 属性.装备检查('时空：鲜红血纹皮甲胸铠'):
            temp += '所有属性强化 +10<br>'
            temp += '最终伤害 +5%<br>'
            temp += '技能攻击力 +10%<br>'
            temp += '百分比三攻 +15%<br>'
        else:
            temp += '所有属性强化 +15<br>'
            temp += '百分比力智 +5%<br>'
            temp += '百分比三攻 +15%<br>'
        return temp    
#endregion

装备列表 = []
i = 0
while i >= 0:
    try: exec('装备列表.append(装备'+str(i)+'())'); i += 1
    except: i = -1

装备序号 = dict()
套装映射 = dict()
for i in range(len(装备列表)):
    装备序号[装备列表[i].名称] = i
    套装映射[装备列表[i].所属套装 + '-' + 装备列表[i].品质 + '-' + 装备列表[i].部位] = i

套装列表 = []
i = 0
while i >= 0:
    try: exec('套装列表.append(套装效果'+str(i)+'())'); i += 1
    except: i = -1

套装序号 = dict()
for i in range(len(套装列表)):
    套装序号[套装列表[i].名称 + '[' + str(套装列表[i].件数) + ']'] = i

